[
  {
    "title": "Sekuwa ",
    "image": "images/sekuwa.png",
    "description": "Grilled meat skewers , Basically Pork Meat is More famous for Sekuwa",
    "steps": [
      "Ingredients:",
      "- 500 grams of boneless meat (chicken, mutton, or buffalo)",
      "- 2 tablespoons yogurt",
      "- 1 tablespoon mustard oil",
      "- 1 tablespoon ginger paste",
      "- 1 tablespoon garlic paste",
      "- 1 teaspoon cumin powder",
      "- 1 teaspoon coriander powder",
      "- 1 teaspoon turmeric powder",
      "- 1 teaspoon red chili powder (adjust to taste)",
      "- Salt to taste",
      "For Grilling:",
      "- Skewers (metal or bamboo, if using bamboo, soak them in water for about 30 minutes)",
      "- Cooking oil or ghee for brushing",
      "Instructions:",
      "1. Prepare the Meat:",
      "- Cut the boneless meat into bite-sized pieces. You can use chicken, mutton, or buffalo meat for this dish.",
      "2. Prepare the Marinade:",
      "- In a bowl, combine yogurt, mustard oil, ginger paste, garlic paste, cumin powder, coriander powder, turmeric powder, red chili powder, and salt.",
      "- Mix the marinade ingredients thoroughly until well combined.",
      "3. Marinate the Meat:",
      "- Add the meat pieces to the marinade and coat them evenly with the mixture.",
      "- Cover the bowl with plastic wrap or a lid and refrigerate for at least 2-4 hours. Longer marination time will enhance the flavor.",
      "4. Thread the Skewers:",
      "- If you're using bamboo skewers, make sure to soak them in water for about 30 minutes before using to prevent them from burning during grilling.",
      "- Thread the marinated meat pieces onto the skewers, leaving a little space between each piece.",
      "5. Grill the Sekuwa:",
      "- Preheat a grill or barbecue to medium-high heat.",
      "- Brush the grill grates with a little cooking oil to prevent sticking.",
      "- Place the skewered meat on the grill, leaving some space between each skewer.",
      "- Grill the sekuwa, turning occasionally, until the meat is cooked through and has a nice char on the outside. This usually takes about 15-20 minutes, depending on the meat and grill temperature.",
      "- While grilling, you can brush the sekuwa with a mixture of cooking oil or ghee to keep them moist and add flavor.",
      "6. Serve:",
      "- Once the sekuwa is cooked and has a beautiful color, remove them from the grill.",
      "- Serve the sekuwa hot with naan, roti, rice, or your choice of accompaniments.",
      "- Optionally, garnish with chopped cilantro and squeeze some lemon juice over the sekuwa before serving.",
      "Enjoy your delicious homemade Nepali sekuwa!",
      "Nepali :",
      "सामग्री:",
      "- 500 ग्राम हड्डीविहीन मासु (कुखुरा, मटन, वा भैंसी)",
      "- 2 चम्मच दही",
      "- 1 चम्मच तोरीको तेल",
      "- १ चम्चा अदुवाको पेस्ट",
      "- 1 चम्मच लसुन पेस्ट",
      "- 1 चम्चा जीरा धुलो",
      "- 1 चम्चा धनिया धुलो",
      "- १ चम्चा बेसारको धुलो",
      "- १ चम्चा रातो खुर्सानीको धुलो (स्वाद अनुसार)",
      "- स्वाद अनुसार नुन",
      "ग्रिलिङको लागि:",
      "- स्केवरहरू (धातु वा बाँस, यदि बाँस प्रयोग गर्दै हुनुहुन्छ भने, तिनीहरूलाई लगभग 30 मिनेटको लागि पानीमा भिजाउनुहोस्)",
      "- खाना पकाउने तेल वा घिउ माझ्ने",
      "निर्देशन:",
      "१. मासु तयार गर्नुहोस्:",
      "- हड्डीविहीन मासुलाई काट्ने आकारको टुक्रामा काट्नुहोस्। तपाईले यो परिकारको लागि कुखुरा, मटन वा भैंसीको मासु प्रयोग गर्न सक्नुहुन्छ।",
      "2. marinade तयार गर्नुहोस्:",
      "- एउटा कचौरामा दही, तोरीको तेल, अदुवाको पेस्ट, लसुनको पेस्ट, जीराको धुलो, धनियाको धुलो, बेसारको धुलो, रातो खुर्सानीको धुलो र नुन मिसाउनुहोस्।",
      "- मैरिनेड सामग्रीहरू राम्ररी मिलाएर राम्रोसँग मिलाउनुहोस्।",
      "३. मासु मैरिनेट गर्नुहोस्:",
      "- मासुका टुक्राहरूलाई म्यारिनेडमा थप्नुहोस् र मिश्रणसँग समान रूपमा कोट गर्नुहोस्।",
      "- कचौरालाई प्लास्टिकको र्‍याप वा ढक्कनले छोप्नुहोस् र कम्तिमा २-४ घण्टाको लागि फ्रिजमा राख्नुहोस्। लामो समयसम्म म्यारिनेसनले स्वाद बढाउनेछ।",
      "4. स्केवरहरू थ्रेड गर्नुहोस्:",
      "- यदि तपाइँ बाँसको स्किवरहरू प्रयोग गर्दै हुनुहुन्छ भने, तिनीहरूलाई ग्रिलिङको समयमा जल्नबाट रोक्न प्रयोग गर्नु अघि लगभग 30 मिनेटको लागि पानीमा भिजाउनुहोस्।",
      "- प्रत्येक टुक्राको बिचमा अलिकति खाली ठाउँ छोडेर, मरिनेट गरिएको मासुका टुक्राहरूलाई स्किभरहरूमा थ्रेड गर्नुहोस्।",
      "५. सेकुवा ग्रिल:",
      "- मध्यम-उच्च तातोमा ग्रिल वा बारबेक्यूलाई पहिले नै तताउनुहोस्।",
      "- टाँस्नबाट बच्न अलिकति खाना पकाउने तेलले ग्रिल ग्रेट्स ब्रश गर्नुहोस्।",
      "- प्रत्येक स्किभरको बीचमा केही खाली ठाउँ छोडेर, ग्रिलमा स्केवर गरिएको मासु राख्नुहोस्।",
      "- सेकुवालाई ग्रिल गर्नुहोस्, कहिले काँही घुमाउँदै, मासु पकाएर बाहिर राम्रो चार नहोउन्जेल। यसले मासु र ग्रिलको तापक्रममा निर्भर गर्दछ, सामान्यतया 15-20 मिनेट लाग्छ।",
      "- ग्रिल गर्दा, तपाईंले सेकुवालाई खाना पकाउने तेल वा घ्यूको मिश्रणले ओसिलो राख्न र स्वाद थप्न ब्रस गर्न सक्नुहुन्छ।",
      "6. सेवा गर्नुहोस्:",
      "- सेकुवा पाकिसकेपछि र सुन्दर रङ भएपछि, तिनीहरूलाई ग्रिलबाट हटाउनुहोस्।",
      "- सेकुवालाई तातो नान, रोटी, भात, वा तपाइँको मनपर्ने संगत संग सेवा गर्नुहोस्।",
      "- ऐच्छिक रूपमा, काटेको सिलिन्ट्रोले गार्निस गर्नुहोस् र सेवा गर्नु अघि सेकुवामा केही कागतीको रस निचोड्नुहोस्।",
      "आफ्नो स्वादिष्ट घरेलु नेपाली सेकुवाको मजा लिनुहोस्!"
    ]
  },
  {
    "title": "Kwati ",
    "image": "images/kwati.png",
    "description": "Mixed bean soup with meat",
    "steps": [
      "Ingredients:",
      "- 1 cup mixed sprouted beans and lentils (Kwati daal) - includes black chickpeas (kalo chana), green mung beans (hariyo mung), black-eyed peas (bodi), kidney beans (raajma), soybeans (bhatmas), and other lentils you prefer",
      "- 2 tablespoons mustard oil",
      "- 1 teaspoon fenugreek seeds (methi)",
      "- 1 teaspoon cumin seeds (jeera)",
      "- 1 teaspoon turmeric powder (haldi)",
      "- 1 tablespoon minced garlic (lahsun)",
      "- 1 tablespoon minced ginger (adrak)",
      "- 1 medium-sized onion, finely chopped",
      "- 1 medium-sized tomato, chopped",
      "- 1 teaspoon red chili powder (adjust to taste)",
      "- Salt to taste",
      "- Water",

      "For Garnish:",
      "- Chopped cilantro (coriander leaves)",
      "- Sliced green onions",
      "- Freshly squeezed lemon juice",

      "Instructions:",
      "1. Prepare the Mixed Lentils:",
      "- Wash and soak the mixed lentils and beans overnight or for at least 6-8 hours. Drain the water.",
      "2. Sprout the Lentils:",
      "- Wrap the soaked lentils in a damp cloth and place them in a warm spot. Let them sprout for about 1-2 days until you see small sprouts emerging.",
      "3. Cook the Sprouted Lentils:",
      "- In a pressure cooker or a pot, add the sprouted lentils and enough water to cover them. Add turmeric powder and salt.",
      "- Cook until the lentils are soft and tender. You can use a pressure cooker for faster cooking, usually 2-3 whistles.",
      "4. Prepare the Spice Mix:",
      "- In a separate pan, heat mustard oil until it starts to smoke. Then, reduce the heat to medium and add fenugreek seeds and cumin seeds.",
      "- Add minced garlic and ginger and sauté until they turn golden and aromatic.",
      "5. Add Onions and Tomatoes:",
      "- Add finely chopped onions and cook until they turn translucent.",
      "- Add chopped tomatoes and cook until they soften and blend with the mixture.",
      "6. Combine the Cooked Lentils and Spices:",
      "- Add the cooked sprouted lentils to the pan with the onion and tomato mixture. Mix well.",
      "7. Seasoning and Cooking:",
      "- Add red chili powder and more salt if needed. Stir to combine.",
      "- Add enough water to achieve the desired consistency. Kwati should be thick and soupy, so adjust the water accordingly.",
      "8. Simmer and Serve:",
      "- Let the Kwati simmer on low heat for about 15-20 minutes, allowing the flavors to meld together.",
      "- Once the Kwati is cooked, adjust the seasoning if needed.",
      "9. Garnish and Serve:",
      "- Garnish Kwati with chopped cilantro and sliced green onions.",
      "- Squeeze fresh lemon juice over each serving before eating.",
      "Enjoy your nutritious and flavorful Nepali Kwati!",

      "Nepali :",

      "सामग्री:",

      "- १ कप मिश्रित अंकुरित सिमी र दाल (क्वाटी दाल) - यसमा कालो चना (कालो चना), हरियो मुङ (हरियो मुङ), कालो आँखाको मटर (बोडी), किडनी बीन्स (राजमा), भटमास (भटमास), र समावेश छ। तपाईलाई मन पर्ने अन्य दाल",
      "- 2 चम्मच तोरीको तेल",
      "- 1 चम्चा मेथी दाना (मेथी)",
      "- 1 चम्चा जीरा (जिरा)",
      "- 1 चम्चा बेसार पाउडर (हल्दी)",
      "- 1 चम्चा केमा गरेको लसुन (लाहसुन)",
      "- 1 चम्मच अदुवा (Adrak)",
      "- १ मध्यम आकारको प्याज, बारीक काटिएको",
      "- १ मध्यम आकारको टमाटर, काटेको",
      "- १ चम्चा रातो खुर्सानीको धुलो (स्वाद अनुसार)",
      "- स्वाद अनुसार नुन",
      "-पानी",

      "गार्निशको लागि:",
      "- काटेको कोलिंट्रो (धनिया पात)",
      "- काटिएको हरियो प्याज",
      "- ताजा निचोरिएको कागतीको रस",

      "निर्देशन:",
      "1. मिश्रित दाल तयार गर्नुहोस्:",
      "मिश्रित दाल र सिमीलाई रातभर वा कम्तीमा ६-८ घण्टा भिजाएर पानी निकाल्नुहोस्।",
      "2. दाल अंकुर्नुहोस्:",
      "- भिजेको दाललाई ओसिलो कपडामा बेर्नुहोस् र न्यानो ठाउँमा राख्नुहोस्। तिनीहरूलाई 1-2 दिनसम्म अंकुराउन दिनुहोस् जबसम्म तपाईंले सानो अंकुरहरू देखा परेको देख्नुहुन्छ।",
      "३. अंकुरेको दाल पकाउनुहोस्:",
      "- प्रेसर कुकर वा भाँडोमा अंकुरेको दाल र त्यसलाई छोप्न पर्याप्त पानी हाल्नुहोस्। बेसारको धुलो र नुन हाल्नुहोस्।",
      "- दाल नरम र कोमल नभएसम्म पकाउनुहोस्। छिटो पकाउनको लागि तपाइँ प्रेसर कुकर प्रयोग गर्न सक्नुहुन्छ, सामान्यतया 2-3 सिट्टी।",
      "4. मसला मिक्स तयार गर्नुहोस्:",
      "- छुट्टै प्यानमा, तोरीको तेललाई धुवाँ नआएसम्म तताउनुहोस्। त्यसपछि, तातो मध्यममा घटाउनुहोस् र मेथी र जीरा थप्नुहोस्।",
      "- केमा पारेको लसुन र अदुवा थप्नुहोस् र सुनौलो र सुगन्धित नभएसम्म पकाउनुहोस्।",
      "५. प्याज र टमाटर थप्नुहोस्:",
      "- मसिनो काटेको प्याज थप्नुहोस् र पारदर्शी नभएसम्म पकाउनुहोस्।",
      "- काटेको टमाटरहरू थप्नुहोस् र तिनीहरू नरम नभएसम्म पकाउनुहोस् र मिश्रणसँग मिसाउनुहोस्।",
      "6. पकाएको दाल र मसला मिलाउनुहोस्:",
      "- प्याज र टमाटरको मिश्रणको साथ प्यानमा पकाएको अंकुरित दाल थप्नुहोस्। राम्रोसँग मिलाउनुहोस्।",
      "७. सिजनिङ र पकाउने:",
      "- रातो खुर्सानीको धुलो र आवश्यक भएमा थप नुन थप्नुहोस्। मिलाउन मिलाउनुहोस्।",
      "- वांछित स्थिरता प्राप्त गर्न पर्याप्त पानी थप्नुहोस्। क्वाती बाक्लो र सूपी हुनुपर्छ, त्यसैले तदनुसार पानी समायोजन गर्नुहोस्।",
      "8. उमालेर सेवा गर्नुहोस्:",
      "- Kwati लाई लगभग 15-20 मिनेटको लागि कम तातोमा उबाउन दिनुहोस्, स्वादहरू सँगै मिलाउन अनुमति दिनुहोस्।",
      "- क्वाती पकाएर, आवश्यक भएमा मसला मिलाउनुहोस्।",

      "9. गार्निस र सर्भ:",
      "- क्वातीलाई काटेको सिलिन्ट्रो र काटेको हरियो प्याजले गार्निस गर्नुहोस्।",
      "- खानु अघि प्रत्येक सेवामा ताजा कागतीको रस निचोड्नुहोस्।",
      "आफ्नो पौष्टिक र स्वादिलो नेपाली क्वातीको मजा लिनुहोस्!"
    ]
  },
  {
    "title": "Buff Ko Masu ",
    "image": "images/buffmasu.png",
    "description": "Buffalo meat curry",
    "steps": [
      "Ingredients:",
      "- 500 grams buffalo meat, cut into bite-sized pieces",
      "- 2 medium onions, finely chopped",
      "- 2 medium tomatoes, chopped",
      "- 3 tablespoons cooking oil",
      "- 1 teaspoon cumin seeds (jeera)",
      "- 2-3 bay leaves (tej patta)",
      "- 2-3 cloves (laung)",
      "- 2-3 green cardamom pods (elaichi)",
      "- 1 cinnamon stick (dalchini)",
      "- 1 tablespoon ginger-garlic paste",
      "- 1 tablespoon cumin powder",
      "- 1 tablespoon coriander powder",
      "- 1/2 tablespoon turmeric powder",
      "- 1/2 tablespoon red chili powder (adjust to taste)",
      "- Salt to taste",
      "- Chopped cilantro (coriander leaves) for garnish",

      "Instructions:",
      "1. Heat Oil and Add Whole Spices:",
      "- In a large pot or pressure cooker, heat the cooking oil over medium heat.",
      "- Add cumin seeds, bay leaves, cloves, green cardamom pods, and cinnamon stick. Sauté until fragrant.",

      "2. Add Onions and Sauté:",
      "- Add the finely chopped onions and cook until they turn golden brown.",

      "3. Add Ginger-Garlic Paste:",
      "- Add the ginger-garlic paste and sauté until the raw smell disappears.",

      "4. Add Tomatoes and Spices:",
      "- Add the chopped tomatoes and cook until they soften and the oil starts to separate from the mixture.",
      "- Add cumin powder, coriander powder, turmeric powder, red chili powder, and salt. Mix well.",

      "5. Add Buffalo Meat:",
      "- Add the buffalo meat pieces to the spice mixture. Coat the meat with the spices and cook for a few minutes until it starts to brown.",

      "6. Pressure Cook the Meat (if using pressure cooker):",
      "- If using a pressure cooker, add enough water to cover the meat and close the lid without the pressure regulator.",
      "- Cook for about 15-20 minutes, or until the meat is tender and fully cooked. Cooking time may vary based on the buffalo meat's tenderness.",

      "7. Simmer (if not using pressure cooker):",
      "- If using a regular pot, add enough water to cover the meat, then cover with a lid and let it simmer. Stir occasionally and add more water if needed. Cook until the meat is tender.",

      "8. Adjust Seasoning and Serve:",
      "- Once the meat is cooked and the curry has reached the desired consistency, adjust the seasoning if necessary.",
      "- Garnish with chopped cilantro (coriander leaves).",

      "9. Serve:",
      "- Serve the delicious buffalo meat curry with steamed rice, roti, or other Nepali breads.",

      "Enjoy your flavorful Nepali buff meat curry!",

      "Nepali :",
      "सामग्री:",
      "- 500 ग्राम भैंसीको मासु, टोकेको आकारको टुक्रामा काटिएको",
      "- २ मध्यम प्याज, बारीक काटिएको",
      "- २ मध्यम टमाटर, काटिएको",
      "- 3 चम्चा खाना पकाउने तेल",
      "- 1 चम्चा जीरा (जिरा)",
      "- 2-3 बे पात (तेज पट्टा)",
      "- 2-3 लौंग (लौंग)",
      "- २-३ हरियो अलैंचीको फली (इलाची)",
      "- 1 दालचीनी स्टिक (दालचीनी)",
      "- 1 चम्मच अदुवा-लसुनको पेस्ट",
      "- 1 चम्मच जीरा पाउडर",
      "- 1 चम्मच धनिया धुलो",
      "- 1/2 चम्मच बेसारको धुलो",
      "- १/२ चम्चा रातो खुर्सानीको धुलो (स्वाद अनुसार)",
      "- स्वाद अनुसार नुन",
      "- गार्निशको लागि काटेको कोलिन्ट्रो (धनिया पात)",

      "निर्देशन:",
      "१. तेल तताउनुहोस् र सम्पूर्ण मसला थप्नुहोस्:",
      "- ठूलो भाँडो वा प्रेसर कुकरमा, खाना पकाउने तेललाई मध्यम तातोमा तताउनुहोस्।",
      "- जीराको दाना, बे पात, लौंग, हरियो अलैंची पोडहरू, र दालचीनी स्टिक थप्नुहोस्। सुगन्धित नभएसम्म पकाउनुहोस्।",

      "२. प्याज थप्नुहोस् र साउट:",
      "- मसिनो काटेको प्याज थप्नुहोस् र सुनौलो खैरो नभएसम्म पकाउनुहोस्।",

      "३. अदुवा-लसुनको पेस्ट थप्नुहोस्:",
      "- अदुवा-लसुनको पेस्ट हाल्नुहोस् र काँचो गन्ध नआएसम्म पकाउनुहोस्।",

      "4. टमाटर र मसला थप्नुहोस्:",
      "- काटेको टमाटरहरू थप्नुहोस् र तिनीहरू नरम नभएसम्म पकाउनुहोस् र तेल मिश्रणबाट अलग हुन थाल्छ।",
      "- जीराको धुलो, धनियाको धुलो, बेसारको धुलो, रातो खुर्सानीको धुलो र नुन हाल्नुहोस्। राम्ररी मिलाउनुहोस्।",

      "५. भैंसीको मासु थप्नुहोस्:",
      "- मसलाको मिश्रणमा भैंसीको मासुका टुक्राहरू थप्नुहोस्। मसलाले मासु कोट गर्नुहोस् र खैरो हुन थालेसम्म केही मिनेट पकाउनुहोस्।",

      "6. मासुलाई प्रेशर कुक गर्नुहोस् (यदि प्रेसर कुकर प्रयोग गर्दै हुनुहुन्छ भने):",
      "- यदि प्रेसर कुकर प्रयोग गर्नुहुन्छ भने, मासु छोप्न पर्याप्त पानी हाल्नुहोस् र प्रेसर रेगुलेटर बिना ढक्कन बन्द गर्नुहोस्।",
      "- लगभग 15-20 मिनेटको लागि, वा मासु कोमल र पूर्ण रूपमा पकाउँदा सम्म पकाउनुहोस्। पकाउने समय भैंसीको मासुको कोमलताको आधारमा फरक हुन सक्छ।",

      "7. उमालेर (यदि प्रेसर कुकर प्रयोग नगरेको भए):",
      "- यदि नियमित भाँडो प्रयोग गर्दै हुनुहुन्छ भने, मासु छोप्न पर्याप्त पानी थप्नुहोस्, त्यसपछि ढक्कनले छोप्नुहोस् र यसलाई उमाल्न दिनुहोस्। कहिले काँही हलचल गर्नुहोस् र आवश्यक भएमा थप पानी थप्नुहोस्। मासु कोमल नभएसम्म पकाउनुहोस्।",

      "8. मसला समायोजन गर्नुहोस् र सेवा गर्नुहोस्:",
      "- मासु पकाएपछि र करी इच्छित स्थिरतामा पुगेपछि, आवश्यक भएमा मसला समायोजन गर्नुहोस्।",
      "- काटेको सिलिन्ट्रो (धनिया पात) संग गार्निश।",

      "9. सेवा गर्नुहोस्:",
      "- भात, रोटी, वा अन्य नेपाली रोटीहरूसँग स्वादिष्ट भैंसको मासु करी सेवा गर्नुहोस्।",

      "आफ्नो स्वादिलो नेपाली बफ मासु करीको मजा लिनुहोस्!"
    ]
  },
  {
    "title": "Khasi Ko Masu ",
    "image": "images/khasikomasu.png",
    "description": "Goat meat curry",
    "steps": [
      "Ingredients:",
      "- 500 grams mutton, cut into bite-sized pieces",
      "- 2 medium onions, finely chopped",
      "- 2 medium tomatoes, chopped",
      "- 3 tablespoons cooking oil or ghee",
      "- 1 teaspoon cumin seeds (jeera)",
      "- 2-3 bay leaves (tej patta)",
      "- 2-3 cloves (laung)",
      "- 2-3 green cardamom pods (elaichi)",
      "- 1 cinnamon stick (dalchini)",
      "- 1 tablespoon ginger-garlic paste",
      "- 1 tablespoon cumin powder",
      "- 1 tablespoon coriander powder",
      "- 1/2 tablespoon turmeric powder",
      "- 1/2 tablespoon red chili powder (adjust to taste)",
      "- Salt to taste",
      "- Chopped cilantro (coriander leaves) for garnish",

      "Instructions:",
      "1. Heat Oil or Ghee and Add Whole Spices:",
      "- In a large pot or pressure cooker, heat the cooking oil or ghee over medium heat.",
      "- Add cumin seeds, bay leaves, cloves, green cardamom pods, and cinnamon stick. Sauté until fragrant.",

      "2. Add Onions and Sauté:",
      "- Add the finely chopped onions and cook until they turn golden brown.",

      "3. Add Ginger-Garlic Paste:",
      "- Add the ginger-garlic paste and sauté until the raw smell disappears.",

      "4. Add Tomatoes and Spices:",
      "- Add the chopped tomatoes and cook until they soften and the oil starts to separate from the mixture.",
      "- Add cumin powder, coriander powder, turmeric powder, red chili powder, and salt. Mix well.",

      "5. Add Mutton:",
      "- Add the mutton pieces to the spice mixture. Coat the meat with the spices and cook for a few minutes until it starts to brown.",

      "6. Pressure Cook the Mutton (if using pressure cooker):",
      "- If using a pressure cooker, add enough water to cover the mutton and close the lid without the pressure regulator.",
      "- Cook for about 20-25 minutes, or until the mutton is tender and fully cooked. Cooking time may vary based on the mutton's tenderness.",

      "7. Simmer (if not using pressure cooker):",
      "- If using a regular pot, add enough water to cover the mutton, then cover with a lid and let it simmer. Stir occasionally and add more water if needed. Cook until the mutton is tender.",

      "8. Adjust Seasoning and Serve:",
      "- Once the mutton is cooked and the curry has reached the desired consistency, adjust the seasoning if necessary.",
      "- Garnish with chopped cilantro (coriander leaves).",

      "9. Serve:",
      "- Serve the flavorful mutton meat curry with steamed rice, naan, or other breads.",

      "Enjoy your delicious mutton meat curry!",
      "Nepali :",
      "सामग्री:",
      "- 500 ग्राम मटन, काटेको आकारको टुक्रामा काटिएको",
      "- २ मध्यम प्याज, बारीक काटिएको",
      "- २ मध्यम टमाटर, काटिएको",
      "- 3 चम्चा खाना पकाउने तेल वा घ्यू",
      "- 1 चम्चा जीरा (जिरा)",
      "- 2-3 बे पात (तेज पट्टा)",
      "- 2-3 लौंग (लौंग)",
      "- २-३ हरियो अलैंचीको फली (इलाची)",
      "- 1 दालचीनी स्टिक (दालचीनी)",
      "- 1 चम्मच अदुवा-लसुनको पेस्ट",
      "- 1 चम्मच जीरा पाउडर",
      "- 1 चम्मच धनिया धुलो",
      "- 1/2 चम्मच बेसारको धुलो",
      "- १/२ चम्चा रातो खुर्सानीको धुलो (स्वाद अनुसार)",
      "- स्वाद अनुसार नुन",
      "- गार्निशको लागि काटेको कोलिन्ट्रो (धनिया पात)",

      "निर्देशन:",
      "१. तेल वा घिउ तताएर पूरै मसला हाल्नुहोस्:",
      "- ठूलो भाँडो वा प्रेसर कुकरमा, खाना पकाउने तेल वा घिउलाई मध्यम तातोमा तताउनुहोस्।",
      "- जीराको दाना, बे पात, लौंग, हरियो अलैंची पोडहरू, र दालचीनी स्टिक थप्नुहोस्। सुगन्धित नभएसम्म पकाउनुहोस्।",

      "२. प्याज थप्नुहोस् र साउट:",
      "- मसिनो काटेको प्याज थप्नुहोस् र सुनौलो खैरो नभएसम्म पकाउनुहोस्।",

      "३. अदुवा-लसुनको पेस्ट थप्नुहोस्:",
      "- अदुवा-लसुनको पेस्ट हाल्नुहोस् र काँचो गन्ध नआएसम्म पकाउनुहोस्।",

      "4. टमाटर र मसला थप्नुहोस्:",
      "- काटेको टमाटरहरू थप्नुहोस् र तिनीहरू नरम नभएसम्म पकाउनुहोस् र तेल मिश्रणबाट अलग हुन थाल्छ।",
      "- जीराको धुलो, धनियाको धुलो, बेसारको धुलो, रातो खुर्सानीको धुलो र नुन हाल्नुहोस्। राम्ररी मिलाउनुहोस्।",

      "५. मटन थप्नुहोस्:",
      "- मसलाको मिश्रणमा मटनका टुक्राहरू थप्नुहोस्। मासुलाई मसलाले कोट गर्नुहोस् र खैरो नहोउन्जेल केही मिनेट पकाउनुहोस्।",

      "६. प्रेशर कुक द माटन (यदि प्रेसर कुकर प्रयोग गर्दै हुनुहुन्छ भने):",
      "- यदि प्रेसर कुकर प्रयोग गर्नुहुन्छ भने, मटन छोप्न पर्याप्त पानी हाल्नुहोस् र प्रेसर रेगुलेटर बिना ढक्कन बन्द गर्नुहोस्।",
      "- लगभग 20-25 मिनेटको लागि, वा माटन कोमल र पूर्ण रूपमा पकाएको बेलासम्म पकाउनुहोस्। पकाउने समय माटनको कोमलताको आधारमा फरक हुन सक्छ।",

      "7. उमालेर (यदि प्रेसर कुकर प्रयोग नगरेको भए):",
      "- यदि नियमित भाँडो प्रयोग गर्दै हुनुहुन्छ भने, मटनलाई छोप्नको लागि पर्याप्त पानी थप्नुहोस्, त्यसपछि ढक्कनले छोप्नुहोस् र यसलाई उमाल्न दिनुहोस्। कहिलेकाहीं हलचल गर्नुहोस् र आवश्यक भएमा थप पानी थप्नुहोस्। मटन कोमल नभएसम्म पकाउनुहोस्।",

      "8. मसला समायोजन गर्नुहोस् र सेवा गर्नुहोस्:",
      "- एक पटक मटन पकाएर र करी इच्छित स्थिरतामा पुगेपछि, आवश्यक भएमा मसला समायोजन गर्नुहोस्।",
      "- काटेको सिलिन्ट्रो (धनिया पात) संग गार्निश।",

      "9. सेवा गर्नुहोस्:",
      "- स्वादिलो मटन मासुको करीलाई उफाएको भात, नान वा अन्य रोटीसँग सेवा गर्नुहोस्।",

      "तपाईंको स्वादिष्ट मटन मासु करीको मजा लिनुहोस्!"
    ]
  },
  {
    "title": " Sandheko Masu ",
    "image": "images/chickensalad.png",
    "description": "Marinated and spiced meat (Non-Veg Salad)",
    "steps": [
      "Ingredients:",
      "- 250 grams boneless chicken, boiled and shredded",
      "- 1 medium red onion, finely chopped",
      "- 1 medium tomato, finely chopped",
      "- 2-3 green chilies, finely chopped",
      "- 2 tablespoons fresh lemon juice",
      "- 2 tablespoons mustard oil",
      "- 1 teaspoon cumin powder",
      "- 1 teaspoon coriander powder",
      "- 1/2 teaspoon turmeric powder",
      "- 1/2 teaspoon red chili powder (adjust to taste)",
      "- Salt to taste",
      "- Chopped cilantro (coriander leaves) for garnish",
      "- Chopped green onions for garnish",

      "Instructions:",
      "1. Prepare the Boiled Chicken:",
      "- Boil the boneless chicken until fully cooked. Let it cool, then shred it into bite-sized pieces using your hands or a fork.",

      "2. Mix the Spices and Lemon Juice:",
      "- In a large mixing bowl, combine the shredded chicken with cumin powder, coriander powder, turmeric powder, red chili powder, and salt.",
      "- Add freshly squeezed lemon juice and mix well. Let the chicken marinate for about 10-15 minutes.",

      "3. Add Chopped Vegetables and Mustard Oil:",
      "- Add the finely chopped red onion, chopped tomato, and finely chopped green chilies to the marinated chicken.",
      "- Drizzle mustard oil over the mixture. Mustard oil adds a distinct Nepali flavor, but you can use any cooking oil if preferred.",

      "4. Toss and Garnish:",
      "- Gently toss all the ingredients together until well combined and the spices are evenly distributed.",
      "- Garnish the chicken salad with chopped cilantro (coriander leaves) and chopped green onions.",

      "5. Adjust Seasoning and Serve:",
      "- Taste the chicken salad and adjust the seasoning by adding more salt, lemon juice, or spices as desired.",
      "- Serve the Sadeko Masu (Chicken Salad) as a flavorful appetizer or side dish. It's often enjoyed with beaten rice (chiura) or as a snack with drinks.",

      "Enjoy your Nepali-style Sadeko Masu!",
      "Nepali :",
      "सामग्री:",
      "- २५० ग्राम हड्डीविहीन कुखुरा, उमालेको र टुक्रा पारेको",
      "- १ मध्यम रातो प्याज, बारीक काटिएको",
      "- १ मध्यम टमाटर, बारीक काटिएको",
      "- 2-3 हरियो खुर्सानी, बारीक काटिएको",
      "- २ चम्चा ताजा कागतीको रस",
      "- 2 चम्मच तोरीको तेल",
      "- 1 चम्चा जीरा धुलो",
      "- 1 चम्चा धनिया धुलो",
      "- १/२ चम्चा बेसारको धुलो",
      "- १/२ चम्चा रातो खुर्सानीको धुलो (स्वाद अनुसार)",
      "- स्वाद अनुसार नुन",
      "- गार्निशको लागि काटेको कोलिन्ट्रो (धनिया पात)",
      "गार्निशको लागि हरियो प्याज काटिएको",

      "निर्देशन:",
      "1. उमालेको चिकन तयार गर्नुहोस्:",
      "- हड्डीविहीन कुखुरालाई पूर्णतया पकाएर उमालेर राख्नुहोस्। यसलाई चिसो हुन दिनुहोस्, त्यसपछि हात वा काँटाको प्रयोग गरेर यसलाई काट्ने आकारको टुक्रामा काट्नुहोस्।",

      "2. मसला र कागतीको रस मिलाउनुहोस्:",
      "- एउटा ठूलो मिक्सिङ कचौरा मा, जीरा पाउडर, धनिया पाउडर, बेसार धुलो, रातो खुर्सानी पाउडर, र नुन संग टुक्रा कुखुरा मिलाउनुहोस्।",
      "- ताजा निचोरेको कागतीको रस हाल्नुहोस् र राम्ररी मिलाउनुहोस्। कुखुरालाई 10-15 मिनेटको लागि म्यारिनेट गर्न दिनुहोस्।",

      "३. काटेको तरकारी र तोरीको तेल जोड्नुहोस्:",
      "- म्यारिनेट गरिएको कुखुरामा मसिनो काटेको रातो प्याज, कटा टमाटर र मसिनो काटेको हरियो खुर्सानी थप्नुहोस्।",
      "- मिक्सरमा तोरीको तेल छोप्नुहोस्। तोरीको तेलले फरक नेपाली स्वाद थप्छ, तर तपाईले चाहेमा कुनै पनि पकाउने तेल प्रयोग गर्न सक्नुहुन्छ।",

      "4. टस र गार्निस:",
      "- राम्ररी नमिल्दासम्म र मसलाहरू समान रूपमा वितरण नभएसम्म सबै सामग्रीहरू बिस्तारै एकसाथ टास्नुहोस्।",
      "- कुखुराको सलादलाई काटेको सिलिन्ट्रो (धनिया पात) र हरियो प्याजले गार्निस गर्नुहोस्।",

      "5. मसला समायोजन गर्नुहोस् र सेवा गर्नुहोस्:",
      "- कुखुराको सलादको स्वाद लिनुहोस् र थप नुन, कागतीको रस, वा मनपर्ने मसला थपेर मसला मिलाउनुहोस्।",
      "- सादेको मासु (चिकन सलाद) लाई स्वादयुक्त एपेटाइजर वा साइड डिशको रूपमा सेवा गर्नुहोस्। यो प्रायः पिटेन राइस (चिउरा) वा पेयसँग खाजाको रूपमा लिइन्छ।",

      "आफ्नो नेपाली शैली सादेको मासुको मजा लिनुहोस्!"
    ]
  },
  {
    "title": "Macha",
    "image": "images/machha.png",
    "description": " Fish curry",
    "steps": [
      "Ingredients:",
      "- 500 grams fish fillets (any firm-fleshed fish), cut into pieces",
      "- 1 medium onion, finely chopped",
      "- 2 medium tomatoes, chopped",
      "- 3 tablespoons cooking oil",
      "- 1 teaspoon cumin seeds (jeera)",
      "- 2-3 bay leaves (tej patta)",
      "- 2-3 cloves (laung)",
      "- 2-3 green cardamom pods (elaichi)",
      "- 1 cinnamon stick (dalchini)",
      "- 1 tablespoon ginger-garlic paste",
      "- 1 tablespoon cumin powder",
      "- 1 tablespoon coriander powder",
      "- 1/2 tablespoon turmeric powder",
      "- 1/2 tablespoon red chili powder (adjust to taste)",
      "- Salt to taste",
      "- Chopped cilantro (coriander leaves) for garnish",

      "Instructions:",
      "1. Heat Oil and Add Whole Spices:",
      "- In a large pot or pan, heat the cooking oil over medium heat.",
      "- Add cumin seeds, bay leaves, cloves, green cardamom pods, and cinnamon stick. Sauté until fragrant.",

      "2. Add Onions and Sauté:",
      "- Add the finely chopped onion and cook until it turns golden brown.",

      "3. Add Ginger-Garlic Paste:",
      "- Add the ginger-garlic paste and sauté until the raw smell disappears.",

      "4. Add Tomatoes and Spices:",
      "- Add the chopped tomatoes and cook until they soften and the oil starts to separate from the mixture.",
      "- Add cumin powder, coriander powder, turmeric powder, red chili powder, and salt. Mix well.",

      "5. Add Fish:",
      "- Gently add the fish pieces to the spice mixture. Coat the fish with the spices and let it cook for a few minutes until the fish starts to firm up.",

      "6. Simmer the Fish Curry:",
      "- Add enough water to achieve the desired curry consistency. Cover the pot and let the fish curry simmer over low heat until the fish is fully cooked and tender. Be careful not to overcook the fish.",

      "7. Adjust Seasoning and Serve:",
      "- Taste the fish curry and adjust the seasoning if necessary.",
      "- Garnish with chopped cilantro (coriander leaves).",

      "8. Serve:",
      "- Serve the delicious Nepali fish curry with steamed rice, roti, or other breads.",

      "Enjoy your flavorful Nepali-style fish curry!",

      "Nepali :",
      "सामग्री:",
      "- 500 ग्राम माछा फिलेट (कुनै पनि फर्म-मासुको माछा), टुक्राहरूमा काटिएको",
      "- १ मध्यम प्याज, बारीक काटिएको",
      "- २ मध्यम टमाटर, काटिएको",
      "- 3 चम्चा खाना पकाउने तेल",
      "- 1 चम्चा जीरा (जिरा)",
      "- 2-3 बे पात (तेज पट्टा)",
      "- 2-3 लौंग (लौंग)",
      "- २-३ हरियो अलैंचीको फली (इलाची)",
      "- 1 दालचीनी स्टिक (दालचीनी)",
      "- 1 चम्मच अदुवा-लसुनको पेस्ट",
      "- 1 चम्मच जीरा पाउडर",
      "- 1 चम्मच धनिया धुलो",
      "- 1/2 चम्मच बेसारको धुलो",
      "- १/२ चम्चा रातो खुर्सानीको धुलो (स्वाद अनुसार)",
      "- स्वाद अनुसार नुन",
      "- गार्निशको लागि काटेको कोलिन्ट्रो (धनिया पात)",

      "निर्देशन:",
      "१. तेल तताउनुहोस् र सम्पूर्ण मसला थप्नुहोस्:",
      "- ठूलो भाँडो वा प्यानमा, खाना पकाउने तेललाई मध्यम तातोमा तताउनुहोस्।",
      "- जीराको दाना, बे पात, लौंग, हरियो अलैंची पोडहरू, र दालचीनी स्टिक थप्नुहोस्। सुगन्धित नभएसम्म पकाउनुहोस्।",

      "२. प्याज थप्नुहोस् र साउट:",
      "- मसिनो काटेको प्याज थप्नुहोस् र सुनौलो खैरो नभएसम्म पकाउनुहोस्।",

      "३. अदुवा-लसुनको पेस्ट थप्नुहोस्:",
      "- अदुवा-लसुनको पेस्ट हाल्नुहोस् र काँचो गन्ध नआएसम्म पकाउनुहोस्।",

      "4. टमाटर र मसला थप्नुहोस्:",
      "- काटेको टमाटरहरू थप्नुहोस् र तिनीहरू नरम नभएसम्म पकाउनुहोस् र तेल मिश्रणबाट अलग हुन थाल्छ।",
      "- जीराको धुलो, धनियाको धुलो, बेसारको धुलो, रातो खुर्सानीको धुलो र नुन हाल्नुहोस्। राम्ररी मिलाउनुहोस्।",

      "5. माछा थप्नुहोस्:",
      "- मसलाको मिश्रणमा बिस्तारै माछाका टुक्राहरू थप्नुहोस्। माछालाई मसलाले कोट गर्नुहोस् र माछा बलियो हुन नसकेसम्म केही मिनेट पकाउन दिनुहोस्।",

      "६. माछाको करीलाई सिम गर्नुहोस्:",
      "- इच्छित करी स्थिरता प्राप्त गर्न पर्याप्त पानी थप्नुहोस्। भाँडो छोप्नुहोस् र माछा पूर्ण रूपमा पकाउन र कोमल नहोउन्जेल माछाको करीलाई कम तातोमा उमाल्न दिनुहोस्। माछालाई धेरै पकाउन नदिनुहोस्।",

      "7. मसला समायोजन गर्नुहोस् र सेवा गर्नुहोस्:",
      "- माछा करी स्वाद गर्नुहोस् र आवश्यक भएमा मसला समायोजन गर्नुहोस्।",
      "- काटेको सिलिन्ट्रो (धनिया पात) संग गार्निश।",

      "8. सेवा गर्नुहोस्:",
      "- भात, रोटी वा अन्य रोटी संग स्वादिष्ट नेपाली माछा करी सेवा गर्नुहोस्।",

      "आफ्नो स्वादिलो नेपाली शैलीको माछा करीको मजा लिनुहोस्!"
    ]
  },
  {
    "title": "Bhuttan ",
    "image": "images/bhutan.png",
    "description": "Fried intestine of Goat",
    "steps": [
      "Ingredients:",
      "- 500 grams cleaned and washed goat intestine (bhutan), cut into bite-sized pieces",
      "- 1 medium onion, finely chopped",
      "- 2 medium tomatoes, chopped",
      "- 3 tablespoons cooking oil",
      "- 1 teaspoon cumin seeds (jeera)",
      "- 2-3 bay leaves (tej patta)",
      "- 2-3 cloves (laung)",
      "- 2-3 green cardamom pods (elaichi)",
      "- 1 cinnamon stick (dalchini)",
      "- 1 tablespoon ginger-garlic paste",
      "- 1 tablespoon cumin powder",
      "- 1 tablespoon coriander powder",
      "- 1/2 tablespoon turmeric powder",
      "- 1/2 tablespoon red chili powder (adjust to taste)",
      "- Salt to taste",
      "- Chopped cilantro (coriander leaves) for garnish",

      "Instructions:",
      "1. Prepare the Goat Intestine:",
      "- Thoroughly clean and wash the goat intestine under running water. Remove any excess fat or debris.",
      "- Cut the cleaned intestine into bite-sized pieces.",

      "2. Heat Oil and Add Whole Spices:",
      "- In a large pot or pan, heat the cooking oil over medium heat.",
      "- Add cumin seeds, bay leaves, cloves, green cardamom pods, and cinnamon stick. Sauté until fragrant.",

      "3. Add Onions and Sauté:",
      "- Add the finely chopped onion and cook until it turns golden brown.",

      "4. Add Ginger-Garlic Paste:",
      "- Add the ginger-garlic paste and sauté until the raw smell disappears.",

      "5. Add Tomatoes and Spices:",
      "- Add the chopped tomatoes and cook until they soften and the oil starts to separate from the mixture.",
      "- Add cumin powder, coriander powder, turmeric powder, red chili powder, and salt. Mix well.",

      "6. Add Goat Intestine (Bhutan):",
      "- Add the cleaned and washed goat intestine pieces to the spice mixture. Coat the pieces with the spices and cook for a few minutes.",

      "7. Simmer the Bhutan Dish:",
      "- Add enough water to achieve the desired curry consistency. Cover the pot and let the dish simmer over low heat until the goat intestine is fully cooked and tender.",

      "8. Adjust Seasoning and Serve:",
      "- Taste the Bhutan dish and adjust the seasoning if necessary.",
      "- Garnish with chopped cilantro (coriander leaves).",

      "9. Serve:",
      "- Serve the flavorful Bhutan dish with steamed rice, roti, or other breads.",

      "Enjoy your authentic Nepali Bhutan (Goat Intestine) dish!",

      "Nepali :",
      "सामग्री:",
      "- 500 ग्राम सफा र धोएको बाख्राको आन्द्रा (भुटान), टोकेको आकारको टुक्रामा काटिएको",
      "- १ मध्यम प्याज, बारीक काटिएको",
      "- २ मध्यम टमाटर, काटिएको",
      "- 3 चम्चा खाना पकाउने तेल",
      "- 1 चम्चा जीरा (जिरा)",
      "- 2-3 बे पात (तेज पट्टा)",
      "- 2-3 लौंग (लौंग)",
      "- २-३ हरियो अलैंचीको फली (इलाची)",
      "- 1 दालचीनी स्टिक (दालचीनी)",
      "- 1 चम्मच अदुवा-लसुनको पेस्ट",
      "- 1 चम्मच जीरा पाउडर",
      "- 1 चम्मच धनिया धुलो",
      "- 1/2 चम्मच बेसारको धुलो",
      "- १/२ चम्चा रातो खुर्सानीको धुलो (स्वाद अनुसार)",
      "- स्वाद अनुसार नुन",
      "- गार्निशको लागि काटेको कोलिन्ट्रो (धनिया पात)",

      "निर्देशन:",
      "१. बाख्राको आन्द्रा तयार गर्नुहोस्:",
      "- बाख्राको आन्द्रालाई बगिरहेको पानीमुनि राम्ररी सफा गर्नुहोस् र धुनुहोस्। कुनै पनि अतिरिक्त बोसो वा फोहोर हटाउनुहोस्।",
      "- सफा गरिएको आन्द्रालाई काट्ने आकारको टुक्रामा काट्नुहोस्।",

      "2. तेल तताउनुहोस् र सम्पूर्ण मसला थप्नुहोस्:",
      "- ठूलो भाँडो वा प्यानमा, खाना पकाउने तेललाई मध्यम तातोमा तताउनुहोस्।",
      "- जीराको दाना, बे पात, लौंग, हरियो अलैंची पोडहरू, र दालचीनी स्टिक थप्नुहोस्। सुगन्धित नभएसम्म पकाउनुहोस्।",

      "३. प्याज थप्नुहोस् र साउट:",
      "- मसिनो काटेको प्याज थप्नुहोस् र सुनौलो खैरो नभएसम्म पकाउनुहोस्।",

      "4. अदुवा-लसुनको पेस्ट थप्नुहोस्:",
      "- अदुवा-लसुनको पेस्ट हाल्नुहोस् र काँचो गन्ध नआएसम्म पकाउनुहोस्।",

      "5. टमाटर र मसला थप्नुहोस्:",
      "- काटेको टमाटरहरू थप्नुहोस् र तिनीहरू नरम नभएसम्म पकाउनुहोस् र तेल मिश्रणबाट अलग हुन थाल्छ।",
      "- जीराको धुलो, धनियाको धुलो, बेसारको धुलो, रातो खुर्सानीको धुलो र नुन हाल्नुहोस्। राम्ररी मिलाउनुहोस्।",

      "6. बाख्राको आन्द्रा (भुटान) थप्नुहोस्):",
      "- मसलाको मिश्रणमा सफा र धोएको बाख्राको आन्द्राका टुक्राहरू थप्नुहोस्। टुक्राहरूलाई मसलाले कोट गर्नुहोस् र केही मिनेट पकाउनुहोस्।",

      "७. भुटानको परिकारलाई उमाल्नुहोस:",
      "- इच्छित करी स्थिरता प्राप्त गर्न पर्याप्त पानी थप्नुहोस्। भाँडो छोप्नुहोस् र बाख्राको आन्द्रा पूर्ण रूपमा पकाउन र कोमल नभएसम्म भाँडालाई कम तातोमा उमाल्न दिनुहोस्।",

      "8. मसला समायोजन गर्नुहोस् र सेवा गर्नुहोस्:",
      "- भुटानको परिकारको स्वाद लिनुहोस् र आवश्यक भएमा मसला मिलाउनुहोस्।",
      "- काटेको सिलिन्ट्रो (धनिया पात) संग गार्निश।",

      "9. सेवा गर्नुहोस्:",
      "- भात, रोटी, वा अन्य रोटी संग स्वादपूर्ण भुटान डिश सेवा गर्नुहोस्।",

      "तपाईको प्रामाणिक नेपाली भुटान (बाख्राको आन्द्रा) परिकारको मजा लिनुहोस्!"
    ]
  },
  {
    "title": "Taas ",
    "image": "images/taasmasu.png",
    "description": "Deep oil Fried marinated meat",
    "steps": [
      "Ingredients:",
      "- 500 grams bone-in goat meat, cut into small pieces",
      "- 2 tablespoons mustard oil",
      "- 1 tablespoon ginger paste",
      "- 1 tablespoon garlic paste",
      "- 1 teaspoon cumin powder",
      "- 1 teaspoon coriander powder",
      "- 1 teaspoon turmeric powder",
      "- 1 teaspoon red chili powder (adjust to taste)",
      "- Salt to taste",
      "- 2-3 cups vegetable oil (for deep frying)",
      "- Chopped cilantro (coriander leaves) for garnish",
      "- Sliced green chilies for garnish",
      "- Lemon wedges for serving",

      "Instructions:",
      "1. Marinate the Goat Meat:",
      "- In a bowl, combine the goat meat pieces with ginger paste, garlic paste, cumin powder, coriander powder, turmeric powder, red chili powder, and salt.",
      "- Mix well to coat the meat evenly with the spices. Let it marinate for at least 2 hours or more for better flavor.",

      "2. Heat Mustard Oil and Fry the Meat:",
      "- In a deep pan or kadai, heat mustard oil until it starts to smoke. Then, reduce the heat to medium.",
      "- Add the marinated goat meat pieces and fry them in batches until they are golden brown and crispy on the outside. The meat doesn't need to be fully cooked at this stage. Remove the fried meat and set it aside.",

      "3. Prepare for Deep Frying:",
      "- In the same pan, add vegetable oil for deep frying. Heat the oil over medium heat.",
      "- Once the oil is hot, carefully add the partially fried goat meat back into the oil in batches. Deep fry the meat until it's fully cooked and becomes crispy and golden brown. Remove and drain excess oil on paper towels.",

      "4. Garnish and Serve:",
      "- Arrange the crispy Taas on a serving plate.",
      "- Garnish with chopped cilantro and sliced green chilies.",
      "- Serve Taas hot with lemon wedges on the side.",

      "Enjoy your delicious Nepali Taas!",

      "Nepali :",
      "सामग्री:",
      "- बाख्राको मासुमा 500 ग्राम हड्डी, सानो टुक्रामा काटिएको",
      "- 2 चम्मच तोरीको तेल",
      "- १ चम्चा अदुवाको पेस्ट",
      "- 1 चम्मच लसुन पेस्ट",
      "- 1 चम्चा जीरा धुलो",
      "- 1 चम्चा धनिया धुलो",
      "- १ चम्चा बेसारको धुलो",
      "- १ चम्चा रातो खुर्सानीको धुलो (स्वाद अनुसार)",
      "- स्वाद अनुसार नुन",
      "- २-३ कप वनस्पति तेल (गहिरो फ्राइको लागि)",
      "- गार्निशको लागि काटेको कोलिन्ट्रो (धनिया पात)",
      "- गार्निसको लागि काटिएको हरियो खुर्सानी",
      "- सेवाको लागि कागती फालहरू",

      "निर्देशन:",
      "१. बाख्राको मासुलाई म्यारिनेट गर्नुहोस्:",
      "- एउटा कचौरामा बाख्राको मासुका टुक्रालाई अदुवाको पेस्ट, लसुनको पेस्ट, जीराको धुलो, धनियाको धुलो, बेसारको धुलो, रातो खुर्सानीको धुलो र नुन मिसाएर राख्नुहोस्।",
      "- मासुलाई मसलासँग समान रूपमा कोट गर्न राम्ररी मिलाउनुहोस्। राम्रो स्वादको लागि यसलाई कम्तिमा 2 घण्टा वा सोभन्दा बढी म्यारिनेट गर्न दिनुहोस्।",

      "२. तोरीको तेल तताएर मासु फ्राइ गर्नुहोस्:",
      "- गहिरो प्यान वा कडाइमा, तोरीको तेललाई धुवाँ नआएसम्म तताउनुहोस्। त्यसपछि, तातोलाई मध्यम बनाउनुहोस्।",
      "- म्यारिनेट गरिएको बाख्राको मासुका टुक्राहरू थप्नुहोस् र तिनीहरूलाई सुनौलो खैरो र बाहिरी क्रिस्पी नहोउन्जेल ब्याचहरूमा पकाउनुहोस्। यस चरणमा मासु पूर्ण रूपमा पकाउनु पर्दैन। भुटेको मासु हटाउनुहोस् र यसलाई अलग गर्नुहोस्।",

      "३. गहिरो फ्राइको लागि तयारी गर्नुहोस्:",
      "- एउटै प्यानमा, गहिरो फ्राइङको लागि वनस्पतिको तेल हाल्नुहोस्। तेललाई मध्यम तापमा तताउनुहोस्।",
      "- तेल तातो भएपछि, ध्यानपूर्वक आंशिक रूपमा भुटेको बाख्राको मासुलाई ब्याचहरूमा तेलमा थप्नुहोस्। मासु पूर्ण रूपमा पकाएर कुरकुरा र सुनौलो खैरो नहोउन्जेल गहिरो फ्राइ गर्नुहोस्। कागजको तौलियामा थप तेल हटाउनुहोस् र निकाल्नुहोस्।",

      "4. गार्निस र सर्भ:",
      "- क्रिस्पी तासलाई सर्विङ प्लेटमा मिलाउनुहोस्।",
      "- काटेको सिलिन्ट्रो र काटिएको हरियो खुर्सानीले गार्निस गर्नुहोस्।",
      "- छेउमा कागतीको टुक्रा लगाएर तातो तातो सेवा गर्नुहोस्।",

      "तपाईंको स्वादिष्ट नेपाली तासको मजा लिनुहोस्!"
    ]
  },
  {
    "title": "Keema",
    "image": "images/keema.png",
    "description": "Minced Cooked Meat",
    "steps": [
      "Ingredients:",
      "- 500 grams minced meat (chicken, mutton or Buff)",
      "- 2 medium onions, finely chopped",
      "- 2 medium tomatoes, chopped",
      "- 3 tablespoons cooking oil",
      "- 1 teaspoon cumin seeds (jeera)",
      "- 2-3 bay leaves (tej patta)",
      "- 2-3 cloves (laung)",
      "- 2-3 green cardamom pods (elaichi)",
      "- 1 cinnamon stick (dalchini)",
      "- 1 tablespoon ginger-garlic paste",
      "- 1 tablespoon cumin powder",
      "- 1 tablespoon coriander powder",
      "- 1/2 tablespoon turmeric powder",
      "- 1/2 tablespoon red chili powder (adjust to taste)",
      "- Salt to taste",
      "- Chopped cilantro (coriander leaves) for garnish",

      "Instructions:",
      "1. Heat Oil and Add Whole Spices:",
      "- In a large pan or pot, heat the cooking oil over medium heat.",
      "- Add cumin seeds, bay leaves, cloves, green cardamom pods, and cinnamon stick. Sauté until fragrant.",

      "2. Add Onions and Sauté:",
      "- Add the finely chopped onions and cook until they turn golden brown.",

      "3. Add Ginger-Garlic Paste:",
      "- Add the ginger-garlic paste and sauté until the raw smell disappears.",

      "4. Add Tomatoes and Spices:",
      "- Add the chopped tomatoes and cook until they soften and the oil starts to separate from the mixture.",
      "- Add cumin powder, coriander powder, turmeric powder, red chili powder, and salt. Mix well.",

      "5. Cook the Minced Meat:",
      "- Add the minced meat to the spice mixture. Break up any lumps and mix well to coat the meat with the spices.",
      "- Cover and cook the meat on medium-low heat until it's fully cooked and the oil starts to separate. Stir occasionally to prevent sticking.",

      "6. Adjust Seasoning and Garnish:",
      "- Taste the Keema and adjust the seasoning if needed.",
      "- Garnish with chopped cilantro (coriander leaves).",

      "7. Serve:",
      "- Serve the flavorful Keema with steamed rice, roti, or other breads.",

      "Enjoy your delicious Nepali-style Keema!",

      "Nepali :",
      "सामग्री:",
      "- 500 ग्राम केमा पारेको मासु (कुखुरा, मटन)",
      "- २ मध्यम प्याज, बारीक काटिएको",
      "- २ मध्यम टमाटर, काटिएको",
      "- 3 चम्चा खाना पकाउने तेल",
      "- 1 चम्चा जीरा (जिरा)",
      "- 2-3 बे पात (तेज पट्टा)",
      "- 2-3 लौंग (लौंग)",
      "- २-३ हरियो अलैंचीको फली (इलाची)",
      "- 1 दालचीनी स्टिक (दालचीनी)",
      "- 1 चम्मच अदुवा-लसुनको पेस्ट",
      "- 1 चम्मच जीरा पाउडर",
      "- 1 चम्मच धनिया धुलो",
      "- 1/2 चम्मच बेसारको धुलो",
      "- १/२ चम्चा रातो खुर्सानीको धुलो (स्वाद अनुसार)",
      "- स्वाद अनुसार नुन",
      "- गार्निशको लागि काटेको कोलिन्ट्रो (धनिया पात)",

      "निर्देशन:",
      "१. तेल तताउनुहोस् र सम्पूर्ण मसला थप्नुहोस्:",
      "- ठूलो प्यान वा भाँडोमा, खाना पकाउने तेललाई मध्यम तातोमा तताउनुहोस्।",
      "- जीराको दाना, बे पात, लौंग, हरियो अलैंची पोडहरू, र दालचीनी स्टिक थप्नुहोस्। सुगन्धित नभएसम्म पकाउनुहोस्।",

      "२. प्याज थप्नुहोस् र साउट:",
      "- मसिनो काटेको प्याज थप्नुहोस् र सुनौलो खैरो नभएसम्म पकाउनुहोस्।",

      "३. अदुवा-लसुनको पेस्ट थप्नुहोस्:",
      "- अदुवा-लसुनको पेस्ट हाल्नुहोस् र काँचो गन्ध नआएसम्म पकाउनुहोस्।",

      "4. टमाटर र मसला थप्नुहोस्:",
      "- काटेको टमाटरहरू थप्नुहोस् र तिनीहरू नरम नभएसम्म पकाउनुहोस् र तेल मिश्रणबाट अलग हुन थाल्छ।",
      "- जीराको धुलो, धनियाको धुलो, बेसारको धुलो, रातो खुर्सानीको धुलो र नुन हाल्नुहोस्। राम्ररी मिलाउनुहोस्।",

      "५. मिचेको मासु पकाउनुहोस्:",
      "- मसलाको मिश्रणमा केमा बनाएको मासु थप्नुहोस्। कुनै पनि गाँठहरू तोड्नुहोस् र मसलाको साथ मासु कोट गर्न राम्रोसँग मिलाउनुहोस्।",
      "- मासुलाई पूरै पकाउन नपाउन्जेल मध्यम-कम तातोमा छोप्नुहोस् र पकाउनुहोस् र तेल अलग हुन थाल्छ। टाँस्नबाट जोगाउन कहिलेकाहीं हलचल गर्नुहोस्।",

      "6. सिजन र गार्निश समायोजन गर्नुहोस्:",
      "- किमाको स्वाद लिनुहोस् र आवश्यक भएमा मसला समायोजन गर्नुहोस्।",
      "- काटेको सिलिन्ट्रो (धनिया पात) संग गार्निश।",

      "7. सेवा गर्नुहोस्:",
      "- स्वादिलो किमालाई भात, रोटी, वा अन्य रोटीहरूसँग सेवा गर्नुहोस्।",

      "तपाईंको स्वादिष्ट नेपाली शैली किमाको मजा लिनुहोस्!"
    ]
  },
  {
    "title": " Bhutun ",
    "image": "images/friedlung.png",
    "description": " Fried lung",
    "steps": [
      "Ingredients:",
      "- 500 grams goat lungs, cleaned and sliced into thin strips",
      "- 1 medium onion, finely chopped",
      "- 2-3 green chilies, finely chopped",
      "- 2 tablespoons cooking oil",
      "- 1 teaspoon cumin seeds (jeera)",
      "- 2-3 cloves (laung)",
      "- 1 teaspoon turmeric powder",
      "- 1 teaspoon cumin powder",
      "- 1 teaspoon coriander powder",
      "- 1/2 teaspoon red chili powder (adjust to taste)",
      "- Salt to taste",
      "- Chopped cilantro (coriander leaves) for garnish",
      "- Lemon wedges for serving",

      "Instructions:",
      "1. Clean and Prepare the Goat Lungs:",
      "- Thoroughly clean the goat lungs under running water to remove any debris.",
      "- Slice the cleaned lungs into thin strips.",

      "2. Heat Oil and Add Whole Spices:",
      "- In a pan, heat the cooking oil over medium heat.",
      "- Add cumin seeds and cloves. Sauté until aromatic.",

      "3. Add Onions and Green Chilies:",
      "- Add the finely chopped onion and green chilies. Sauté until the onion turns golden brown.",

      "4. Add Spices:",
      "- Add turmeric powder, cumin powder, coriander powder, red chili powder, and salt. Mix well.",

      "5. Add Goat Lungs:",
      "- Add the sliced goat lungs to the spice mixture. Mix to coat the lungs with the spices.",
      "- Cook the lungs over medium heat until they are tender and well cooked. Stir occasionally to prevent sticking.",

      "6. Fry the Lungs:",
      "- Once the lungs are cooked, increase the heat to medium-high.",
      "- Fry the cooked lungs until they turn crispy and golden brown. This will give them a crunchy texture.",

      "7. Garnish and Serve:",
      "- Garnish the fried lungs with chopped cilantro (coriander leaves).",
      "- Serve the Bhtun hot with lemon wedges on the side.",

      "Enjoy your traditional Nepali Bhtun (Fried Lungs)!",

      "Nepali :",
      "सामग्री:",
      "- 500 ग्राम बाख्राको फोक्सो, सफा गरी पातलो स्ट्रिप्समा काटिएको",
      "- १ मध्यम प्याज, बारीक काटिएको",
      "- 2-3 हरियो खुर्सानी, बारीक काटिएको",
      "- २ चम्चा खाना पकाउने तेल",
      "- 1 चम्चा जीरा (जिरा)",
      "- 2-3 लौंग (लौंग)",
      "- १ चम्चा बेसारको धुलो",
      "- 1 चम्चा जीरा धुलो",
      "- 1 चम्चा धनिया धुलो",
      "- १/२ चम्चा रातो खुर्सानीको धुलो (स्वाद अनुसार)",
      "- स्वाद अनुसार नुन",
      "- गार्निशको लागि काटेको कोलिन्ट्रो (धनिया पात)",
      "- सेवाको लागि कागती फालहरू",

      "निर्देशन:",
      "१. बाख्राको फोक्सो सफा र तयार पार्नुहोस्:",
      "- कुनै पनि फोहोर हटाउन बाख्राको फोक्सो बगिरहेको पानी मुनि राम्ररी सफा गर्नुहोस्।",
      "- सफा गरिएको फोक्सोलाई पातलो स्ट्रिप्समा काट्नुहोस्।",

      "2. तेल तताउनुहोस् र सम्पूर्ण मसला थप्नुहोस्:",
      "- एउटा प्यानमा, खाना पकाउने तेललाई मध्यम तातोमा तताउनुहोस्।",
      "- जीरा र लौंग थप्नुहोस्। सुगन्धित नभएसम्म पकाउनुहोस्।",

      "३. प्याज र हरियो खुर्सानी थप्नुहोस्:",
      "- मसिनो काटेको प्याज र हरियो खुर्सानी थप्नुहोस्। प्याज सुनौलो खैरो नभएसम्म पकाउनुहोस्।",

      "4. मसला थप्नुहोस्:",
      "- बेसारको धुलो, जीराको धुलो, धनियाको धुलो, रातो खुर्सानीको धुलो र नुन थप्नुहोस्। राम्ररी मिलाउनुहोस्।",

      "५. बाख्राको फोक्सो थप्नुहोस्:",
      "- मसलाको मिश्रणमा काटिएको बाख्राको फोक्सो थप्नुहोस्। फोक्सोलाई मसलाले कोट गर्न मिलाउनुहोस्।",
      "- फोक्सोलाई नरम र राम्ररी नपाएसम्म मध्यम तातोमा पकाउनुहोस्। टाँस्नबाट जोगाउन कहिलेकाहीं हलचल गर्नुहोस्।",

      "6. फोक्सो फ्राइ गर्नुहोस्:",
      "- फोक्सो पाकिसकेपछि, तातो मध्यम-उच्चमा बढाउनुहोस्।",
      "- पकाएको फोक्सो कुरकुरा र सुनौलो खैरो नभएसम्म भुन्नुहोस्। यसले तिनीहरूलाई कुरकुरा बनाउँछ।",

      "7. गार्निस र सर्भ:",
      "- भुटेको फोक्सोलाई काटेको सिलिन्ट्रो (धनिया पात) ले गार्निस गर्नुहोस्।",
      "- छेउमा कागतीको टुक्रा लगाएर भुटुनलाई तातो सर्भ गर्नुहोस्।",

      "आफ्नो परम्परागत नेपाली भुटुन (फ्राइड लुङ्ग्स) को मजा लिनुहोस्!"
    ]
  },
  {
    "title": " Masu Chiura ",
    "image": "images/masuchiura.png",
    "description": "Beaten rice with meat",
    "steps": [
      "Ingredients:",
      "- 250 grams boneless meat (chicken, mutton, or beef), cut into small pieces",
      "- 1 cup beaten rice (chiura), soaked and drained",
      "- 1 medium onion, finely chopped",
      "- 2 medium tomatoes, chopped",
      "- 3 tablespoons cooking oil",
      "- 1 teaspoon cumin seeds (jeera)",
      "- 2-3 bay leaves (tej patta)",
      "- 2-3 cloves (laung)",
      "- 2-3 green cardamom pods (elaichi)",
      "- 1 cinnamon stick (dalchini)",
      "- 1 tablespoon ginger-garlic paste",
      "- 1 tablespoon cumin powder",
      "- 1 tablespoon coriander powder",
      "- 1/2 tablespoon turmeric powder",
      "- 1/2 tablespoon red chili powder (adjust to taste)",
      "- Salt to taste",
      "- Chopped cilantro (coriander leaves) for garnish",

      "Instructions:",
      "1. Cook the Meat:",
      "- In a pot or pressure cooker, heat 2 tablespoons of oil over medium heat.",
      "- Add cumin seeds, bay leaves, cloves, green cardamom pods, and cinnamon stick. Sauté until fragrant.",
      "- Add the chopped onions and cook until they turn golden brown.",
      "- Add ginger-garlic paste and sauté until the raw smell disappears.",
      "- Add the chopped tomatoes and cook until they soften.",
      "- Add cumin powder, coriander powder, turmeric powder, red chili powder, and salt. Mix well.",
      "- Add the boneless meat pieces and cook until the meat is fully cooked and tender. Add water if needed. Once cooked, set aside.",

      "2. Prepare Beaten Rice (Chiura):",
      "- Soak the beaten rice in water for a few minutes until it softens.",
      "- Drain the water and spread the soaked beaten rice on a plate to let it dry slightly.",

      "3. Mix Meat and Beaten Rice:",
      "- In a large mixing bowl, combine the cooked meat mixture and the soaked and drained beaten rice. Mix well to combine all the flavors.",

      "4. Heat Oil and Add Whole Spices:",
      "- In the same pan, heat the remaining 1 tablespoon of oil over medium heat.",
      "- Add cumin seeds, bay leaves, cloves, green cardamom pods, and cinnamon stick. Sauté until fragrant.",

      "5. Add Mixed MasuCheura:",
      "- Add the mixed meat and beaten rice mixture to the pan. Stir-fry for a few minutes, allowing the flavors to meld together.",
      "- Adjust the seasoning if needed.",

      "6. Garnish and Serve:",
      "- Garnish the MasuCheura with chopped cilantro (coriander leaves).",
      "- Serve the delicious Nepali MasuCheura as a main dish or snack.",

      "Enjoy your flavorful MasuCheura!",

      "Nepali :",
      "सामग्री:",
      "- 250 ग्राम हड्डीविहीन मासु (कुखुरा, मटन, वा मासु), सानो टुक्रामा काटिएको",
      "- १ कप पिटेको चामल (चिउरा), भिजेको र निकास",
      "- १ मध्यम प्याज, बारीक काटिएको",
      "- २ मध्यम टमाटर, काटिएको",
      "- 3 चम्चा खाना पकाउने तेल",
      "- 1 चम्चा जीरा (जिरा)",
      "- 2-3 बे पात (तेज पट्टा)",
      "- 2-3 लौंग (लौंग)",
      "- २-३ हरियो अलैंचीको फली (इलाची)",
      "- 1 दालचीनी स्टिक (दालचीनी)",
      "- 1 चम्मच अदुवा-लसुनको पेस्ट",
      "- 1 चम्मच जीरा पाउडर",
      "- 1 चम्मच धनिया धुलो",
      "- 1/2 चम्मच बेसारको धुलो",
      "- १/२ चम्चा रातो खुर्सानीको धुलो (स्वाद अनुसार)",
      "- स्वाद अनुसार नुन",
      "- गार्निशको लागि काटेको कोलिन्ट्रो (धनिया पात)",

      "निर्देशन:",
      "1. मासु पकाउनुहोस्:",
      "- भाँडो वा प्रेसर कुकरमा २ चम्चा तेल मध्यम तातोमा तताउनुहोस्।",
      "- जीराको दाना, बे पात, लौंग, हरियो अलैंची पोडहरू, र दालचीनी स्टिक थप्नुहोस्। सुगन्धित नभएसम्म पकाउनुहोस्।",
      "- काटेको प्याज थप्नुहोस् र सुनौलो खैरो नहोउन्जेल पकाउनुहोस्।",
      "- अदुवा-लसुनको पेस्ट हाल्नुहोस् र काँचो गन्ध नआएसम्म पकाउनुहोस्।",
      "- काटेको टमाटर थप्नुहोस् र नरम नभएसम्म पकाउनुहोस्।",
      "- जीराको धुलो, धनियाको धुलो, बेसारको धुलो, रातो खुर्सानीको धुलो र नुन हाल्नुहोस्। राम्ररी मिलाउनुहोस्।",
      "- हड्डीविहीन मासुका टुक्राहरू थप्नुहोस् र मासु पूर्ण रूपमा पकाएर नरम नभएसम्म पकाउनुहोस्। आवश्यक भएमा पानी थप्नुहोस्। एक पटक पकाएर, अलग गर्नुहोस्।",

      "२. पिटेन राइस (चिउरा) तयार पार्नुहोस्:",
      "- पिटेको चामल नरम नभएसम्म पानीमा केही मिनेट भिजाउनुहोस्।",
      "- पानी निकाल्नुहोस् र भिजेको पिटेको चामललाई प्लेटमा अलिकति सुक्न दिनुहोस्।",

      "3. मासु र पिटेको चामल मिलाउनुहोस्:",
      "- एउटा ठुलो मिक्सिङ कचौरामा, पकाएको मासुको मिश्रण र भिजेको र निकास गरेको चामल मिलाउनुहोस्। सबै स्वादहरू मिलाउन राम्रोसँग मिलाउनुहोस्।",

      "4. तेल तताउनुहोस् र सम्पूर्ण मसला थप्नुहोस्:",
      "- एउटै प्यानमा, बाँकी 1 चम्चा तेल मध्यम तातोमा तताउनुहोस्।",
      "- जीराको दाना, बे पात, लौंग, हरियो अलैंची पोडहरू, र दालचीनी स्टिक थप्नुहोस्। सुगन्धित नभएसम्म पकाउनुहोस्।",

      "5. मिश्रित मासुचेउरा थप्नुहोस्:",
      "- प्यानमा मिश्रित मासु र पिटेको चामलको मिश्रण थप्नुहोस्। स्वादहरू सँगै मिलाउन अनुमति दिँदै केही मिनेटको लागि हलचल गर्नुहोस्।",
      "- आवश्यक भएमा मसला मिलाउनुहोस्।",

      "6. गार्निस र सर्भ:",
      "- मासुचेउरालाई काटेको सिलिन्ट्रो (धनिया पात) ले गार्निस गर्नुहोस्।",
      "- स्वादिष्ट नेपाली मासुचेउरालाई मुख्य परिकार वा खाजाको रूपमा सेवा गर्नुहोस्।",

      "तपाईंको स्वादपूर्ण मासुचेउराको मजा लिनुहोस्!"
    ]
  },
  {
    "title": "Sukuti",
    "image": "images/sukuti.png",
    "description": "Dried Meat",
    "steps": [
      "Ingredients:",
      "- 500 grams lean meat (buffalo, goat, or other preferred meat), thinly sliced",
      "- 2 tablespoons soy sauce",
      "- 2 tablespoons mustard oil",
      "- 1 teaspoon cumin powder",
      "- 1 teaspoon coriander powder",
      "- 1 teaspoon turmeric powder",
      "- 1 teaspoon red chili powder (adjust to taste)",
      "- Salt to taste",

      "Instructions:",
      "1. Prepare the Meat:",
      "- Trim any excess fat from the meat and slice it into thin pieces. Choose lean meat such as buffalo or goat for making Sukuti.",

      "2. Marinate the Meat:",
      "- In a mixing bowl, combine soy sauce, mustard oil, cumin powder, coriander powder, turmeric powder, red chili powder, and salt.",
      "- Add the sliced meat to the marinade and coat the pieces evenly with the mixture. Allow the meat to marinate for at least 2-4 hours, or preferably overnight, in the refrigerator.",

      "3. Sun-Dry the Meat:",
      "- Thread the marinated meat slices onto skewers or place them on a clean and dry surface under direct sunlight.",
      "- Allow the meat to sun-dry for 2-3 days, turning the pieces occasionally to ensure even drying. Make sure the meat is completely dried before proceeding to the next step.",

      "4. Oven-Dry the Meat (Optional):",
      "- If sun-drying isn't feasible, you can also oven-dry the meat. Preheat your oven to the lowest setting (around 150°F or 65°C). Place the skewers with the marinated meat on a baking sheet and dry them in the oven ",
      "- Dry the meat in the oven for several hours, checking periodically to ensure it doesn't get overcooked. The goal is to achieve a dry and slightly crispy texture, similar to sun-dried Sukuti.",

      "5. Store Sukuti:",
      "- Once the meat is completely dried, remove it from the skewers and let it cool.",
      "- Store the Sukuti in an airtight container to maintain its freshness. It can be stored at room temperature for several weeks or even longer if refrigerated.",

      "6. Enjoy Sukuti:",
      "- Sukuti is a popular snack in Nepal and is often enjoyed as is or used as an ingredient in various dishes.",
      "- It can be eaten as a crunchy snack, added to salads, mixed with fried rice or noodles, or even used to make traditional Nepali dishes like Sekuwa.",

      "Enjoy your homemade Sukuti, a flavorful Nepali dried meat delicacy!",

      "Nepali :",
      "सामग्री:",
      "- 500 ग्राम दुबला मासु (भैंसी, बाख्रा, वा अन्य मनपर्ने मासु), पातलो काटिएको",
      "- 2 चम्मच सोया सस",
      "- 2 चम्मच तोरीको तेल",
      "- 1 चम्चा जीरा धुलो",
      "- 1 चम्चा धनिया धुलो",
      "- १ चम्चा बेसारको धुलो",
      "- १ चम्चा रातो खुर्सानीको धुलो (स्वाद अनुसार)",
      "- स्वाद अनुसार नुन",

      "निर्देशन:",
      "१. मासु तयार गर्नुहोस्:",
      "- मासुबाट कुनै पनि अतिरिक्त बोसो काट्नुहोस् र यसलाई पातलो टुक्राहरूमा काट्नुहोस्। सुकुटी बनाउनको लागि भैंसी वा बाख्रा जस्ता दुबला मासु छनोट गर्नुहोस्।",

      "2. मासु मारीनेट गर्नुहोस्:",
      "- एक मिक्सिङ कचौरा मा, सोया सस, तोरीको तेल, जीरा धुलो, धनिया पाउडर, बेसार धुलो, रातो खुर्सानी पाउडर, र नुन मिलाउनुहोस्।",
      "- काटिएको मासुलाई म्यारिनेडमा थप्नुहोस् र टुक्राहरूलाई मिश्रणसँग समान रूपमा कोट गर्नुहोस्। मासुलाई कम्तिमा 2-4 घण्टासम्म, वा राम्रोसँग रातभर फ्रिजमा राख्न दिनुहोस्।",

      "३. घाममा सुकाएर मासु:",
      "- म्यारिनेट गरिएको मासुका टुक्राहरूलाई स्किभरहरूमा थ्रेड गर्नुहोस् वा तिनीहरूलाई सीधा घाममा सफा र सुक्खा सतहमा राख्नुहोस्।",
      "- मासुलाई २-३ दिनको लागि घाममा सुकाउन दिनुहोस्, सुक्न पनि सुनिश्चित गर्नका लागि कहिलेकाहीं टुक्राहरू घुमाउनुहोस्। अर्को चरणमा अघि बढ्नु अघि मासु पूर्ण रूपमा सुकिएको निश्चित गर्नुहोस्।",

      "4. ओभन-मासु सुख्खा (वैकल्पिक):",
      "- यदि घाममा सुकाउन सम्भव छैन भने, तपाईले मासुलाई ओभनमा सुकाउन पनि सक्नुहुन्छ। आफ्नो ओवनलाई सबैभन्दा तल्लो सेटिङमा (लगभग 150°F वा 65°C) मा पूर्व तताउनुहोस्। बेकिंग शीटमा म्यारिनेट गरिएको मासुको साथ स्किभरहरू राख्नुहोस् र तिनीहरूलाई ओवनमा सुकाउनुहोस् ",
      "- मासुलाई ओभनमा धेरै घण्टासम्म सुकाउनुहोस्, समय-समयमा जाँच गर्दै यो धेरै पकाएको छैन भनेर सुनिश्चित गर्नुहोस्। लक्ष्य भनेको घाममा सुकाउने सुकुटी जस्तै सुक्खा र थोरै क्रिस्पी बनावट प्राप्त गर्नु हो।",

      "5. स्टोर सुकुटी:",
      "- मासु पूर्णतया सुकिसकेपछि, यसलाई स्किभरबाट हटाउनुहोस् र चिसो हुन दिनुहोस्।",
      "- सुकुटीलाई यसको ताजापन कायम राख्नको लागि वायुरोधी कन्टेनरमा भण्डारण गर्नुहोस्। यसलाई धेरै हप्ता वा फ्रिजमा राखिएको खण्डमा अझ लामो समयसम्म कोठाको तापक्रममा भण्डारण गर्न सकिन्छ।",

      "6. सुकुटीको मजा लिनुहोस्:",
      "- सुकुटी नेपालमा एक लोकप्रिय खाजा हो र यसलाई प्रायः विभिन्न परिकारमा परिकारको रूपमा प्रयोग गरिन्छ वा प्रयोग गरिन्छ।",
      "- यसलाई क्रन्ची स्न्याक्सको रूपमा खान सकिन्छ, सलादमा थपेर, फ्राइड राइस वा चाउचाउमा मिसाएर वा सेकुवा जस्ता परम्परागत नेपाली परिकार बनाउन पनि प्रयोग गरिन्छ।",

      "आफ्नो घरमा बनाइएको सुकुटीको मजा लिनुहोस्, नेपाली सुकेको मासुको स्वादिष्ट स्वाद!"
    ]
  },
  {
    "title": "Steamed Non-Veg Momo",
    "image": "images/steamedmomo.png",
    "description": "Steamed Meat Filled Dumplings",
    "steps": [
      "Ingredients for Filling:",
      "- 250 grams ground meat (chicken, mutton, or pork)",
      "- 1 cup finely chopped cabbage",
      "- 1 medium onion, finely chopped",
      "- 2 tablespoons chopped green onions",
      "- 1 tablespoon minced ginger",
      "- 1 tablespoon minced garlic",
      "- 1 teaspoon soy sauce",
      "- 1 teaspoon sesame oil",
      "- 1/2 teaspoon ground black pepper",
      "- Salt to taste",
      "- Cooking oil for sautéing",

      "Ingredients for Dough:",
      "- 2 cups all-purpose flour",
      "- Water (as needed)",
      "- Salt to taste",

      "Dipping Sauce Ingredients:",
      "- 3 tablespoons soy sauce",
      "- 2 tablespoons vinegar",
      "- 1 teaspoon minced garlic",
      "- 1 teaspoon minced ginger",
      "- 1 teaspoon sesame oil",
      "- 1/2 teaspoon red chili flakes (adjust to taste)",

      "Instructions:",
      "1. Prepare the Filling:",
      "- In a pan, heat a tablespoon of cooking oil over medium heat.",
      "- Add minced ginger and garlic, and sauté until fragrant.",
      "- Add finely chopped onion and cook until it turns translucent.",
      "- Add ground meat and cook until it's browned and fully cooked.",
      "- Add finely chopped cabbage and sauté until it softens.",
      "- Stir in soy sauce, sesame oil, chopped green onions, ground black pepper, and salt.",
      "- Cook for a few minutes until the flavors are well combined. Remove from heat and let the filling cool.",

      "2. Prepare the Dough:",
      "- In a mixing bowl, combine all-purpose flour and a pinch of salt.",
      "- Gradually add water and knead to form a smooth and elastic dough.",
      "- Cover the dough with a damp cloth and let it rest for about 30 minutes.",

      "3. Shape the Momos:",
      "- Divide the dough into small portions and roll them into thin circles.",
      "- Place a spoonful of the prepared filling in the center of each circle.",

      "4. Fold and Pleat the Momos:",
      "- Hold the edges of the circle and start pleating to fold the momos. Pinch and twist the pleats to seal the momos completely.",
      "- Make sure the momos are well-sealed to prevent leakage during steaming.",

      "5. Steam the Momos:",
      "- Grease the steamer basket or line it with cabbage leaves to prevent sticking.",
      "- Arrange the shaped momos in the steamer, leaving some space between them.",
      "- Steam the momos for about 10-15 minutes, or until the dough becomes translucent and the filling is cooked.",

      "6. Prepare Dipping Sauce:",
      "- In a small bowl, mix together soy sauce, vinegar, minced garlic, minced ginger, sesame oil, and red chili flakes.",

      "7. Serve the Momos:",
      "- Once the momos are steamed, remove them from the steamer.",
      "- Serve the steamed momos hot with the prepared dipping sauce.",

      "Enjoy your delicious Steamed Non-vegetarian Momos, a classic Nepali treat!",

      "Nepali :",
      "भर्नका लागि सामग्री:",
      "- 250 ग्राम मासु (कुखुरा, मटन, वा सुँगुर)",
      "- १ कप बारीक काटेको बन्दागोभी",
      "- १ मध्यम प्याज, बारीक काटिएको",
      "- २ चम्चा हरियो प्याज काटेको",
      "- 1 चम्चा केमा अदुवा",
      "- 1 चम्चा केमा गरेको लसुन",
      "- 1 चम्चा सोया सस",
      "- 1 चम्चा तिलको तेल",
      "- १/२ चम्चा कालो मिर्च",
      "- स्वाद अनुसार नुन",
      "- पकाउनको लागि तेल",

      "आटाको लागि सामग्री:",
      "- २ कप सबै उद्देश्यको पीठो",
      "- पानी (आवश्यकता अनुसार)",
      "- स्वाद अनुसार नुन",

      "डिपिङ सस सामग्री:",
      "- 3 चम्मच सोया सस",
      "- 2 चम्मच सिरका",
      "- 1 चम्चा केमा गरेको लसुन",
      "- १ चिया चम्चा अदुवा",
      "- 1 चम्चा तिलको तेल",
      "- 1/2 चम्चा रातो खुर्सानी फ्लेक्स (स्वाद समायोजन)",

      "निर्देशन:",
      "1. भर्ने तयारी गर्नुहोस्:",
      "- एउटा प्यानमा, एक चम्चा खाना पकाउने तेललाई मध्यम तातोमा तताउनुहोस्।",
      "- केमा पारेको अदुवा र लसुन थप्नुहोस्, र सुगन्धित नभएसम्म पकाउनुहोस्।",
      "- मसिनो काटेको प्याज थप्नुहोस् र पारदर्शी नहोउन्जेल पकाउनुहोस्।",
      "- भुइँको मासु थप्नुहोस् र यो खैरो र पूर्ण रूपमा पकाएको नभएसम्म पकाउनुहोस्।",
      "- मसिनो काटेको बन्दाबी थप्नुहोस् र नरम नभएसम्म पकाउनुहोस्।",
      "- सोया सस, तिलको तेल, काटेको हरियो प्याज, कालो मिर्च र नुनमा हाल्नुहोस्।",
      "- स्वादहरू राम्ररी नमिल्दासम्म केही मिनेट पकाउनुहोस्। तातोबाट हटाउनुहोस् र फिलिंगलाई चिसो हुन दिनुहोस्।",

      "2. आटा तयार गर्नुहोस्:",
      "- एक मिक्सिङ कटोरामा, सबै उद्देश्यको पीठो र एक चुटकी नुन मिलाउनुहोस्।",
      "- बिस्तारै पानी थप्नुहोस् र चिल्लो र लोचदार पीठो बनाउनको लागि मुछ्नुहोस्।",
      "- आटालाई ओसिलो कपडाले छोप्नुहोस् र लगभग 30 मिनेटको लागि आराम गर्नुहोस्।",

      "३. मोमोजलाई आकार दिनुहोस्:",
      "- आटालाई सानो भागमा विभाजन गर्नुहोस् र पातलो घेराहरूमा घुमाउनुहोस्।",
      "- प्रत्येक सर्कलको बीचमा एक चम्चा तयार फिलिंग राख्नुहोस्।",

      "४. मोमोजलाई फोल्ड एण्ड प्लीट गर्नुहोस्:",
      "- सर्कलको किनारहरू समात्नुहोस् र मोमोजलाई फोल्ड गर्न प्लीट गर्न थाल्नुहोस्। मोमोसलाई पूर्ण रूपमा बन्द गर्नका लागि प्लीट्सलाई पिन्च गर्नुहोस् र ट्विस्ट गर्नुहोस्।",
      "- वाफ गर्दा चुहावट रोक्नको लागि मोमोहरू राम्ररी सील गरिएको सुनिश्चित गर्नुहोस्।",

      "५. मोमोजलाई वाफ गर्नुहोस्:",
      "- स्टीमरको टोकरीलाई ग्रीस गर्नुहोस् वा टाँसिनबाट जोगाउन बन्दाबीका पातहरूले यसलाई लाइन गर्नुहोस्।",
      "- स्टीमरमा आकारको मोमोहरू मिलाउनुहोस्, तिनीहरूको बीचमा केही ठाउँ छोड्नुहोस्।",
      "- लगभग 10-15 मिनेटको लागि मोमोलाई वाफ पार्नुहोस्, वा पीठो पारदर्शी नहोउन्जेल र फिलिंग पकाउँदैन।",

      "6. डिपिङ सस तयार गर्नुहोस्:",
      "- एउटा सानो कचौरा मा, सोया सस, सिरका, केमा लसुन, केमा अदुवा, तिलको तेल, र रातो खुर्सानी फ्लेक्स सँगै मिलाउनुहोस्।",

      "७. मोमोस सेवा गर्नुहोस्:",
      "- एकचोटि मोमोहरू भाप भएपछि, तिनीहरूलाई स्टीमरबाट हटाउनुहोस्।",
      "- तयार पारिएको चटनी संग भाप मोमोस तातो सेवा गर्नुहोस्।",

      "तपाईंको स्वादिष्ट स्टीम्ड नन-वेजिटेरियन मोमोजको मजा लिनुहोस्, एक क्लासिक नेपाली ट्रीट!"
    ]
  },
  {
    "title": "Fried Non-Veg Momo",
    "image": "images/momo.png",
    "description": "Fried Meat Filled Dumplings",
    "steps": [
      "Ingredients for Filling:",
      "- 250 grams ground meat (chicken, mutton, or pork)",
      "- 1 cup finely chopped cabbage",
      "- 1 medium onion, finely chopped",
      "- 2 tablespoons chopped green onions",
      "- 1 tablespoon minced ginger",
      "- 1 tablespoon minced garlic",
      "- 1 teaspoon soy sauce",
      "- 1 teaspoon sesame oil",
      "- 1/2 teaspoon ground black pepper",
      "- Salt to taste",
      "- Cooking oil for sautéing",

      "Ingredients for Dough:",
      "- 2 cups all-purpose flour",
      "- Water (as needed)",
      "- Salt to taste",

      "Ingredients for Frying:",
      "- Cooking oil (for deep frying)",

      "Dipping Sauce Ingredients:",
      "- 3 tablespoons soy sauce",
      "- 2 tablespoons vinegar",
      "- 1 teaspoon minced garlic",
      "- 1 teaspoon minced ginger",
      "- 1 teaspoon sesame oil",
      "- 1/2 teaspoon red chili flakes (adjust to taste)",

      "Instructions:",
      "1. Prepare the Filling:",
      "- In a pan, heat a tablespoon of cooking oil over medium heat.",
      "- Add minced ginger and garlic, and sauté until fragrant.",
      "- Add finely chopped onion and cook until it turns translucent.",
      "- Add ground meat and cook until it's browned and fully cooked.",
      "- Add finely chopped cabbage and sauté until it softens.",
      "- Stir in soy sauce, sesame oil, chopped green onions, ground black pepper, and salt.",
      "- Cook for a few minutes until the flavors are well combined. Remove from heat and let the filling cool.",

      "2. Prepare the Dough:",
      "- In a mixing bowl, combine all-purpose flour and a pinch of salt.",
      "- Gradually add water and knead to form a smooth and elastic dough.",
      "- Cover the dough with a damp cloth and let it rest for about 30 minutes.",

      "3. Shape the Momos:",
      "- Divide the dough into small portions and roll them into thin circles.",
      "- Place a spoonful of the prepared filling in the center of each circle.",

      "4. Fold and Pleat the Momos:",
      "- Hold the edges of the circle and start pleating to fold the momos. Pinch and twist the pleats to seal the momos completely.",
      "- Make sure the momos are well-sealed to prevent leakage during frying.",

      "5. Heat Oil for Frying:",
      "- Heat cooking oil in a deep pan or pot for deep frying. The oil should be moderately hot, around 350°F (175°C).",

      "6. Fry the Momos:",
      "- Carefully slide the sealed momos into the hot oil, a few at a time.",
      "- Fry the momos until they turn golden brown and crispy on all sides. This usually takes about 4-5 minutes.",
      "- Use a slotted spoon to remove the fried momos and place them on paper towels to drain excess oil.",

      "7. Prepare Dipping Sauce:",
      "- In a small bowl, mix together soy sauce, vinegar, minced garlic, minced ginger, sesame oil, and red chili flakes.",

      "8. Serve the Momos:",
      "- Serve the fried momos hot with the prepared dipping sauce.",

      "Enjoy your delicious Fried Non-vegetarian Momos, a delightful Nepali snack!",

      "Nepali :",
      "भर्नका लागि सामग्री:",
      "- 250 ग्राम मासु (कुखुरा, मटन, वा सुँगुर)",
      "- १ कप बारीक काटेको बन्दागोभी",
      "- १ मध्यम प्याज, बारीक काटिएको",
      "- २ चम्चा हरियो प्याज काटेको",
      "- 1 चम्चा केमा अदुवा",
      "- 1 चम्चा केमा गरेको लसुन",
      "- 1 चम्चा सोया सस",
      "- 1 चम्चा तिलको तेल",
      "- १/२ चम्चा कालो मिर्च",
      "- स्वाद अनुसार नुन",
      "- पकाउनको लागि तेल",

      "आटाको लागि सामग्री:",
      "- २ कप सबै उद्देश्यको पीठो",
      "- पानी (आवश्यकता अनुसार)",
      "- स्वाद अनुसार नुन",

      "फ्राइङका लागि सामग्री:",
      "- खाना पकाउने तेल (गहिरो फ्राइको लागि)",

      "डिपिङ सस सामग्री:",
      "- 3 चम्मच सोया सस",
      "- 2 चम्मच सिरका",
      "- 1 चम्चा केमा गरेको लसुन",
      "- १ चिया चम्चा अदुवा",
      "- 1 चम्चा तिलको तेल",
      "- 1/2 चम्चा रातो खुर्सानी फ्लेक्स (स्वाद समायोजन)",

      "निर्देशन:",
      "1. भर्ने तयारी गर्नुहोस्:",
      "- एउटा प्यानमा, एक चम्चा खाना पकाउने तेललाई मध्यम तातोमा तताउनुहोस्।",
      "- केमा पारेको अदुवा र लसुन थप्नुहोस्, र सुगन्धित नभएसम्म पकाउनुहोस्।",
      "- मसिनो काटेको प्याज थप्नुहोस् र पारदर्शी नहोउन्जेल पकाउनुहोस्।",
      "- भुइँको मासु थप्नुहोस् र यो खैरो र पूर्ण रूपमा पकाएको नभएसम्म पकाउनुहोस्।",
      "- मसिनो काटेको बन्दाबी थप्नुहोस् र नरम नभएसम्म पकाउनुहोस्।",
      "- सोया सस, तिलको तेल, काटेको हरियो प्याज, कालो मिर्च र नुनमा हाल्नुहोस्।",
      "- स्वादहरू राम्ररी नमिल्दासम्म केही मिनेट पकाउनुहोस्। तातोबाट हटाउनुहोस् र फिलिंगलाई चिसो हुन दिनुहोस्।",

      "2. आटा तयार गर्नुहोस्:",
      "- एक मिक्सिङ कटोरामा, सबै उद्देश्यको पीठो र एक चुटकी नुन मिलाउनुहोस्।",
      "- बिस्तारै पानी थप्नुहोस् र चिल्लो र लोचदार पीठो बनाउनको लागि मुछ्नुहोस्।",
      "- आटालाई ओसिलो कपडाले छोप्नुहोस् र लगभग 30 मिनेटको लागि आराम गर्नुहोस्।",

      "३. मोमोजलाई आकार दिनुहोस्:",
      "- आटालाई सानो भागमा विभाजन गर्नुहोस् र पातलो घेराहरूमा घुमाउनुहोस्।",
      "- प्रत्येक सर्कलको बीचमा एक चम्चा तयार फिलिंग राख्नुहोस्।",

      "४. मोमोजलाई फोल्ड एण्ड प्लीट गर्नुहोस्:",
      "- सर्कलको किनारहरू समात्नुहोस् र मोमोजलाई फोल्ड गर्न प्लीट गर्न थाल्नुहोस्। मोमोसलाई पूर्ण रूपमा बन्द गर्नका लागि प्लीट्सलाई पिन्च गर्नुहोस् र ट्विस्ट गर्नुहोस्।",
      "- फ्राइङको समयमा चुहावट रोक्नको लागि मोमोहरू राम्रोसँग सील गरिएको सुनिश्चित गर्नुहोस्।",

      "5. फ्राइको लागि तेल तताउनुहोस्:",
      "- गहिरो फ्राइङको लागि गहिरो प्यान वा भाँडामा खाना पकाउने तेल तताउनुहोस्। तेल मध्यम तातो हुनुपर्छ, लगभग 350°F (175°C)।",

      "6. मोमोज फ्राइ:",
      "- सिल गरिएको मोमोलाई तातो तेलमा ध्यानपूर्वक स्लाइड गर्नुहोस्, एक पटकमा केही।",
      "- मोमोहरू सुनौलो खैरो र चारै तिर क्रिस्पी नभएसम्म फ्राइ गर्नुहोस्। यसले सामान्यतया 4-5 मिनेट लिन्छ।",
      "- फ्राइड मोमोहरू हटाउनको लागि स्लटेड चम्चा प्रयोग गर्नुहोस् र थप तेल निकाल्न कागजको तौलियामा राख्नुहोस्।",

      "7. डिपिङ सस तयार गर्नुहोस्:",
      "- एउटा सानो कचौरा मा, सोया सस, सिरका, केमा लसुन, केमा अदुवा, तिलको तेल, र रातो खुर्सानी फ्लेक्स सँगै मिलाउनुहोस्।",

      "8. मोमोस सेवा गर्नुहोस्:",
      "- फ्राइड मोमोजलाई तयार डुब्ने चटनी संग तातो सेवा गर्नुहोस्।",

      "तपाईको स्वादिष्ट फ्राइड मांसाहारी मोमोजको मजा लिनुहोस्, एक रमाइलो नेपाली खाजा!"
    ]
  },
  {
    "title": "Jhol Non-Veg Momo",
    "image": "images/jholmomo.png",
    "description": "Meat Filled Dumplings With Soup ",
    "steps": [
      "Ingredients for Filling:",
      "- 250 grams ground meat (chicken, mutton, or pork)",
      "- 1 cup finely chopped cabbage",
      "- 1 medium onion, finely chopped",
      "- 2 tablespoons chopped green onions",
      "- 1 tablespoon minced ginger",
      "- 1 tablespoon minced garlic",
      "- 1 teaspoon soy sauce",
      "- 1 teaspoon sesame oil",
      "- 1/2 teaspoon ground black pepper",
      "- Salt to taste",
      "- Cooking oil for sautéing",

      "Ingredients for Dough:",
      "- 2 cups all-purpose flour",
      "- Water (as needed)",
      "- Salt to taste",

      "Ingredients for Soup (Jhol):",
      "- 4 cups chicken or vegetable broth",
      "- 1 medium onion, thinly sliced",
      "- 2 medium tomatoes, chopped",
      "- 2-3 green chilies, slit",
      "- 1 teaspoon minced ginger",
      "- 1 teaspoon minced garlic",
      "- 1 teaspoon cumin powder",
      "- 1 teaspoon coriander powder",
      "- 1/2 teaspoon turmeric powder",
      "- 1/2 teaspoon red chili powder (adjust to taste)",
      "- 1/2 teaspoon garam masala",
      "- 2 tablespoons cooking oil",
      "- Chopped cilantro (coriander leaves) for garnish",

      "Dipping Sauce Ingredients:",
      "- 3 tablespoons soy sauce",
      "- 2 tablespoons vinegar",
      "- 1 teaspoon minced garlic",
      "- 1 teaspoon minced ginger",
      "- 1 teaspoon sesame oil",
      "- 1/2 teaspoon red chili flakes (adjust to taste)",

      "Instructions:",
      "1. Prepare the Filling:",
      "- In a pan, heat a tablespoon of cooking oil over medium heat.",
      "- Add minced ginger and garlic, and sauté until fragrant.",
      "- Add finely chopped onion and cook until it turns translucent.",
      "- Add ground meat and cook until it's browned and fully cooked.",
      "- Add finely chopped cabbage and sauté until it softens.",
      "- Stir in soy sauce, sesame oil, chopped green onions, ground black pepper, and salt.",
      "- Cook for a few minutes until the flavors are well combined. Remove from heat and let the filling cool.",

      "2. Prepare the Dough:",
      "- In a mixing bowl, combine all-purpose flour and a pinch of salt.",
      "- Gradually add water and knead to form a smooth and elastic dough.",
      "- Cover the dough with a damp cloth and let it rest for about 30 minutes.",

      "3. Shape the Momos:",
      "- Divide the dough into small portions and roll them into thin circles.",
      "- Place a spoonful of the prepared filling in the center of each circle.",
      "- Fold and pleat the momos, sealing them completely.",

      "4. Make the Soup (Jhol):",
      "- In a pot, heat 2 tablespoons of cooking oil over medium heat.",
      "- Add minced ginger and garlic, and sauté until fragrant.",
      "- Add sliced onions and cook until they turn translucent.",
      "- Add chopped tomatoes and cook until they soften.",

      "5. Add Spices and Broth:",
      "- Add cumin powder, coriander powder, turmeric powder, red chili powder, and garam masala. Mix well.",
      "- Pour in the chicken or vegetable broth and bring the soup to a simmer.",
      "- Add slit green chilies and let the flavors meld together.",

      "6. Steam the Momos:",
      "- Grease the steamer basket or line it with cabbage leaves to prevent sticking.",
      "- Arrange the shaped momos in the steamer, leaving some space between them.",
      "- Steam the momos for about 10-15 minutes, or until the dough becomes translucent and the filling is cooked.",

      "7. Serve Jhol Momos:",
      "- Once the momos are steamed, remove them from the steamer.",
      "- Place a few steamed momos in a serving bowl.",
      "- Ladle the flavorful soup (jhol) over the momos.",
      "- Garnish with chopped cilantro (coriander leaves).",

      "8. Prepare Dipping Sauce:",
      "- In a small bowl, mix together soy sauce, vinegar, minced garlic, minced ginger, sesame oil, and red chili flakes.",

      "9. Serve:",
      "- Serve the Jhol Non-vegetarian Momos hot with the prepared dipping sauce.",

      "Enjoy your comforting and flavorful Jhol Non-vegetarian Momos, a Nepali delight!",

      "Nepali :",
      "भर्नका लागि सामग्री:",
      "- 250 ग्राम मासु (कुखुरा, मटन, वा सुँगुर)",
      "- १ कप बारीक काटेको बन्दागोभी",
      "- १ मध्यम प्याज, बारीक काटिएको",
      "- २ चम्चा हरियो प्याज काटेको",
      "- 1 चम्चा केमा अदुवा",
      "- 1 चम्चा केमा गरेको लसुन",
      "- 1 चम्चा सोया सस",
      "- 1 चम्चा तिलको तेल",
      "- १/२ चम्चा कालो मिर्च",
      "- स्वाद अनुसार नुन",
      "- पकाउनको लागि तेल",

      "आटाको लागि सामग्री:",
      "- २ कप सबै उद्देश्यको पीठो",
      "- पानी (आवश्यकता अनुसार)",
      "- स्वाद अनुसार नुन",

      "सूप (झोल) को लागि सामग्री):",
      "- 4 कप चिकन वा तरकारी शोरबा",
      "- १ मध्यम प्याज, पातलो काटिएको",
      "- २ मध्यम टमाटर, काटिएको",
      "- २-३ वटा हरियो खुर्सानी, काटेको",
      "- १ चिया चम्चा अदुवा",
      "- 1 चम्चा केमा गरेको लसुन",
      "- 1 चम्चा जीरा धुलो",
      "- 1 चम्चा धनिया धुलो",
      "- १/२ चम्चा बेसारको धुलो",
      "- १/२ चम्चा रातो खुर्सानीको धुलो (स्वाद अनुसार)",
      "- १/२ चम्चा गरम मसाला",
      "- २ चम्चा खाना पकाउने तेल",
      "- गार्निशको लागि काटेको कोलिन्ट्रो (धनिया पात)",

      "डिपिङ सस सामग्री:",
      "- 3 चम्मच सोया सस",
      "- 2 चम्मच सिरका",
      "- 1 चम्चा केमा गरेको लसुन",
      "- १ चिया चम्चा अदुवा",
      "- 1 चम्चा तिलको तेल",
      "- 1/2 चम्चा रातो खुर्सानी फ्लेक्स (स्वाद समायोजन)",

      "निर्देशन:",
      "1. भर्ने तयारी गर्नुहोस्:",
      "- एउटा प्यानमा, एक चम्चा खाना पकाउने तेललाई मध्यम तातोमा तताउनुहोस्।",
      "- केमा पारेको अदुवा र लसुन थप्नुहोस्, र सुगन्धित नभएसम्म पकाउनुहोस्।",
      "- मसिनो काटेको प्याज थप्नुहोस् र पारदर्शी नहोउन्जेल पकाउनुहोस्।",
      "- भुइँको मासु थप्नुहोस् र यो खैरो र पूर्ण रूपमा पकाएको नभएसम्म पकाउनुहोस्।",
      "- मसिनो काटेको बन्दाबी थप्नुहोस् र नरम नभएसम्म पकाउनुहोस्।",
      "- सोया सस, तिलको तेल, काटेको हरियो प्याज, कालो मिर्च र नुनमा हाल्नुहोस्।",
      "- स्वादहरू राम्ररी नमिल्दासम्म केही मिनेट पकाउनुहोस्। तातोबाट हटाउनुहोस् र फिलिंगलाई चिसो हुन दिनुहोस्।",

      "2. आटा तयार गर्नुहोस्:",
      "- एक मिक्सिङ कटोरामा, सबै उद्देश्यको पीठो र एक चुटकी नुन मिलाउनुहोस्।",
      "- बिस्तारै पानी थप्नुहोस् र चिल्लो र लोचदार पीठो बनाउनको लागि मुछ्नुहोस्।",
      "- आटालाई ओसिलो कपडाले छोप्नुहोस् र लगभग 30 मिनेटको लागि आराम गर्नुहोस्।",

      "३. मोमोजलाई आकार दिनुहोस्:",
      "- आटालाई सानो भागमा विभाजन गर्नुहोस् र पातलो घेराहरूमा घुमाउनुहोस्।",
      "- प्रत्येक सर्कलको बीचमा एक चम्चा तयार फिलिंग राख्नुहोस्।",
      "- मोमोजलाई फोल्ड गर्नुहोस् र प्लीट गर्नुहोस्, तिनीहरूलाई पूर्ण रूपमा बन्द गर्नुहोस्।",

      "4. सूप बनाउनुहोस् (झोल):",
      "- एउटा भाँडोमा, 2 चम्चा खाना पकाउने तेललाई मध्यम तातोमा तताउनुहोस्।",
      "- केमा पारेको अदुवा र लसुन थप्नुहोस्, र सुगन्धित नभएसम्म पकाउनुहोस्।",
      "- काटिएको प्याज थप्नुहोस् र पारदर्शी नभएसम्म पकाउनुहोस्।",
      "- काटेको टमाटर थप्नुहोस् र नरम नभएसम्म पकाउनुहोस्।",

      "5. मसला र ब्रोथ थप्नुहोस्:",
      "- जीराको धुलो, धनियाको धुलो, बेसारको धुलो, रातो खुर्सानीको धुलो र गरम मसाला हाल्नुहोस्। राम्रोसँग मिलाउनुहोस्।",
      "- कुखुरा वा तरकारीको ब्रोथमा हाल्नुहोस् र सूपलाई उमालेर ल्याउनुहोस्।",
      "- चिरिएको हरियो खुर्सानी थप्नुहोस् र स्वादहरू सँगै मिलाउनुहोस्।",

      "6. मोमोलाई वाफ गर्नुहोस्:",
      "- स्टीमरको टोकरीलाई ग्रीस गर्नुहोस् वा टाँसिनबाट जोगाउन बन्दाबीका पातहरूले यसलाई लाइन गर्नुहोस्।",
      "- स्टीमरमा आकारको मोमोहरू मिलाउनुहोस्, तिनीहरूको बीचमा केही ठाउँ छोड्नुहोस्।",
      "- लगभग 10-15 मिनेटको लागि मोमोलाई वाफ पार्नुहोस्, वा पीठो पारदर्शी नहोउन्जेल र फिलिंग पकाउँदैन।",

      "७. झोल मोमोस सेवा गर्नुहोस्:",
      "- एकचोटि मोमोहरू भाप भएपछि, तिनीहरूलाई स्टीमरबाट हटाउनुहोस्।",
      "- एक सर्भिङ कचौरा मा केहि बाफ मोमोहरु राख्नुहोस्।",
      "- स्वादिलो सुप (झोल) मोमोसमाथि हाल्नुहोस्।",
      "- काटेको सिलिन्ट्रो (धनिया पात) संग गार्निश।",

      "8. डिपिङ सस तयार गर्नुहोस्:",
      "- एउटा सानो कचौरा मा, सोया सस, सिरका, केमा लसुन, केमा अदुवा, तिलको तेल, र रातो खुर्सानी फ्लेक्स सँगै मिलाउनुहोस्।",

      "9. सेवा गर्नुहोस्:",
      "- झोल मांसाहारी मोमोजलाई तयार डुबाउने चटनीसँग तातो सर्भ गर्नुहोस्।",

      "आफ्नो सान्त्वनादायी र स्वादिलो झोल मांसाहारी मोमोजको मजा लिनुहोस्, एक नेपाली रमाइलो!"
    ]
  },
  {
    "title": "Choila",
    "image": "images/choila.png",
    "description": " spiced and marinated grilled meat",
    "steps": [
      "Ingredients for Marination:",
      "- 250 grams boneless meat (chicken, mutton, or buffalo), boiled and shredded",
      "- 2 tablespoons mustard oil",
      "- 1 tablespoon minced ginger",
      "- 1 tablespoon minced garlic",
      "- 1 tablespoon minced green chilies (adjust to taste)",
      "- 1 teaspoon cumin powder",
      "- 1 teaspoon coriander powder",
      "- 1 teaspoon turmeric powder",
      "- 1 teaspoon red chili powder (adjust to taste)",
      "- Salt to taste",
      "- Juice of 1 lemon",

      "Other Ingredients:",
      "- 1 medium onion, finely chopped",
      "- 2-3 green onions, finely chopped",
      "- Chopped cilantro (coriander leaves) for garnish",
      "- Sliced green chilies for garnish",
      "- Slices of lemon for serving",

      "Instructions:",
      "1. Prepare the Meat:",
      "- Boil the boneless meat until fully cooked. You can use chicken, mutton, or buffalo meat.",
      "- Shred the boiled meat into thin strips or bite-sized pieces.",

      "2. Marinate the Meat:",
      "- In a mixing bowl, combine the shredded meat with mustard oil, minced ginger, minced garlic, minced green chilies, cumin powder, coriander powder, turmeric powder, red chili powder, salt, and lemon juice.",
      "- Mix the marination thoroughly, ensuring the spices are well coated on the meat.",
      "- Let the marinated meat sit for about 30 minutes to allow the flavors to meld.",

      "3. Grill or Roast the Meat:",
      "- Grill or roast the marinated meat until it gets a smoky flavor and a slightly charred texture. You can use a grill, stovetop griddle, or open flame for this step.",
      "- Turn the meat pieces occasionally to ensure even grilling and prevent burning.",
      "- Once the meat is well-grilled, remove it from the heat and let it cool slightly.",

      "4. Prepare Chhoila:",
      "- In a mixing bowl, combine the grilled meat with finely chopped onions and green onions.",
      "- Toss the mixture together to distribute the flavors evenly.",

      "5. Garnish and Serve:",
      "- Garnish the Chhoila with chopped cilantro and sliced green chilies.",
      "- Serve the Chhoila with slices of lemon on the side.",

      "6. Enjoy:",
      "- Enjoy the flavorful Chhoila as an appetizer or snack, traditionally served with beaten rice (chiura) or as a side dish with drinks.",

      "Chhoila is a beloved Nepali dish with bold flavors that you can savor and enjoy!",

      "Nepali :",
      "मरिनेसनका लागि सामग्री:",
      "- २५० ग्राम हड्डीविहीन मासु (कुखुरा, माटन वा भैंसी), उमालेको र टुक्रा पारेको",
      "- 2 चम्मच तोरीको तेल",
      "- 1 चम्चा केमा अदुवा",
      "- 1 चम्चा केमा गरेको लसुन",
      "- 1 चम्चा केसेको हरियो खुर्सानी (स्वाद समायोजन)",
      "- 1 चम्चा जीरा धुलो",
      "- 1 चम्चा धनिया धुलो",
      "- १ चम्चा बेसारको धुलो",
      "- १ चम्चा रातो खुर्सानीको धुलो (स्वाद अनुसार)",
      "- स्वाद अनुसार नुन",
      "- १ कागतीको रस",

      "अन्य सामग्री:",
      "- १ मध्यम प्याज, बारीक काटिएको",
      "- २-३ हरियो प्याज, बारीक काटिएको",
      "- गार्निशको लागि काटेको कोलिन्ट्रो (धनिया पात)",
      "- गार्निसको लागि काटिएको हरियो खुर्सानी",
      "- सेवाको लागि कागतीको टुक्रा",

      "निर्देशन:",
      "१. मासु तयार गर्नुहोस्:",
      "- हड्डीविहीन मासुलाई पूरै नपाएसम्म उमाल्नुहोस्। कुखुरा, मासु वा भैंसीको मासु प्रयोग गर्न सक्नुहुन्छ।",
      "- उमालेको मासुलाई पातलो स्ट्रिप्स वा काट्ने आकारको टुक्रामा काट्नुहोस्।",

      "2. मासु मारीनेट गर्नुहोस्:",
      "- एक मिक्सिङ कचौरा मा, तोरीको तेल, अदुवा, केमा गरेको लसुन, केमा हरियो खुर्सानी, जीरा धुलो, धनिया धुलो, बेसार धुलो, रातो खुर्सानी धुलो, नुन र कागतीको रस संग टुक्रा मासु मिलाउनुहोस्।",
      "- मासुमा मसला राम्ररी लेपिएको छ भनी सुनिश्चित गर्दै मेरिनेसनलाई राम्ररी मिलाउनुहोस्।",
      "- मरिनेट गरिएको मासुलाई स्वादहरू मिलाउनको लागि लगभग 30 मिनेट बस्न दिनुहोस्।",

      "३. मासु ग्रिल वा रोस्ट:",
      "- मैरिनेट गरिएको मासुलाई धुवाँयुक्त स्वाद र अलिकति जलेको बनावट नआएसम्म ग्रिल वा रोस्ट गर्नुहोस्। तपाईंले यो चरणको लागि ग्रिल, स्टोभटप ग्रिड वा खुला आगो प्रयोग गर्न सक्नुहुन्छ।",
      "- मासुका टुक्राहरू समय-समयमा घुमाउनुहोस् ताकि ग्रिलिङ पनि सुनिश्चित गर्न र जल्नबाट जोगाउन।",
      "- मासु राम्रोसँग ग्रिल भएपछि, यसलाई तातोबाट हटाउनुहोस् र यसलाई अलिकति चिसो हुन दिनुहोस्।",

      "4. छोइला तयार गर्नुहोस्:",
      "- एक मिक्सिङ कचौरा मा, ग्रिल गरिएको मासुलाई बारीक काटेको प्याज र हरियो प्याज संग मिलाउनुहोस्।",
      "- स्वादहरू समान रूपमा वितरण गर्न मिश्रणलाई सँगै टास गर्नुहोस्।",

      "5. गार्निस र सर्भ:",
      "- छोइलालाई काटेको सिलिन्ट्रो र काटेको हरियो खुर्सानीले सजाउनुहोस्।",
      "छोइलालाई छेउमा कागतीको टुक्रा राखेर सेवा गर्नुहोस्।",

      "6. आनन्द लिनुहोस्:",
      "- स्वादिलो छोइलालाई भोक वा खाजाको रूपमा लिनुहोस्, परम्परागत रूपमा पिटेको भात (चिउरा) वा पेय पदार्थको साथ साइड डिशको रूपमा सेवा गरिन्छ।",

      "छोइला एउटा मनपर्ने नेपाली परिकार हो जसको बोल्ड स्वाद छ जसको स्वाद र मजा लिन सक्नुहुन्छ!"
    ]
  },
  {
    "title": "Gundruk ",
    "image": "images/gundruk.png",
    "description": "Fermented leafy greens",
    "steps": [
      "Ingredients:",
      "- 1 bundle of leafy greens (mustard greens, spinach, radish leaves, etc.)",
      "- 2 tablespoons turmeric powder",
      "- 2 tablespoons salt",

      "Instructions:",
      "1. Prepare the Leafy Greens:",
      "- Wash the leafy greens thoroughly to remove any dirt or debris.",
      "- Cut the greens into small pieces or shred them into thin strips.",

      "2. Ferment the Greens:",
      "- In a large mixing bowl, layer the shredded leafy greens with turmeric powder and salt.",
      "- Gently massage the greens to ensure the turmeric and salt are evenly distributed.",
      "- Cover the bowl with a clean cloth or lid.",
      "- Allow the greens to ferment in a warm place at room temperature for about 3-5 days, depending on the temperature and desired level of fermentation.",
      "- Stir the greens once a day to ensure even fermentation.",

      "3. Dry and Store:",
      "- Once the greens have fermented to your preference, spread them out on a clean surface or tray to dry under the sun.",
      "- Let the greens dry until they are crisp and moisture-free.",
      "- Store the dried Gundruk in an airtight container, away from moisture and direct sunlight.",

      "4. Prepare Gundruk Curry (Optional):",
      "- To prepare a Gundruk curry, soak a portion of the dried Gundruk in water until it rehydrates.",
      "- Squeeze out excess water and chop the rehydrated Gundruk.",
      "- In a pan, heat oil and add fenugreek seeds, dried red chilies, and garlic.",
      "- Add the chopped Gundruk and sauté for a few minutes.",
      "- Add water and cook until the Gundruk becomes soft and the flavors meld together.",
      "- Serve the Gundruk curry with rice or as a side dish.",

      "5. Enjoy:",
      "- Enjoy Gundruk as a flavorful side dish or use it to prepare Gundruk curry.",

      "Gundruk is a staple in Nepali cuisine and is known for its unique tangy and earthy flavor.",

      "Nepali :",
      "सामग्री:",
      "- पातदार सागको 1 बन्डल (तोरीको साग, पालक, मूला पात, आदि)",
      "- २ चम्चा बेसारको धुलो",
      "- 2 चम्मच नुन",

      "निर्देशन:",
      "१. पातदार हरियो तयार गर्नुहोस्:",
      "- कुनै पनि फोहोर वा फोहोर हटाउन पातदार सागहरू राम्ररी धुनुहोस्।",
      "- सागलाई सानो टुक्रामा काट्नुहोस् वा पातलो स्ट्रिप्समा काट्नुहोस्।",

      "2. हरियो किण्वन:",
      "- एउटा ठूलो मिक्सिङ कचौरामा, टुक्रा पारिएको सागलाई बेसारको धुलो र नुनले तह लगाउने।",
      "- बेसार र नुन समान रूपमा वितरण गरिएको सुनिश्चित गर्न बिस्तारै हरियो मालिस गर्नुहोस्।",
      "- कचौरालाई सफा कपडा वा ढक्कनले छोप्नुहोस्।",
      "- सागलाई न्यानो ठाउँमा कोठाको तापक्रममा लगभग ३-५ दिनसम्म किण्वन गर्न दिनुहोस्, तापक्रम र किण्वनको इच्छित स्तरमा निर्भर गर्दछ।",
      "- किण्वन सुनिश्चित गर्न दिनको एक पटक सागहरू हलचल गर्नुहोस्।",

      "3. सुख्खा र स्टोर:",
      "- सागहरू तपाईंको प्राथमिकतामा किण्वित भएपछि, तिनीहरूलाई सफा सतहमा फैलाउनुहोस् वा घाममुनि सुकाउनको लागि ट्रे।",
      "- सागहरू कुरकुरा र चिस्यान-रहित नभएसम्म सुकाउन दिनुहोस्।",
      "- सुकेको गुन्ड्रुकलाई हावारोधी कन्टेनरमा ओसिलो र प्रत्यक्ष घामबाट टाढा राख्ने।",

      "4. गुन्द्रुक करी तयार गर्नुहोस् (वैकल्पिक):",
      "- गुन्ड्रुक करी तयार गर्न, सुकेको गुन्ड्रुकको एक भाग पानीमा भिजाउनुहोस् जबसम्म यो रिहाइड्रेट हुँदैन।",
      "- अतिरिक्त पानी निचोल्नुहोस् र रिहाइड्रेटेड गुन्ड्रुक काट्नुहोस्।",
      "- एउटा प्यानमा तेल तताएर मेथीको दाना, सुकेको रातो खुर्सानी र लसुन हाल्नुहोस्।",
      "- काटिएको गुन्ड्रुक थप्नुहोस् र केहि मिनेटको लागि पकाउनुहोस्।",
      "- पानी थप्नुहोस् र गुन्ड्रुक नरम नहोउन्जेल पकाउनुहोस् र स्वादहरू एकसाथ मिल्दैन।",
      "- गुन्ड्रुक करी भातसँग वा साइड डिशको रूपमा सेवा गर्नुहोस्।",

      "5. आनन्द लिनुहोस्:",
      "- गुन्ड्रुकलाई स्वादिलो साइड डिशको रूपमा लिनुहोस् वा गुन्ड्रुक करी तयार गर्न प्रयोग गर्नुहोस्।",

      "गुन्ड्रुक नेपाली खानामा एक प्रमुख पदार्थ हो र यसको अनौठो ट्याङ्गी र माटोको स्वादका लागि परिचित छ।"
    ]
  },
  {
    "title": "Dhido ",
    "image": "images/dhido.png",
    "description": "Well Cooked Traditional buckwheat or millet dough",
    "steps": [
      "Ingredients:",
      "- 1 cup buckwheat, millet, or corn flour",
      "- Water (approximately 3 cups)",
      "- A pinch of salt",

      "Instructions:",
      "1. Boil Water:",
      "- In a pot, bring approximately 3 cups of water to a rolling boil.",

      "2. Add Flour:",
      "- Slowly add the buckwheat, millet, or corn flour into the boiling water while continuously stirring to prevent lumps from forming.",
      "- Keep stirring until the mixture thickens and starts to come together.",

      "3. Knead the Dough:",
      "- Once the mixture becomes difficult to stir, remove the pot from the heat.",
      "- Carefully transfer the mixture to a clean, flat surface or a large mixing bowl.",
      "- Allow the mixture to cool slightly, and then knead it while it's still warm. Use a wooden spoon or your hands to knead the dough until it's smooth and pliable.",
      "- Add a pinch of salt while kneading to enhance the flavor of the Dhindo.",

      "4. Shape the Dhindo:",
      "- Divide the kneaded dough into smaller portions and roll them into round balls.",
      "- Make a small well in the center of each ball using your thumb or a finger. This will help with handling and eating the Dhindo.",

      "5. Serve Dhindo:",
      "- Serve Dhindo hot as a staple accompaniment with traditional Nepali dishes like Gundruk, Achar (pickles), and other side dishes.",
      "- It's common to use your fingers to pinch off a piece of Dhindo, then dip it into the accompanying dishes.",

      "6. Enjoy:",
      "- Dhindo is a nutritious and hearty staple food in Nepali cuisine, enjoyed for its simplicity and versatility.",

      "Note: Dhindo is traditionally eaten with your hands, and its texture may be quite different from regular Western dishes.",

      "Nepali :",
      "सामग्री:",
      "- 1 कप अनाज, कोदो, वा मकैको पीठो",
      "- पानी (लगभग 3 कप)",
      "- एक चुटकी नुन",

      "निर्देशन:",
      "1. पानी उमालेर:",
      "- एउटा भाँडोमा, लगभग 3 कप पानी एक रोलिंग फोडामा ल्याउनुहोस्।",

      "2. पीठो थप्नुहोस्:",
      "- बिस्तारै उमालेको पानीमा अनाज, कोदो, वा मकैको पिठो हाल्नुहोस् र लगातार हल्लाउँदै गाँठो बन्नबाट जोगाउनुहोस्।",
      "- मिश्रण गाढा नहोउन्जेल र एकै ठाउँमा आउन थालेसम्म हलचल गरिरहनुहोस्।",

      "३. आटा मुछ्नुहोस्:",
      "- मिश्रण हलाउन गाह्रो भएपछि, तातोबाट भाँडो हटाउनुहोस्।",
      "- सावधानीपूर्वक मिश्रणलाई सफा, समतल सतह वा ठूलो मिश्रण कचौरामा स्थानान्तरण गर्नुहोस्।",
      "- मिश्रणलाई थोरै चिसो हुन दिनुहोस्, र त्यसपछि यसलाई तातो हुँदा मुछ्नुहोस्। यो चिल्लो र लचिलो नभएसम्म पीठो मुनाउन काठको चम्चा वा हातहरू प्रयोग गर्नुहोस्।",
      "- ढिन्डोको स्वाद बढाउन एक चुटकी नुन हाल्नुहोस्।",

      "४. ढिन्डोको आकार दिनुहोस्:",
      "- मुनिएको पीठोलाई साना भागहरूमा विभाजन गर्नुहोस् र तिनीहरूलाई गोलो बलहरूमा घुमाउनुहोस्।",
      "- आफ्नो औंला वा औंला प्रयोग गरी प्रत्येक बलको बीचमा एउटा सानो इनार बनाउनुहोस्। यसले ढिन्डोलाई ह्यान्डल गर्न र खान मद्दत गर्नेछ।",

      "५. ढिन्डो सेवा गर्नुहोस्:",
      "- गुन्द्रुक, अचार (अचार), र अन्य साइड डिशहरू जस्ता परम्परागत नेपाली परिकारहरूसँग मुख्य साथको रूपमा धिन्डोलाई तातो सेवा गर्नुहोस्।",
      "- ढिन्डोको टुक्रा चिम्टाउन आफ्नो औंलाहरू प्रयोग गर्नु सामान्य छ, त्यसपछि यसलाई साथको भाँडामा डुबाउनुहोस्।",

      "6. आनन्द लिनुहोस्:",
      "- ढिन्डो नेपाली खानामा एक पौष्टिक र हार्दिक मुख्य खाना हो, यसको सादगी र बहुमुखी प्रतिभाको लागि रमाइलो छ।",

      "नोट: ढिन्डो परम्परागत रूपमा तपाईंको हातले खाइन्छ, र यसको बनावट नियमित पश्चिमी परिकारहरू भन्दा फरक हुन सक्छ।"
    ]
  },
  {
    "title": " Puri ",
    "image": "images/puri.png",
    "description": "Fried bread , Basically Served in Rainy Season",
    "steps": [
      "Ingredients:",
      "- 2 cups all-purpose flour",
      "- Water (as needed)",
      "- 1/2 teaspoon salt",
      "- Oil (for deep frying)",

      "Instructions:",
      "1. Prepare the Dough:",
      "- In a mixing bowl, combine the all-purpose flour and salt.",
      "- Gradually add water and knead to form a soft and smooth dough. The dough should not be too sticky or too dry.",
      "- Cover the dough with a damp cloth and let it rest for about 15-20 minutes to relax the gluten.",

      "2. Heat Oil for Frying:",
      "- In a deep pan or pot, heat oil for deep frying. The oil should be moderately hot, around 350°F (175°C).",

      "3. Shape and Roll the Puris:",
      "- Divide the rested dough into small golf ball-sized portions.",
      "- Take a portion of the dough, roll it between your palms to make a smooth ball, and then flatten it slightly to form a small disc.",
      "- On a clean, floured surface, use a rolling pin to roll out the disc into a thin circle. The puri should be about 4-5 inches in diameter. You can use a little extra flour to prevent sticking while rolling.",

      "4. Deep Fry the Puris:",
      "- Gently slide the rolled puri into the hot oil. It will start to puff up almost immediately.",
      "- Use a slotted spoon to lightly press down on the puri in the oil, causing it to puff up even more.",
      "- Once the puri is golden brown and puffed up on both sides, carefully remove it from the oil using a slotted spoon.",
      "- Place the fried puri on paper towels to drain excess oil.",

      "5. Fry the Remaining Puris:",
      "- Repeat the process with the remaining portions of dough, rolling and frying each puri individually.",
      "- Make sure the oil temperature remains consistent for each batch to achieve crispy and well-puffed puris.",

      "6. Serve Puri Roti:",
      "- Serve the hot and crispy puris immediately.",
      "- Puri roti is commonly enjoyed with various curries, chutneys, or even as a standalone snack.",

      "7. Enjoy:",
      "- Enjoy the delicious Puri Roti as a versatile accompaniment in Nepali meals or as a satisfying snack.",

      "Puri Roti is a beloved and flavorful addition to Nepali cuisine, adding a delightful crunch to your meal.",

      "Nepali :",
      "सामग्री:",
      "- २ कप सबै उद्देश्यको पीठो",
      "- पानी (आवश्यकता अनुसार)",
      "- १/२ चम्चा नुन",
      "- तेल (गहिरो फ्राइको लागि)",

      "निर्देशन:",
      "1. आटा तयार गर्नुहोस्:",
      "- एक मिक्सिङ कटोरामा, सबै उद्देश्यको पीठो र नुन मिलाउनुहोस्।",
      "- बिस्तारै पानी थप्नुहोस् र नरम र चिल्लो पीठो बनाउनुहोस्। पीठो धेरै टाँसिने वा धेरै सुख्खा हुनु हुँदैन।",
      "- आटालाई ओसिलो कपडाले छोप्नुहोस् र ग्लुटेनलाई आराम गर्न लगभग 15-20 मिनेटको लागि आराम गर्नुहोस्।",

      "2. फ्राइको लागि तेल तताउनुहोस्:",
      "- गहिरो प्यान वा भाँडोमा, गहिरो फ्राइङको लागि तेल तताउनुहोस्। तेल मध्यम तातो हुनुपर्छ, लगभग 350°F (175°C)।",

      "३. पुरिसलाई आकार र रोल गर्नुहोस्:",
      "- विश्राम गरिएको आटालाई सानो गल्फ बल आकारका भागहरूमा विभाजन गर्नुहोस्।",
      "- पीठोको एक भाग लिनुहोस्, यसलाई आफ्नो हत्केलाको बीचमा घुमाउनुहोस् र चिल्लो बल बनाउनको लागि, र त्यसपछि सानो डिस्क बनाउनको लागि यसलाई अलिकति समतल गर्नुहोस्।",
      "- सफा, पिठो भएको सतहमा, डिस्कलाई पातलो सर्कलमा घुमाउनको लागि रोलिङ पिन प्रयोग गर्नुहोस्। पुरीको व्यास ४-५ इन्चको हुनुपर्छ। रोलिङ गर्दा टाँसिनबाट जोगाउन तपाईं अलिकति अतिरिक्त पीठो प्रयोग गर्न सक्नुहुन्छ।",

      "४. पुरीसलाई गहिरो फ्राइ:",
      "- रोल गरिएको पुरीलाई तातो तेलमा बिस्तारै स्लाइड गर्नुहोस्। यो तुरुन्तै पफ हुन थाल्छ।",
      "- तेलमा पुरीलाई हल्का रूपमा तल थिच्नको लागि स्लटेड चम्चा प्रयोग गर्नुहोस्, यसले अझ बढी पफ बनाउँछ।",
      "- एक पटक पुरी सुनौलो खैरो र दुबै छेउमा फुल्ने भएपछि, एक चिल्लो चम्चा प्रयोग गरी ध्यानपूर्वक तेलबाट हटाउनुहोस्।",
      "- अतिरिक्त तेल निकाल्नका लागि भुटेको पुरीलाई कागजको तौलियामा राख्नुहोस्।",

      "५. बाँकी रहेको पुरीलाई भुने:",
      "- आटाको बाँकी भागहरू, रोलिङ र प्रत्येक पुरीलाई अलग-अलग फ्राइ गरेर प्रक्रिया दोहोर्याउनुहोस्।",
      "- क्रिस्पी र राम्ररी पफ गरिएको प्युरीहरू प्राप्त गर्न प्रत्येक ब्याचको लागि तेलको तापक्रम एकरूप होस् भन्ने सुनिश्चित गर्नुहोस्।",

      "6. पुरी रोटी दिनुहोस्:",
      "- तातो र क्रिस्पी पुरी तुरुन्तै सेवा गर्नुहोस्।",
      "- पुरी रोटी सामान्यतया विभिन्न करी, चटनी, वा एक स्ट्यान्डअलोन खाजाको रूपमा पनि रमाइलो गरिन्छ।",

      "7. आनन्द लिनुहोस्:",
      "- नेपाली खानामा बहुमुखी संगत वा सन्तोषजनक खाजाको रूपमा स्वादिष्ट पुरी रोटीको मजा लिनुहोस्।",

      "पुरी रोटी नेपाली व्यञ्जनमा एक प्रिय र स्वादपूर्ण थपिएको छ, जसले तपाइँको खानामा रमाइलो क्रन्च थप्छ।"
    ]
  },
  {
    "title": " Chatpate ",
    "image": "images/chatpate.png",
    "description": " Mixture Of Lots of snacks ",
    "steps": [
      "Ingredients:",
      "- 2 cups puffed rice (muri or chidwa)",
      "- 1 cup chopped vegetables (cucumber, tomato, onion, green bell pepper)",
      "- 1/2 cup boiled potatoes, diced",
      "- 1/2 cup boiled black chickpeas (kala chana)",
      "- 1/4 cup chopped fresh cilantro (coriander leaves)",
      "- 1/4 cup chopped fresh mint leaves",
      "- 1/4 cup chopped fresh green onions",
      "- 2-3 green chilies, finely chopped (adjust to taste)",
      "- 1/4 cup roasted peanuts",
      "- 1/4 cup roasted soybeans",
      "- 2-3 tablespoons tamarind pulp",
      "- 1 tablespoon chaat masala",
      "- 1/2 teaspoon cumin powder",
      "- 1/2 teaspoon red chili powder (adjust to taste)",
      "- Salt to taste",
      "- Lemon juice to taste",

      "Instructions:",
      "1. Prepare the Puffed Rice:",
      "- In a large mixing bowl, add the puffed rice (muri or chidwa).",
      "- Crush the puffed rice slightly with your hands to break down any large pieces. The texture should be crispy but not crushed to a powder.",

      "2. Add Vegetables and Boiled Ingredients:",
      "- Add chopped cucumber, tomato, onion, green bell pepper, boiled potatoes, and boiled black chickpeas to the puffed rice.",
      "- Mix the ingredients together to combine.",

      "3. Add Fresh Herbs and Spices:",
      "- Add chopped fresh cilantro, mint leaves, green onions, and finely chopped green chilies.",
      "- Sprinkle chaat masala, cumin powder, red chili powder, and salt over the mixture.",
      "- Squeeze tamarind pulp over the mixture. Adjust the amount of tamarind pulp according to your taste preferences.",
      "- Squeeze fresh lemon juice over the mixture for extra tanginess.",

      "4. Add Crunchy Elements:",
      "- Add roasted peanuts and roasted soybeans to the mixture.",
      "- Gently toss all the ingredients together until well combined.",

      "5. Serve Chatpate:",
      "- Divide the chatpate mixture into serving bowls.",
      "- Garnish with additional chopped cilantro and mint leaves if desired.",
      "- Serve the chatpate immediately and enjoy the burst of tangy, spicy, and crunchy flavors.",

      "6. Enjoy:",
      "- Chatpate is a beloved Nepali street food that's perfect for snacking or as a light and refreshing appetizer.",

      "Note: Feel free to customize the ingredients and spice levels according to your taste preferences.",

      "Nepali :",
      "सामग्री:",
      "- २ कप पफ्ड राइस (मुरी वा चिडवा)",
      "- १ कप काटेको तरकारी (काकडी, टमाटर, प्याज, हरियो खुर्सानी)",
      "- १/२ कप उमालेको आलु, काटेको",
      "- 1/2 कप उमालेको कालो चना (काला चना)",
      "- 1/4 कप काटिएको ताजा कोलिन्ट्रो (धनिया पात)",
      "- 1/4 कप कटा ताजा पुदीना पात",
      "- 1/4 कप कटा ताजा हरियो प्याज",
      "- २-३ हरियो खुर्सानी, बारीक काटिएको (स्वाद अनुसार)",
      "- 1/4 कप भुटेको मूंगफली",
      "- 1/4 कप भुटेको भटमास",
      "- २-३ चम्चा इमलीको पल्प",
      "- 1 चम्मच चाट मसाला",
      "- 1/2 चम्चा जीरा धुलो",
      "- १/२ चम्चा रातो खुर्सानीको धुलो (स्वाद अनुसार)",
      "- स्वाद अनुसार नुन",
      "- स्वाद अनुसार कागतीको रस",

      "निर्देशन:",
      "१. पफ्ड राइस तयार गर्नुहोस्:",
      "- एउटा ठूलो मिक्सिङ कचौरामा, पफ गरिएको चामल (मुरी वा चिडवा) थप्नुहोस्।",
      "- कुनै पनि ठूला टुक्राहरू भाँच्नका लागि पफ गरिएको चामललाई आफ्नो हातले थोरै कुस्नुहोस्। बनावट कुरकुरा हुनुपर्छ तर पाउडरमा कुच्नु हुँदैन।",

      "२. तरकारी र उमालेको सामग्री थप्नुहोस्:",
      "- काँक्रो, टमाटर, प्याज, हरियो खुर्सानी, उमालेको आलु, र उमालेको कालो चना पकाएको भातमा हाल्नुहोस्।",
      "- मिश्रण गर्नका लागि अवयवहरू एकसाथ मिलाउनुहोस्।",

      "३. ताजा जडिबुटी र मसला थप्नुहोस्:",
      "- काटेको ताजा सिलिन्ट्रो, पुदिना पात, हरियो प्याज, र बारीक काटिएको हरियो खुर्सानी थप्नुहोस्।",
      "- मिश्रणमा चाट मसाला, जीराको धुलो, रातो खुर्सानीको धुलो र नुन छर्काउनुहोस्।",
      "- मिश्रणमा इमलीको पल्प निचोड्नुहोस्। तपाईंको स्वाद प्राथमिकता अनुसार इमलीको पल्पको मात्रा मिलाउनुहोस्।",
      "- थप टेन्जिनेसको लागि मिश्रणमा ताजा कागतीको रस निचोड्नुहोस्।",

      "4. क्रन्ची तत्वहरू थप्नुहोस्:",
      "- मिश्रणमा भुटेको बदाम र भुटेको भटमास थप्नुहोस्।",
      "- राम्ररी नमिल्दासम्म सबै अवयवहरूलाई बिस्तारै टास्नुहोस्।",

      "५. सर्भ च्याटपाट:",
      "- च्याटपेट मिश्रणलाई सर्भिङ कचौरामा विभाजन गर्नुहोस्।",
      "- यदि चाहिएको खण्डमा थप काटिएको कोलिन्ट्रो र पुदिना पातले गार्निस गर्नुहोस्।",
      "- च्याटपेट तुरुन्तै सेवा गर्नुहोस् र ट्याङ्गी, मसालेदार र कुरकुरा स्वादको आनन्द लिनुहोस्।",

      "6. आनन्द लिनुहोस्:",
      "- चाटपाटे एक प्रिय नेपाली स्ट्रीट फूड हो जुन स्न्याकिङ वा हल्का र स्फूर्तिदायी भोकको रूपमा उपयुक्त छ।",

      "नोट: तपाईंको स्वाद प्राथमिकताहरू अनुसार सामग्री र मसला स्तरहरू अनुकूलित गर्न स्वतन्त्र महसुस गर्नुहोस्।"
    ]
  },
  {
    "title": "Alu Achar ",
    "image": "images/aloachar.png",
    "description": "Spicy potato and Cucumber salad",
    "steps": [""]
  },
  {
    "title": " Rajma ",
    "image": "images/rajma.png",
    "description": "Kidney bean curry ",
    "steps": [
      "Ingredients:",
      "- 1 cup dried kidney beans (rajma), soaked overnight and drained",
      "- 2 tablespoons oil or ghee",
      "- 1 teaspoon cumin seeds",
      "- 1 medium onion, finely chopped",
      "- 2 medium tomatoes, chopped",
      "- 1 tablespoon ginger-garlic paste",
      "- 1 teaspoon turmeric powder",
      "- 1 teaspoon cumin powder",
      "- 1 teaspoon coriander powder",
      "- 1/2 teaspoon red chili powder (adjust to taste)",
      "- 1/2 teaspoon garam masala",
      "- Salt to taste",
      "- Chopped fresh cilantro (coriander leaves) for garnish",

      "Instructions:",
      "1. Cook the Soaked Kidney Beans:",
      "- In a pressure cooker or a large pot, add the soaked and drained kidney beans.",
      "- Add enough water to cover the beans by about 2 inches.",
      "- Cook the kidney beans until they are tender and can be easily mashed between your fingers. This usually takes about 20-25 minutes in a pressure cooker or longer in a regular pot.",

      "2. Prepare the Base:",
      "- In a separate pot, heat oil or ghee over medium heat.",
      "- Add cumin seeds and let them splutter.",
      "- Add finely chopped onion and sauté until it turns translucent and golden brown.",

      "3. Add Tomatoes and Spices:",
      "- Add chopped tomatoes to the pot and cook until they soften.",
      "- Stir in ginger-garlic paste and sauté until the raw smell disappears.",
      "- Add turmeric powder, cumin powder, coriander powder, red chili powder, and salt. Mix the spices well and cook for a few minutes.",

      "4. Combine the Cooked Beans and Base:",
      "- Add the cooked kidney beans along with any remaining cooking liquid to the pot with the tomato and spice mixture.",
      "- Mix everything together and let it simmer for about 10-15 minutes on medium-low heat, allowing the flavors to meld.",

      "5. Adjust Consistency and Seasoning:",
      "- If the rajma is too thick, you can add some water to achieve your desired consistency.",
      "- Taste and adjust the seasoning, adding more salt or spices if needed.",

      "6. Finish with Garam Masala:",
      "- Stir in garam masala to enhance the flavors of the dish.",
      "- Let the rajma simmer for an additional 2-3 minutes.",

      "7. Garnish and Serve:",
      "- Garnish the rajma with chopped fresh cilantro (coriander leaves).",
      "- Serve the delicious rajma hot with steamed rice, roti, or naan.",

      "8. Enjoy:",
      "- Enjoy the rich and flavorful Nepali-style rajma as a hearty and satisfying meal.",

      "Note: You can also customize the spiciness and flavors according to your preference.",

      "Nepali :",
      "सामग्री:",
      "- 1 कप सुकेको किडनी बीन्स (राजमा), रातभर भिजाएर निकालिएको",
      "- २ चम्चा तेल वा घिउ",
      "- १ चम्चा जीरा",
      "- १ मध्यम प्याज, बारीक काटिएको",
      "- २ मध्यम टमाटर, काटिएको",
      "- 1 चम्मच अदुवा-लसुनको पेस्ट",
      "- १ चम्चा बेसारको धुलो",
      "- 1 चम्चा जीरा धुलो",
      "- 1 चम्चा धनिया धुलो",
      "- १/२ चम्चा रातो खुर्सानीको धुलो (स्वाद अनुसार)",
      "- १/२ चम्चा गरम मसाला",
      "- स्वाद अनुसार नुन",
      "- गार्निसको लागि काटेको ताजा कोलिन्ट्रो (धनिया पात)",

      "निर्देशन:",
      "१. भिजेको किड्नी बीन्स पकाउनुहोस्:",
      "- प्रेसर कुकर वा ठूलो भाँडोमा भिजेको र निस्किएको किडनी बीन्स थप्नुहोस्।",
      "- सिमीहरू लगभग 2 इन्च ढाक्न पर्याप्त पानी थप्नुहोस्।",
      "- किडनी बीन्स नरम नभएसम्म पकाउनुहोस् र सजिलैसँग तपाइँको औंलाहरू बीच म्यास गर्न सकिन्छ। यो सामान्यतया प्रेसर कुकरमा 20-25 मिनेट वा नियमित भाँडामा बढी लाग्छ।",

      "2. आधार तयार गर्नुहोस्:",
      "- छुट्टै भाँडोमा तेल वा घिउलाई मध्यम तातोमा तताउनुहोस्।",
      "- जीरा थप्नुहोस् र तिनीहरूलाई टुक्रा दिनुहोस्।",
      "- मसिनो काटेको प्याज थप्नुहोस् र पारदर्शी र सुनौलो खैरो नभएसम्म पकाउनुहोस्।",

      "३. टमाटर र मसला थप्नुहोस्:",
      "- भाँडामा काटेको टमाटरहरू थप्नुहोस् र नरम नभएसम्म पकाउनुहोस्।",
      "- अदुवा-लसुनको पेस्टमा हाल्नुहोस् र काँचो गन्ध नआएसम्म पकाउनुहोस्।",
      "- बेसारको धुलो, जीराको धुलो, धनियाको धुलो, रातो खुर्सानीको धुलो र नुन थप्नुहोस्। मसला राम्ररी मिलाएर केही मिनेट पकाउनुहोस्।",

      "4. पकाएको बीन्स र आधार जोड्नुहोस्:",
      "- टमाटर र मसलाको मिश्रणको साथ भाँडोमा कुनै पनि बाँकी पकाउने तरल पदार्थको साथ पकाएको किडनी बीन्स थप्नुहोस्।",
      "- सबै चीजहरू एकसाथ मिलाउनुहोस् र यसलाई लगभग 10-15 मिनेटको लागि मध्यम-कम तापमा उमाल्नुहोस्, स्वादहरू मिल्न अनुमति दिनुहोस्।",

      "5. स्थिरता र मसला समायोजन गर्नुहोस्:",
      "- यदि राजमा धेरै बाक्लो छ भने, तपाइँ आफ्नो इच्छित स्थिरता प्राप्त गर्न केहि पानी थप्न सक्नुहुन्छ।",
      "- स्वाद गर्नुहोस् र मसला समायोजन गर्नुहोस्, आवश्यक भएमा थप नुन वा मसला थप्नुहोस्।",

      "6. गरम मसालासँग समाप्त गर्नुहोस्:",
      "- पकवानको स्वाद बढाउन गरम मसालामा हाल्नुहोस्।",
      "- राजमालाई थप २-३ मिनेटको लागि पकाउन दिनुहोस्।",

      "7. गार्निस र सर्भ:",
      "- राजमालाई काटेको ताजा सिलिन्ट्रो (धनिया पात) ले सजाउनुहोस्।",
      "- स्वादिष्ट राजमा तातो भात, रोटी, वा नान संग सेवा गर्नुहोस्।",

      "8. आनन्द लिनुहोस्:",
      "- मीठो र सन्तोषजनक भोजनको रूपमा धनी र स्वादिलो नेपाली शैलीको राजमाको आनन्द लिनुहोस्।",

      "नोट: तपाईं आफ्नो प्राथमिकता अनुसार मसाला र स्वाद पनि अनुकूलित गर्न सक्नुहुन्छ।"
    ]
  },
  {
    "title": "Aloo Tama ",
    "image": "images/allotama.png",
    "description": "Potato and bamboo shoot curry ",
    "steps": [
      "Ingredients:",
      "- 1 cup bamboo shoots (tama), soaked and sliced",
      "- 2 medium potatoes, peeled and diced",
      "- 2 tablespoons mustard oil",
      "- 1 teaspoon fenugreek seeds",
      "- 1 teaspoon cumin seeds",
      "- 1/2 teaspoon turmeric powder",
      "- 1 teaspoon red chili powder (adjust to taste)",
      "- 1 teaspoon cumin powder",
      "- 1 teaspoon coriander powder",
      "- 1 teaspoon minced ginger",
      "- 1 teaspoon minced garlic",
      "- 2-3 dried red chilies (whole)",
      "- Salt to taste",
      "- Chopped fresh cilantro (coriander leaves) for garnish",

      "Instructions:",
      "1. Prepare the Bamboo Shoots (Tama):",
      "- Soak the bamboo shoots in water overnight to soften them.",
      "- Drain and slice the bamboo shoots into thin pieces.",

      "2. Cook the Potatoes and Bamboo Shoots:",
      "- In a pot, bring water to a boil and add the diced potatoes.",
      "- Parboil the potatoes for about 5 minutes until they are partially cooked. Drain and set aside.",
      "- In the same pot, add the sliced bamboo shoots and parboil them for about 10 minutes. Drain and set aside.",

      "3. Sauté the Spices and Aromatics:",
      "- In a pan, heat mustard oil over medium heat until it reaches its smoking point. Let it cool slightly.",
      "- Add fenugreek seeds and cumin seeds. Let them splutter.",
      "- Add dried red chilies and sauté for a few seconds.",
      "- Add minced ginger and garlic. Sauté until fragrant.",

      "4. Add Spices and Vegetables:",
      "- Lower the heat and add turmeric powder, red chili powder, cumin powder, coriander powder, and salt. Mix the spices well.",
      "- Add the parboiled potatoes and sliced bamboo shoots to the pan. Stir to coat them with the spices and oil.",
      "- Cook the mixture for a few minutes, allowing the flavors to meld.",

      "5. Simmer and Finish Cooking:",
      "- Add a little water to the pan to create some gravy. Cover the pan and let the vegetables simmer until they are fully cooked and tender.",
      "- Stir occasionally to prevent sticking and burning.",

      "6. Garnish and Serve:",
      "- Once the potatoes and bamboo shoots are fully cooked and the flavors have developed, remove the pan from heat.",
      "- Garnish the Aloo Tama with chopped fresh cilantro (coriander leaves).",

      "7. Enjoy:",
      "- Serve the flavorful Aloo Tama hot with steamed rice or roti as a delicious and traditional Nepali dish.",

      "Note: Aloo Tama is known for its unique taste and texture combination. Adjust the spice levels according to your preference.",

      "Nepali :",

      "सामग्री:",
      "- १ कप बाँसको टुक्रा (तमा), भिजेको र काटिएको",
      "- २ वटा मध्यम आलु, छिलेको र काटेको",
      "- 2 चम्मच तोरीको तेल",
      "- 1 चम्चा मेथी दाना",
      "- १ चम्चा जीरा",
      "- १/२ चम्चा बेसारको धुलो",
      "- १ चम्चा रातो खुर्सानीको धुलो (स्वाद अनुसार)",
      "- 1 चम्चा जीरा धुलो",
      "- 1 चम्चा धनिया धुलो",
      "- १ चिया चम्चा अदुवा",
      "- 1 चम्चा केमा गरेको लसुन",
      "- २-३ सुकेको रातो खुर्सानी (पुरा)",
      "- स्वाद अनुसार नुन",
      "- गार्निसको लागि काटेको ताजा कोलिन्ट्रो (धनिया पात)",

      "निर्देशन:",
      "१. बाँसको टुक्रा (तम) तयार गर्नुहोस्):",
      "- बाँसका टुक्राहरूलाई नरम बनाउन रातभर पानीमा भिजाउनुहोस्।",
      "- बाँसका टुक्राहरू निकालेर पातलो टुक्रा पार्नुहोस्।",

      "2. आलु र बाँसको टुक्राहरू पकाउनुहोस्:",
      "- एउटा भाँडोमा, पानी उमाल्न ल्याउनुहोस् र काटेको आलु थप्नुहोस्।",
      "- आलुलाई आंशिक रूपमा पकाउन नपाउन्जेल करिब ५ मिनेटको लागि पकाउनुहोस्। निकास र अलग गर्नुहोस्।",
      "- एउटै भाँडामा, काटिएको बाँसको टुक्राहरू थप्नुहोस् र तिनीहरूलाई लगभग 10 मिनेटको लागि पकाउनुहोस्। निकास र अलग गर्नुहोस्।",

      "3. मसला र सुगन्धित साउट:",
      "- एउटा प्यानमा, तोरीको तेललाई धुम्रपान बिन्दुमा नपुगेसम्म मध्यम तातोमा तताउनुहोस्। यसलाई अलिकति चिसो हुन दिनुहोस्।",
      "- मेथीको दाना र जीरा थप्नुहोस्। तिनीहरूलाई टुक्रा पार्न दिनुहोस्।",
      "- सुकेको रातो खुर्सानी थप्नुहोस् र केहि सेकेन्डको लागि पकाउनुहोस्।",
      "- केमा पारेको अदुवा र लसुन थप्नुहोस्। सुगन्धित नभएसम्म पकाउनुहोस्।",

      "4. मसला र तरकारीहरू थप्नुहोस्:",
      "- तातो कम गर्नुहोस् र बेसारको धुलो, रातो खुर्सानीको धुलो, जीराको धुलो, धनियाको धुलो र नुन हाल्नुहोस्। मसला राम्ररी मिलाउनुहोस्।",
      "- प्यानमा उमालेको आलु र काटिएको बाँसको टुक्राहरू थप्नुहोस्। तिनीहरूलाई मसला र तेलले कोट गर्न हलचल गर्नुहोस्।",
      "- मिश्रणलाई केही मिनेटको लागि पकाउनुहोस्, स्वादहरू मिलाउन अनुमति दिनुहोस्।",

      "5. उमालेर पकाउने काम पूरा गर्नुहोस्:",
      "- अलिकति ग्रेभी बनाउन प्यानमा थोरै पानी थप्नुहोस्। प्यानलाई छोप्नुहोस् र तरकारीहरूलाई पूर्ण रूपमा पकाउन र नरम नभएसम्म उमालेर राख्नुहोस्।",
      "- टाँसिने र जल्नबाट बच्न कहिलेकाहीं हलचल।",

      "6. गार्निस र सर्भ:",
      "- एक पटक आलु र बाँसको टुक्राहरू पूर्ण रूपमा पकाएर र स्वादहरू विकसित भएपछि, तातोबाट प्यान हटाउनुहोस्।",
      "- आलु तामालाई काटेको ताजा सिलिन्ट्रो (धनिया पात) ले सजाउनुहोस्।",

      "7. आनन्द लिनुहोस्:",
      "- स्वादिष्ट र परम्परागत नेपाली परिकारको रूपमा पकाएको भात वा रोटीसँग तातो स्वादपूर्ण आलु तामा सेवा गर्नुहोस्।",

      "नोट: आलु तमा यसको अद्वितीय स्वाद र बनावट संयोजनको लागि परिचित छ। आफ्नो प्राथमिकता अनुसार मसला स्तर समायोजन गर्नुहोस्।"
    ]
  },
  {
    "title": "Bara ",
    "image": "images/bara.png",
    "description": "Lentil-based savory pancake",
    "steps": [
      "Ingredients for Baara:",
      "- 1 cup black-eyed peas (lobia), soaked overnight and drained",
      "- 1/2 cup green mung beans, soaked overnight and drained",
      "- 2-3 green chilies, chopped",
      "- 1 tablespoon minced ginger",
      "- 1 teaspoon cumin seeds",
      "- 1 teaspoon turmeric powder",
      "- Salt to taste",
      "- Oil for frying",

      "Ingredients for Yoghurt Sauce (Dahi):",
      "- 1 cup plain yogurt (curd)",
      "- 1/2 cup chopped fresh cilantro (coriander leaves)",
      "- 1/2 teaspoon roasted cumin powder",
      "- Salt to taste",

      "Ingredients for Garnish:",
      "- Chopped fresh cilantro (coriander leaves)",
      "- Chopped fresh green onions",

      "Instructions for Baara:",
      "1. Blend the Lentils:",
      "- In a blender, combine the soaked black-eyed peas, green mung beans, chopped green chilies, minced ginger, and cumin seeds.",
      "- Blend the mixture to a coarse paste. You can add a little water if needed, but the batter should be thick and not too watery.",
      "- Transfer the batter to a mixing bowl and add turmeric powder and salt. Mix well.",

      "2. Fry the Baara:",
      "- In a deep pan or pot, heat oil for frying over medium heat.",
      "- Once the oil is hot, take spoonfuls of the batter and drop them into the hot oil to form small round discs.",
      "- Fry the baara until they are golden brown and crispy on both sides. Remove them from the oil and place them on paper towels to drain excess oil.",

      "Instructions for Yoghurt Sauce (Dahi):",
      "1. Prepare the Yoghurt Sauce:",
      "- In a bowl, whisk plain yogurt until smooth.",
      "- Add chopped fresh cilantro, roasted cumin powder, and salt. Mix well to combine.",
      "- Adjust the seasoning to taste.",

      "Instructions for Serving Baara:",
      "1. Serve Baara:",
      "- Arrange the fried baara on a serving plate.",
      "- Drizzle the prepared yoghurt sauce (dahi) over the baara.",
      "- Garnish with chopped fresh cilantro and green onions.",

      "2. Enjoy:",
      "- Enjoy the delicious and crispy baara with the refreshing yoghurt sauce as a delightful Nepali snack or appetizer.",

      "Nepali :",
      "बाराका लागि सामग्री:",
      "- 1 कप कालो आँखा मटर (लोबिया), रातभर भिजाएर र नाली",
      "- 1/2 कप हरियो मुग, रातभर भिजाएर र नाली",
      "2-3 हरियो खुर्सानी, काटिएको",
      "- 1 चम्चा केमा अदुवा",
      "- १ चम्चा जीरा",
      "- १ चम्चा बेसारको धुलो",
      "- स्वाद अनुसार नुन",
      "तलाउनको लागि तेल",

      "दही चटनी (दही) को लागि सामग्री):",
      "- 1 कप सादा दही (दही)",
      "- 1/2 कप कटा ताजा कोलिन्ट्रो (धनिया पात)",
      "- १/२ चम्चा भुटेको जीराको धुलो",
      "- स्वाद अनुसार नुन",

      "गार्निशका लागि सामग्री:",
      "- काटेको ताजा सिलिन्ट्रो (धनिया पात)",
      "- काटेको ताजा हरियो प्याज",

      "बाराको लागि निर्देशन:",
      "१. दाल मिलाउनुहोस्:",
      "- ब्लेन्डरमा भिजेको कालो मटर, हरियो मुग, काटेको हरियो खुर्सानी, अदुवाको दाना र जीरा मिलाउनुहोस्।",
      "- मिश्रणलाई मोटो पेस्टमा मिसाउनुहोस्। यदि आवश्यक भएमा थोरै पानी थप्न सक्नुहुन्छ, तर ब्याटर बाक्लो हुनुपर्छ र धेरै पानी नहोस्।",
      "- ब्याटरलाई मिक्सिङ कचौरामा सार्नुहोस् र बेसारको धुलो र नुन थप्नुहोस्। राम्रोसँग मिलाउनुहोस्।",

      "२. बारा फ्राइ:",
      "- गहिरो प्यान वा भाँडोमा, मध्यम तातोमा फ्राइ गर्नको लागि तेल तताउनुहोस्।",
      "- तेल तातो भएपछि, एक चम्चा ब्याटर लिनुहोस् र तिनीहरूलाई तातो तेलमा छोड्नुहोस् र सानो गोल डिस्क बनाउनुहोस्।",
      "- बारालाई सुनौलो खैरो र दुबै तिर क्रिस्पी नभएसम्म भुने। तिनीहरूलाई तेलबाट हटाउनुहोस् र थप तेल निकाल्न कागजको तौलियामा राख्नुहोस्।",

      "दही सॉस (दही) को लागि निर्देशनहरू:",
      "1. दहीको चटनी तयार गर्नुहोस्:",
      "- एउटा कचौरामा, सादा दहीलाई चिल्लो नभएसम्म फ्याँक्नुहोस्।",
      "- काटेको ताजा कोलिन्ट्रो, भुटेको जीराको धुलो र नुन थप्नुहोस्। मिश्रण गर्न राम्रोसँग मिलाउनुहोस्।",
      "- स्वाद अनुसार मसला मिलाउनुहोस्।",

      "बारा सेवा गर्न निर्देशन:",
      "१. बारा सेवा गर्नुहोस्:",
      "- फ्राइड बारालाई सर्विङ प्लेटमा मिलाउनुहोस्।",
      "- बारामा तयार भएको दहीको चटनी (दही) छोप्नुहोस्।",
      "- काटेको ताजा सिलिन्ट्रो र हरियो प्याजले गार्निस गर्नुहोस्।",

      "२. आनन्द लिनुहोस्:",
      "- स्वादिष्ट र क्रिस्पी बाराको आनन्द लिनुहोस् रमाईलो नेपाली खाजा वा भोकको रूपमा ताजा दहीको चटनीसँग।"
    ]
  },
  {
    "title": "Pakku ",
    "image": "images/pakku.png",
    "description": "Fried rice flour bread",
    "steps": [
      "Ingredients:",
      "- 2 cups rice flour",
      "- Water (approximately 1 to 1.5 cups)",
      "- 1 cup jaggery (gur) or brown sugar, grated",
      "- 1/2 teaspoon cardamom powder",
      "- A pinch of salt",
      "- Oil or ghee (clarified butter) for frying",

      "Instructions:",
      "1. Prepare the Dough:",
      "- In a mixing bowl, add the rice flour and a pinch of salt.",
      "- Gradually add water while mixing to form a smooth and soft dough. The dough should be pliable but not too sticky.",

      "2. Shape the Sweet Pakku:",
      "- Divide the dough into small portions and roll them into smooth balls.",
      "- Take one dough ball and flatten it with your hands to form a thin, round disc. You can also use a rolling pin to flatten it on a clean surface.",

      "3. Add Sweetness:",
      "- In a separate bowl, combine the grated jaggery (or brown sugar) and cardamom powder to create a sweet mixture.",
      "- Place a spoonful of the sweet mixture in the center of each flattened dough disc.",

      "4. Fold and Seal:",
      "- Carefully fold the edges of the dough disc over the sweet mixture to enclose it.",
      "- Press the edges to seal the sweet filling inside the dough.",

      "5. Fry the Sweet Pakku:",
      "- In a pan, heat oil or ghee over medium heat for frying.",
      "- Carefully place the filled and folded dough disc into the hot oil.",
      "- Fry the Sweet Pakku until it turns golden brown on both sides.",
      "- Once fried, remove the Sweet Pakku from the oil and place it on paper towels to drain excess oil.",

      "6. Repeat for Remaining Dough:",
      "- Repeat the frying process with the remaining dough portions, frying each Sweet Pakku individually.",
      "- Make sure the oil temperature remains consistent for each batch to achieve even frying.",

      "7. Serve Sweet Pakku:",
      "- Serve the freshly fried Sweet Pakku as a sweet and delightful snack or dessert.",

      "8. Enjoy:",
      "- Enjoy the crispy, sweet, and aromatic flavors of Sweet Pakku, a traditional Nepali treat.",

      "Nepali :",

      "सामग्री:",
      "- २ कप चामलको पीठो",
      "- पानी (लगभग 1 देखि 1.5 कप)",
      "- 1 कप गुड़ (गुड़) वा ब्राउन शुगर, ग्रेटेड",
      "- 1/2 चम्चा अलैंची धुलो",
      "- एक चुटकी नुन",
      "तलाउनको लागि तेल वा घ्यू (स्पष्ट मक्खन)",

      "निर्देशन:",
      "1. आटा तयार गर्नुहोस्:",
      "- एक मिश्रण कचौरा मा, चामलको पीठो र एक चुटकी नुन थप्नुहोस्।",
      "- एक चिल्लो र नरम आटा बनाउन को लागी बिस्तारै पानी थप्नुहोस्। पीठो कोमल हुनुपर्छ तर धेरै टाँसिने छैन।",

      "२. मीठो पक्कुलाई आकार दिनुहोस्:",
      "- आटालाई सानो भागमा विभाजन गर्नुहोस् र तिनीहरूलाई चिल्लो बलहरूमा घुमाउनुहोस्।",
      "- एउटा आटाको बल लिनुहोस् र यसलाई आफ्नो हातले पातलो, गोलाकार डिस्क बनाउनको लागि सपाट गर्नुहोस्। तपाईंले यसलाई सफा सतहमा समतल गर्न रोलिङ पिन पनि प्रयोग गर्न सक्नुहुन्छ।",

      "3. मिठास थप्नुहोस्:",
      "- छुट्टै कचौरामा, पिसेको गुड़ (वा ब्राउन शुगर) र अलैंचीको धुलो मिलाएर मीठो मिश्रण बनाउनुहोस्।",
      "- प्रत्येक समतल आटा डिस्कको बीचमा एक चम्चा मीठो मिश्रण राख्नुहोस्।",

      "4. फोल्ड र सिल:",
      "- आटा डिस्कको किनाराहरूलाई मिठाईको मिश्रणमा ध्यानपूर्वक फोल्ड गर्नुहोस् यसलाई घेर्नुहोस्।",
      "- आटा भित्रको मीठो भराईलाई बन्द गर्न किनारहरू थिच्नुहोस्।",

      "5. मीठो पक्कु फ्राइ:",
      "- एक प्यानमा, तेल वा घिउलाई मध्यम तातोमा फ्राइ गर्नको लागि तताउनुहोस्।",
      "- तातो तेलमा भरिएको र फोल्ड गरिएको आटा डिस्कलाई ध्यानपूर्वक राख्नुहोस्।",
      "- मीठो पक्कुलाई दुबै तर्फ सुनौलो खैरो नहोउन्जेल फ्राइ गर्नुहोस्।",
      "- फ्राइ भएपछि, तेलबाट मीठो पक्कु हटाउनुहोस् र थप तेल निकाल्न पेपर तौलियामा राख्नुहोस्।",

      "6. बाँकी आटाको लागि दोहोर्याउनुहोस्:",
      "- प्रत्येक मिठाई पक्कुलाई छुट्टाछुट्टै फ्राइ गरेर बाँकी पीठो भागहरूसँग फ्राइङ प्रक्रिया दोहोर्याउनुहोस्।",
      "- पक्का गर्नुहोस् कि तेलको तापक्रम पनि फ्राइङ प्राप्त गर्न प्रत्येक ब्याचको लागि समान रहन्छ।",

      "७. मीठो पक्कु परोस:",
      "- ताजा भुटेको मीठो पक्कुलाई मीठो र रमाइलो खाजा वा मिठाईको रूपमा सेवा गर्नुहोस्।",

      "8. आनन्द लिनुहोस्:",
      "- मिठाई पक्कुको क्रिस्पी, मीठो र सुगन्धित स्वादको मजा लिनुहोस्, एक परम्परागत नेपाली उपचार।"
    ]
  },
  {
    "title": "Samosa ",
    "image": "images/samosa.png",
    "description": "Fried pastry filled with spiced potatoes",
    "steps": [
      "Ingredients for Samosa Dough:",
      "- 2 cups all-purpose flour",
      "- 1/4 cup oil or ghee (clarified butter)",
      "- 1/2 teaspoon carom seeds (ajwain)",
      "- 1/2 teaspoon salt",
      "- Water (as needed)",

      "Ingredients for Samosa Filling:",
      "- 2 cups boiled and diced potatoes",
      "- 1/2 cup boiled green peas",
      "- 1 tablespoon oil",
      "- 1 teaspoon cumin seeds",
      "- 1 teaspoon grated ginger",
      "- 1 teaspoon minced green chili (adjust to taste)",
      "- 1/2 teaspoon turmeric powder",
      "- 1 teaspoon ground coriander",
      "- 1 teaspoon garam masala",
      "- Salt to taste",
      "- Chopped fresh cilantro (coriander leaves) for garnish",

      "Ingredients for Frying:",
      "- Oil for deep frying",

      "Instructions for Samosa Dough:",
      "1. Prepare the Dough:",
      "- In a mixing bowl, combine all-purpose flour, carom seeds, and salt.",
      "- Add oil or ghee and mix until the mixture resembles breadcrumbs.",
      "- Gradually add water and knead to form a smooth and firm dough.",
      "- Cover the dough with a damp cloth and let it rest for 20-30 minutes.",

      "Instructions for Samosa Filling:",
      "1. Prepare the Filling:",
      "- Heat oil in a pan over medium heat.",
      "- Add cumin seeds and let them splutter.",
      "- Add grated ginger and minced green chili. Sauté for a minute.",
      "- Add turmeric powder, ground coriander, and garam masala. Mix well.",
      "- Add boiled and diced potatoes and boiled green peas. Mash the mixture slightly with a spatula.",
      "- Add salt to taste and chopped fresh cilantro. Mix until well combined.",
      "- Let the filling cool before using it for the samosas.",

      "Instructions for Making Samosas:",
      "1. Shape the Samosas:",
      "- Divide the dough into equal portions and roll them into smooth balls.",
      "- Roll out each ball into a thin oval shape, about 6-7 inches long.",
      "- Cut the oval in half to form two semi-circles.",

      "2. Fill and Fold the Samosas:",
      "- Take one semi-circle and fold it into a cone shape, sealing the edges with water to form a cone.",
      "- Fill the cone with the prepared potato and pea filling.",
      "- Apply water along the edges of the cone and press to seal the samosa.",

      "3. Fry the Samosas:",
      "- In a deep pan or pot, heat oil for frying over medium heat.",
      "- Once the oil is hot, gently slide the filled samosas into the oil.",
      "- Fry the samosas until they are golden brown and crispy on all sides.",
      "- Remove the fried samosas and place them on paper towels to drain excess oil.",

      "4. Serve Samosas:",
      "- Serve the hot and crispy samosas with chutney or sauce of your choice.",

      "5. Enjoy:",
      "- Enjoy the delicious and savory Nepali samosas as a popular snack or appetizer.",

      "Nepali :",

      "समोसाको आटाको लागि सामग्री:",
      "- २ कप सबै उद्देश्यको पीठो",
      "- 1/4 कप तेल वा घिउ (स्पष्ट मक्खन)",
      "- 1/2 चम्चा क्यारम बीउ (अजवाइन)",
      "- १/२ चम्चा नुन",
      "- पानी (आवश्यकता अनुसार)",

      "समोसा भर्ने सामग्री:",
      "- २ कप उमालेको र काटेको आलु",
      "- १/२ कप उमालेको हरियो मटर",
      "- 1 चम्मच तेल",
      "- १ चम्चा जीरा",
      "- 1 चिया चम्चा पिसेको अदुवा",
      "- १ चम्चा हरियो खुर्सानी (स्वाद अनुसार)",
      "- १/२ चम्चा बेसारको धुलो",
      "- 1 चम्चा पिसे धनिया",
      "- १ चम्चा गरम मसाला",
      "- स्वाद अनुसार नुन",
      "- गार्निसको लागि काटेको ताजा कोलिन्ट्रो (धनिया पात)",

      "फ्राइङका लागि सामग्री:",
      "- गहिरो फ्राइको लागि तेल",

      "समोसा आटाको लागि निर्देशन:",
      "1. आटा तयार गर्नुहोस्:",
      "- एक मिक्सिङ कटोरामा, सबै उद्देश्यको पीठो, क्यारमको दाना र नुन मिलाउनुहोस्।",
      "- तेल वा घिउ थप्नुहोस् र मिश्रण ब्रेडक्रम्ब्स जस्तो नहोउन्जेल मिलाउनुहोस्।",
      "- बिस्तारै पानी थप्नुहोस् र एक चिल्लो र बलियो आटा बनाउन को लागी मुन्नुहोस्।",
      "- आटालाई ओसिलो कपडाले छोप्नुहोस् र २०-३० मिनेटसम्म आराम गर्न दिनुहोस्।",

      "समोसा भर्ने निर्देशन:",
      "1. भर्ने तयारी गर्नुहोस्:",
      "- एउटा प्यानमा तेललाई मध्यम तातोमा तताउनुहोस्।",
      "- जीरा थप्नुहोस् र तिनीहरूलाई टुक्रा दिनुहोस्।",
      "- पिसेको अदुवा र हरियो खुर्सानी थप्नुहोस्। एक मिनेटको लागि पकाउनुहोस्।",
      "- बेसारको धुलो, धनियाँ र गरम मसाला हाल्नुहोस्। राम्ररी मिलाउनुहोस्।",
      "- उमालेको र काटेको आलु र उमालेको हरियो मटर जोड्नुहोस्। मिश्रणलाई स्प्याटुलाले थोरै मासु दिनुहोस्।",
      "- स्वाद अनुसार नुन र काटिएको ताजा कोलिन्ट्रो जोड्नुहोस्। राम्ररी नमिल्दा सम्म मिलाउनुहोस्।",
      "- समोसाको लागि प्रयोग गर्नु अघि भराईलाई चिसो हुन दिनुहोस्।",

      "समोसा बनाउन निर्देशन:",
      "१. समोसलाई आकार दिनुहोस्:",
      "- आटालाई बराबर भागमा विभाजन गर्नुहोस् र तिनीहरूलाई चिल्लो बलहरूमा घुमाउनुहोस्।",
      "- प्रत्येक बललाई पातलो अंडाकार आकारमा रोल आउट गर्नुहोस्, लगभग 6-7 इन्च लामो।",
      "- दुई अर्ध-वृत्त बनाउनको लागि अंडाकारलाई आधामा काट्नुहोस्।",

      "2. समोसहरू भर्नुहोस् र फोल्ड गर्नुहोस्:",
      "- एउटा अर्ध-वृत्त लिनुहोस् र यसलाई शंकुको आकारमा फोल्ड गर्नुहोस्, किनाराहरूलाई पानीले सिल गरेर शंकु बनाउनुहोस्।",
      "- तयार भएको आलु र मटर भरेर कोन भर्नुहोस्।",
      "- कोनको किनारमा पानी लगाउनुहोस् र समोसा सील गर्न थिच्नुहोस्।",

      "३. समोसे फ्राइ गर्नुहोस्:",
      "- गहिरो प्यान वा भाँडोमा, मध्यम तातोमा फ्राइ गर्नको लागि तेल तताउनुहोस्।",
      "- तेल तातो भएपछि, भरिएको समोसालाई बिस्तारै तेलमा फ्याँक्नुहोस्।",
      "- समोसाहरू सुनौलो खैरो र चारैतिर क्रिस्पी नभएसम्म फ्राइ गर्नुहोस्।",
      "- भुटेको समोसाहरू हटाउनुहोस् र कागजको तौलियामा थप तेल निकाल्नुहोस्।",

      "4. समोसे सर्भ गर्नुहोस्:",
      "- तातो र क्रिस्पी समोसालाई आफ्नो मनपर्ने चटनी वा चटनी संग सेवा गर्नुहोस्।",

      "5. आनन्द लिनुहोस्:",
      "- एक लोकप्रिय खाजा वा भोकको रूपमा स्वादिष्ट र स्वादिष्ट नेपाली समोसाको आनन्द लिनुहोस्।"
    ]
  },
  {
    "title": "Roti ",
    "image": "images/roti.png",
    "description": "Flatbread",
    "steps": [
      "Ingredients:",
      "- 2 cups whole wheat flour",
      "- Water (as needed)",
      "- Salt to taste",
      "- Ghee or oil (for cooking)",

      "Instructions:",
      "1. Prepare the Dough:",
      "- In a mixing bowl, add whole wheat flour and a pinch of salt.",
      "- Gradually add water while kneading to form a soft and pliable dough.",
      "- Knead the dough for a few minutes until it's smooth and elastic.",
      "- Cover the dough with a damp cloth and let it rest for about 15-20 minutes to relax the gluten.",

      "2. Divide and Shape the Dough:",
      "- Divide the rested dough into small golf ball-sized portions.",
      "- Roll each portion between your palms to form smooth balls.",

      "3. Roll and Cook the Rotis:",
      "- Heat a tawa (flat griddle) or a non-stick pan over medium heat.",
      "- Take one dough ball and flatten it slightly.",
      "- Roll out the dough ball into a thin, round circle using a rolling pin and some dry flour for dusting.",
      "- Place the rolled roti on the heated tawa and cook until you see bubbles forming on the surface.",

      "4. Flip and Cook the Other Side:",
      "- Once you see bubbles, flip the roti to the other side using a spatula.",
      "- Cook the second side for a few seconds until light brown spots appear.",

      "5. Apply Ghee or Oil:",
      "- Brush a little ghee or oil over the cooked side of the roti.",
      "- Flip the roti again and press down gently with a spatula to cook the ghee/oil side.",

      "6. Serve Roti:",
      "- Once both sides are cooked and have golden brown spots, remove the roti from the tawa.",
      "- Place the roti on a plate and cover it with a clean cloth to keep it warm.",
      "- Repeat the process with the remaining dough portions to make more rotis.",

      "7. Enjoy:",
      "- Serve the hot and freshly cooked rotis with your choice of curries, vegetables, or chutneys.",
      "- Roti is a versatile accompaniment and a staple in Nepali meals.",

      "Nepali :",

      "सामग्री:",
      "- २ कप गहुँको पिठो",
      "- पानी (आवश्यकता अनुसार)",
      "- स्वाद अनुसार नुन",
      "- घिउ वा तेल (पकाउनको लागि)",

      "निर्देशन:",
      "1. आटा तयार गर्नुहोस्:",
      "- एक मिक्सिङ कचौरा मा, पुरा गहुँको पीठो र एक चुटकी नुन थप्नुहोस्।",
      "- नरम र लचिलो पीठो बनाउन बिस्तारै पानी हाल्नुहोस्।",
      "- चिल्लो र लोचदार नभएसम्म केही मिनेटको लागि पीठो मुछ्नुहोस्।",
      "- आटालाई ओसिलो कपडाले छोप्नुहोस् र ग्लुटेनलाई आराम गर्न लगभग 15-20 मिनेटको लागि आराम गर्नुहोस्।",

      "2. आटालाई विभाजित गर्नुहोस् र आकार दिनुहोस्:",
      "- विश्राम गरिएको आटालाई सानो गल्फ बल आकारका भागहरूमा विभाजन गर्नुहोस्।",
      "- चिल्लो बलहरू बनाउन आफ्नो हत्केलाहरू बीचको प्रत्येक भाग घुमाउनुहोस्।",

      "३. रोटीहरू रोल गर्नुहोस् र पकाउनुहोस्:",
      "- तवा (फ्लैट ग्रिडल) वा नन-स्टिक प्यानलाई मध्यम तातोमा तताउनुहोस्।",
      "- एउटा आटाको बल लिनुहोस् र यसलाई अलिकति समतल गर्नुहोस्।",
      "- आटाको बललाई रोलिङ पिन र केही सुख्खा पीठो प्रयोग गरी पातलो, गोलो घेरामा घुमाउनुहोस्।",
      "- रोटी रोटीलाई तातो तवामा राख्नुहोस् र सतहमा बुलबुले नदेखिएसम्म पकाउनुहोस्।",

      "4. फ्लिप गर्नुहोस् र अर्को पक्ष पकाउनुहोस्:",
      "- तपाईंले बुलबुले देखेपछि, स्प्याटुला प्रयोग गरेर रोटीलाई अर्को तिर पल्टाउनुहोस्।",
      "- हल्का खैरो दाग नदेखिएसम्म दोस्रो पक्षलाई केही सेकेन्डका लागि पकाउनुहोस्।",

      "५. घिउ वा तेल लगाउनुहोस्:",
      "- रोटीको छेउमा अलिकति घिउ वा तेल माझ्नुहोस्।",
      "- रोटीलाई फेरि पल्टाउनुहोस् र घिउ/तेल साइड पकाउनको लागि स्प्याटुलाले बिस्तारै थिच्नुहोस्।",

      "6. रोटी सेवा गर्नुहोस्:",
      "- दुबै छेउ पकाएर सुनौलो खैरो दाग भएपछि, रोटीलाई तवाबाट निकाल्नुहोस्।",
      "- रोटीलाई प्लेटमा राख्नुहोस् र यसलाई न्यानो राख्न सफा कपडाले छोप्नुहोस्।",
      "- थप रोटीहरू बनाउनको लागि बाँकी आटा भागहरूसँग प्रक्रिया दोहोर्याउनुहोस्।",

      "7. आनन्द लिनुहोस्:",
      "- तातो र ताजा पकाएको रोटीहरू तपाइँको करी, तरकारी वा चटनीको साथमा सेवा गर्नुहोस्।",
      "- रोटी एक बहुमुखी संगत हो र नेपाली खाना मा एक प्रमुख हो।"
    ]
  },
  {
    "title": "Phapar ",
    "image": "images/phafar.png",
    "description": "Spicy buckwheat pancakes",
    "steps": [
      "Ingredients:",
      "- 2 cups buckwheat flour",
      "- Water (approximately 2 to 2.5 cups)",
      "- Salt to taste",
      "- Oil or ghee (clarified butter) for cooking",

      "Instructions:",
      "1. Prepare the Batter:",
      "- In a mixing bowl, add buckwheat flour and a pinch of salt.",
      "- Gradually add water while mixing to form a smooth batter. The batter should be thin, similar to the consistency of dosa or crepe batter.",
      "- Whisk the batter thoroughly to remove any lumps.",

      "2. Heat the Tawa (Griddle):",
      "- Heat a tawa (flat griddle) or a non-stick pan over medium heat.",
      "- Lightly grease the tawa with oil or ghee to prevent sticking.",

      "3. Pour and Spread the Batter:",
      "- Take a ladleful of the prepared batter and pour it onto the center of the hot tawa.",
      "- Quickly spread the batter in a circular motion to form a thin, round pancake. Aim for a size similar to that of a dosa or crepe.",

      "4. Cook the Phaphar:",
      "- Allow the phaphar to cook for a couple of minutes until the edges start to lift and the bottom turns golden brown.",
      "- Drizzle a small amount of oil or ghee around the edges to enhance the flavor.",

      "5. Flip and Cook the Other Side:",
      "- Gently flip the phaphar using a spatula.",
      "- Cook the other side for another couple of minutes until it's golden brown and cooked through.",

      "6. Serve Phaphar:",
      "- Once both sides are cooked and display a nice golden color, transfer the phaphar to a plate.",
      "- Fold the phaphar in half or roll it up, as preferred.",

      "7. Enjoy:",
      "- Serve the freshly cooked phaphar with a side of achar (pickles), yogurt, or any preferred accompaniments.",
      "- Phaphar is a cherished Nepali dish, offering a simple and flavorful meal option.",

      "Nepali :",
      "सामग्री:",
      "- २ कप गहुँको पीठो",
      "- पानी (लगभग २ देखि २.५ कप)",
      "- स्वाद अनुसार नुन",
      "- खाना पकाउनको लागि तेल वा घ्यू (स्पष्ट मक्खन)",

      "निर्देशन:",
      "१. ब्याटर तयार गर्नुहोस्:",
      "- एक मिश्रण कचौरा मा, अनाजको पीठो र एक चुटकी नुन थप्नुहोस्।",
      "- एक चिल्लो ब्याटर बनाउन बिस्तारै पानी थप्नुहोस्। ब्याटर पातलो हुनुपर्छ, डोसा वा क्रेप ब्याटरको स्थिरता जस्तै।",
      "- कुनै पनि गाँठो हटाउनको लागि ब्याटरलाई राम्ररी हिलाउनुहोस्।",

      "2. तवा (ग्रिडल) तताउनुहोस्):",
      "- तवा (फ्लैट ग्रिडल) वा नन-स्टिक प्यानलाई मध्यम तातोमा तताउनुहोस्।",
      "- टाँस नपरोस् भनेर तवालाई तेल वा घिउले हल्का पिसाउनुहोस्।",

      "३. पिठो खन्याउनुहोस् र फैलाउनुहोस्:",
      "- तयार गरिएको ब्याटरको एक थोपा लिनुहोस् र यसलाई तातो तवाको बीचमा खन्याउनुहोस्।",
      "- पातलो, गोलो प्यानकेक बनाउनको लागि ब्याटरलाई गोलाकार गतिमा तुरुन्तै फैलाउनुहोस्। डोसा वा क्रेप जस्तै आकारको लागि लक्ष्य राख्नुहोस्।",

      "४. फाफर पकाउनुहोस्:",
      "- फाफरलाई केही मिनेटसम्म पकाउन दिनुहोस् जबसम्म किनाराहरू उठ्न थाले र तल सुनौलो खैरो नहोस्।",
      "- स्वाद बढाउन किनारा वरिपरि थोरै मात्रामा तेल वा घिउ छर्ने।",

      "5. फ्लिप र अर्को पक्ष पकाउनुहोस्:",
      "- स्प्याटुला प्रयोग गरेर बिस्तारै फाफर पल्टाउनुहोस्।",
      "- सुनौलो खैरो नहोउन्जेल अर्को दुई मिनेटको लागि पकाउनुहोस्।",

      "6. फाफर सेवा गर्नुहोस्:",
      "- दुवै पक्ष पकाएर राम्रो सुनौलो रङ देखाइ सकेपछि, फाफरलाई प्लेटमा सार्नुहोस्।",
      "- फाफरलाई आधामा फोल्ड गर्नुहोस् वा यसलाई मनपर्ने रूपमा घुमाउनुहोस्।",

      "7. आनन्द लिनुहोस्:",
      "- ताजा पकाएको फाफरलाई अचारको छेउमा (अचार), दही, वा कुनै मनपर्ने साथीहरूसँग सेवा गर्नुहोस्।",
      "- फाफर एउटा मनपर्ने नेपाली परिकार हो, जसले सरल र स्वादिलो खानाको विकल्प प्रदान गर्दछ।"
    ]
  },
  {
    "title": "Tarkari ",
    "image": "images/tarkari.png",
    "description": "Mixed vegetable curry , which is daily dish of nepal",
    "steps": [
      "Ingredients for Tarkari:",
      "- Assorted seasonal vegetables (e.g., potatoes, carrots, cauliflower, green beans, peas, etc.), chopped",
      "- 1 medium onion, finely chopped",
      "- 2 medium tomatoes, chopped",
      "- 1 tablespoon oil or ghee (clarified butter)",
      "- 1 teaspoon cumin seeds",
      "- 1 teaspoon turmeric powder",
      "- 1 teaspoon cumin powder",
      "- 1 teaspoon coriander powder",
      "- 1/2 teaspoon red chili powder (adjust to taste)",
      "- Salt to taste",
      "- Chopped fresh cilantro (coriander leaves) for garnish",

      "Instructions for Tarkari:",
      "1. Sauté the Aromatics:",
      "- In a pot or pan, heat oil or ghee over medium heat.",
      "- Add cumin seeds and let them splutter.",
      "- Add finely chopped onion and sauté until it turns translucent and golden brown.",

      "2. Add Tomatoes and Spices:",
      "- Add chopped tomatoes to the pot and cook until they soften.",
      "- Stir in turmeric powder, cumin powder, coriander powder, red chili powder, and salt. Mix the spices well and cook for a few minutes.",

      "3. Add Vegetables and Water:",
      "- Add the chopped assorted vegetables to the pot. Mix them well with the spices.",
      "- Add enough water to cover the vegetables partially. The amount of water will depend on the desired consistency of the curry.",

      "4. Simmer and Cook:",
      "- Cover the pot and let the vegetables cook over medium-low heat until they are tender. Stir occasionally to prevent sticking.",
      "- If needed, you can add more water during cooking to maintain the desired gravy consistency.",

      "5. Adjust Seasoning:",
      "- Taste the curry and adjust the seasoning by adding more salt or spices if necessary.",

      "6. Garnish and Serve:",
      "- Once the vegetables are cooked and the flavors have melded, remove the pot from heat.",
      "- Garnish the tarkari with chopped fresh cilantro (coriander leaves).",

      "7. Enjoy:",
      "- Serve the flavorful tarkari hot with steamed rice, roti, or another choice of accompaniments.",
      "- Tarkari can be customized with different vegetables and spices according to your preference.",

      "Nepali :",

      "तरकारीका लागि सामग्री:",
      "- विभिन्न मौसमी तरकारीहरू (जस्तै, आलु, गाजर, काउली, हरियो सिमी, मटर, आदि), काटिएको",
      "- १ मध्यम प्याज, बारीक काटिएको",
      "- २ मध्यम टमाटर, काटिएको",
      "- १ चम्चा तेल वा घिउ (स्पष्ट मक्खन)",
      "- १ चम्चा जीरा",
      "- १ चम्चा बेसारको धुलो",
      "- 1 चम्चा जीरा धुलो",
      "- 1 चम्चा धनिया धुलो",
      "- १/२ चम्चा रातो खुर्सानीको धुलो (स्वाद अनुसार)",
      "- स्वाद अनुसार नुन",
      "- गार्निसको लागि काटेको ताजा कोलिन्ट्रो (धनिया पात)",

      "तरकारीको लागि निर्देशन:",
      "१. अरोमेटिक्स साउट:",
      "- भाँडो वा प्यानमा, तेल वा घिउलाई मध्यम तातोमा तताउनुहोस्।",
      "- जीरा थप्नुहोस् र तिनीहरूलाई टुक्रा दिनुहोस्।",
      "- मसिनो काटेको प्याज थप्नुहोस् र पारदर्शी र सुनौलो खैरो नभएसम्म पकाउनुहोस्।",

      "2. टमाटर र मसला थप्नुहोस्:",
      "- भाँडामा काटेको टमाटरहरू थप्नुहोस् र नरम नभएसम्म पकाउनुहोस्।",
      "- बेसारको धुलो, जीराको धुलो, धनियाको धुलो, रातो खुर्सानीको धुलो र नुनमा हाल्नुहोस्। मसलालाई राम्ररी मिलाएर केही मिनेट पकाउनुहोस्।",

      "३. तरकारी र पानी थप्नुहोस्:",
      "- भाँडामा काटिएका बिभिन्न तरकारीहरू थप्नुहोस्। तिनीहरूलाई मसलासँग राम्ररी मिलाउनुहोस्।",
      "- तरकारीहरू आंशिक रूपमा छोप्न पर्याप्त पानी थप्नुहोस्। पानीको मात्रा करीको इच्छित स्थिरतामा निर्भर हुनेछ।",

      "4. सिमर र पकाउनुहोस्:",
      "- भाँडो छोप्नुहोस् र तरकारीहरू नरम नभएसम्म मध्यम-कम तातोमा पकाउन दिनुहोस्। टाँसिने रोक्नको लागि कहिलेकाहीं हलचल गर्नुहोस्।",
      "- यदि आवश्यक भएमा, तपाईले खाना पकाउने क्रममा थप पानी थप्न सक्नुहुन्छ इच्छित ग्रेभी स्थिरता कायम राख्न।",

      "5. मसला समायोजन गर्नुहोस्:",
      "- करीको स्वाद लिनुहोस् र आवश्यक भएमा थप नुन वा मसला थपेर मसला मिलाउनुहोस्।",

      "6. गार्निस र सर्भ:",
      "- तरकारी पाकिसकेपछि र स्वादहरू मिलिसकेपछि, भाँडोलाई तातोबाट हटाउनुहोस्।",
      "- तरकारीलाई काटेको ताजा कोलिन्ट्रो (धनिया पात) ले सजाउनुहोस्।",

      "7. आनन्द लिनुहोस्:",
      "- स्वादिलो तरकारीलाई तातो भात, रोटी वा अन्य छनोटको साथमा सर्भ गर्नुहोस्।",
      "- तरकारीलाई आफ्नो रुची अनुसार विभिन्न तरकारी र मसलासँग मिलाउन सकिन्छ।"
    ]
  },
  {
    "title": "Veg Momo",
    "image": "images/vegmomo.png",
    "description": "Vegetables Filled Dumplings",
    "steps": [
      "Ingredients for Veg Momos:",
      "- For the Dough:",
      "  - 2 cups all-purpose flour",
      "  - Water (as needed)",
      "  - Salt to taste",

      "- For the Filling:",
      "  - 1 cup mixed vegetables (cabbage, carrots, bell peppers, etc.), finely chopped",
      "  - 1 small onion, finely chopped",
      "  - 1 teaspoon ginger-garlic paste",
      "  - 1 teaspoon soy sauce",
      "  - 1 teaspoon oil",
      "  - Salt to taste",
      "  - Ground black pepper to taste",

      "- For Assembling:",
      "  - All-purpose flour (for dusting)",
      "  - Water (for sealing)",

      "Instructions for Veg Momos:",
      "1. Prepare the Dough:",
      "  - In a mixing bowl, combine all-purpose flour and a pinch of salt.",
      "  - Gradually add water while kneading to form a smooth and firm dough.",
      "  - Cover the dough with a damp cloth and let it rest for about 20-30 minutes.",

      "2. Prepare the Filling:",
      "  - In a pan, heat oil over medium heat.",
      "  - Add chopped onions and sauté until translucent.",
      "  - Add ginger-garlic paste and sauté until fragrant.",
      "  - Add chopped mixed vegetables and cook for a few minutes until they soften.",
      "  - Season the mixture with soy sauce, salt, and ground black pepper.",
      "  - Let the filling cool down before using it for the momos.",

      "3. Shape and Fill the Momos:",
      "  - Divide the rested dough into small portions and roll them into smooth balls.",
      "  - Roll out each ball into a thin, round circle, using a rolling pin and dusting with all-purpose flour to prevent sticking.",
      "  - Place a spoonful of the prepared vegetable filling in the center of the dough circle.",

      "4. Seal the Momos:",
      "  - Moisten the edges of the dough circle with water using your finger.",
      "  - Gently fold the circle in half over the filling, creating a half-moon shape.",
      "  - Press and seal the edges of the momo, making pleats along the edge to enclose the filling.",

      "5. Steam the Momos:",
      "  - Prepare a steamer and lightly grease the steaming trays to prevent sticking.",
      "  - Place the shaped momos on the steaming trays, leaving space between them.",
      "  - Steam the momos for about 10-12 minutes, or until the dough becomes translucent and the filling is cooked through.",

      "6. Serve Veg Momos:",
      "  - Once cooked, remove the momos from the steamer.",
      "  - Serve the hot and freshly steamed veg momos with a dipping sauce of your choice.",

      "7. Enjoy:",
      "  - Enjoy the delicious and flavorful veg momos as a popular Nepali snack or appetizer.",

      "Nepali :",

      "शाकाहारी मोमोसका लागि सामग्री:",
      "- आटाको लागि:",
      "- २ कप सबै उद्देश्यको पीठो",
      "- पानी (आवश्यकता अनुसार)",
      "- स्वाद अनुसार नुन",

      "- भर्नका लागि:",
      "- 1 कप मिश्रित तरकारीहरू (गोभी, गाजर, बेल मिर्च, आदि), बारीक काटिएको",
      "- 1 सानो प्याज, बारीक काटिएको",
      "- 1 चम्चा अदुवा-लसुनको पेस्ट",
      "- 1 चम्चा सोया सस",
      "- १ चम्चा तेल",
      "- स्वाद अनुसार नुन",
      "- स्वाद अनुसार कालो मिर्च पिउने",

      "- संयोजनको लागि:",
      "- सर्व-उद्देश्यको पीठो (धुलोको लागि)",
      "- पानी (सील गर्न को लागी)",

      "शाकाहारी मोमोसका लागि निर्देशनहरू:",
      "1. आटा तयार गर्नुहोस्:",
      "- एक मिक्सिङ कटोरामा, सबै उद्देश्यको पीठो र एक चुटकी नुन मिलाउनुहोस्।",
      "- चिल्लो र बलियो पीठो बनाउन बिस्तारै पानी हाल्नुहोस्।",
      "- आटालाई ओसिलो कपडाले छोप्नुहोस् र लगभग 20-30 मिनेटको लागि आराम गर्नुहोस्।",

      "2. भर्ने तयारी गर्नुहोस्:",
      "- एउटा प्यानमा, मध्यम तातोमा तेल तताउनुहोस्।",
      "- काटेको प्याज थप्नुहोस् र पारदर्शी नभएसम्म पकाउनुहोस्।",
      "- अदुवा-लसुनको पेस्ट हाल्नुहोस् र सुगन्धित नभएसम्म पकाउनुहोस्।",
      "- काटिएको मिश्रित तरकारीहरू थप्नुहोस् र केही मिनेटको लागि तिनीहरू नरम नभएसम्म पकाउनुहोस्।",
      "- सोया सस, नुन र पिउने कालो मिर्चको मिश्रणलाई सिजन गर्नुहोस्।",
      "- मोमोको लागि प्रयोग गर्नु अघि फिलिंगलाई चिसो हुन दिनुहोस्।",

      "३. मोमोजलाई आकार दिनुहोस् र भर्नुहोस्:",
      "- विश्राम गरिएको आटालाई सानो भागमा विभाजन गर्नुहोस् र तिनीहरूलाई चिल्लो बलहरूमा घुमाउनुहोस्।",
      "- प्रत्येक बललाई पातलो, गोलाकार सर्कलमा घुमाउनुहोस्, रोलिङ पिन प्रयोग गर्नुहोस् र टाँस्नबाट जोगिन सबै उद्देश्यको पीठोले धुनुहोस्।",
      "- आटा सर्कलको बीचमा एक चम्चा तरकारी भरेर तयार पार्नुहोस्।",

      "4. मोमोलाई सिल गर्नुहोस्:",
      "- आफ्नो औंला प्रयोग गरेर पिठो सर्कलको किनाराहरूलाई पानीले ओसिलो पार्नुहोस्।",
      "- बिस्तारै आधा चन्द्रमाको आकार सिर्जना गर्दै भराईमा सर्कललाई आधामा फोल्ड गर्नुहोस्।",
      "- मोमोको किनाराहरू थिच्नुहोस् र सिल गर्नुहोस्, भराईलाई बन्द गर्न किनारामा प्लीटहरू बनाउनुहोस्।",

      "५. मोमोजलाई वाफ गर्नुहोस्:",
      "- एक स्टीमर तयार गर्नुहोस् र टाँसिएको रोक्नको लागि स्टिमिङ ट्रेलाई हल्का ग्रीस गर्नुहोस्।",
      "- बाफ गर्ने ट्रेहरूमा आकारको मोमोहरू राख्नुहोस्, तिनीहरूको बीचमा खाली ठाउँ छोड्नुहोस्।",
      "- मोमोसलाई लगभग 10-12 मिनेटको लागि, वा पीठो पारदर्शी नहोउन्जेल र भरिने गरी पकाउन नसक्दासम्म बाफ गर्नुहोस्।",

      "6. तरकारी मोमोस सेवा गर्नुहोस्:",
      "- पाकिसकेपछि, स्टीमरबाट मोमोहरू हटाउनुहोस्।",
      "- तातो र ताजा भापमा परेको तरकारी मोमोलाई आफ्नो मनपर्ने डुब्ने चटनीसँग सेवा गर्नुहोस्।",

      "7. आनन्द लिनुहोस्:",
      "- लोकप्रिय नेपाली खाजा वा एपेटाइजरको रूपमा स्वादिष्ट र स्वादपूर्ण तरकारी मोमोको मजा लिनुहोस्।"
    ]
  },
  {
    "title": "Thupka",
    "image": "images/thupka.png",
    "description": "Noodle Soup",
    "steps": [
      "Ingredients for Thukpa (Nepali Noodle Soup):",
      "- 150 grams noodles (preferably egg noodles or flat rice noodles)",
      "- 1 tablespoon vegetable oil",
      "- 1 onion, thinly sliced",
      "- 2 cloves garlic, minced",
      "- 1-inch ginger, minced",
      "- 1 carrot, julienned",
      "- 1/2 cup cabbage, thinly sliced",
      "- 1/2 cup bell peppers, julienned",
      "- 1/2 cup cooked chicken, shredded (optional, for non-vegetarian version)",
      "- 4 cups chicken or vegetable broth",
      "- 1 teaspoon soy sauce",
      "- 1 teaspoon chili sauce or chili paste (adjust to taste)",
      "- 1/2 teaspoon turmeric powder",
      "- Salt and pepper to taste",
      "- Fresh cilantro leaves, chopped, for garnishing",
      "- Lime wedges, for serving",

      "Instructions for Thukpa:",
      "1. Prepare Noodles:",
      "- Cook the noodles according to the package instructions until they are al dente.",
      "- Drain and rinse the cooked noodles with cold water to prevent them from sticking together. Set aside.",

      "2. Sauté Aromatics:",
      "- Heat vegetable oil in a large pot over medium heat.",
      "- Add sliced onions and sauté until they become translucent.",
      "- Stir in minced garlic and ginger and sauté for about a minute until fragrant.",

      "3. Add Vegetables and Chicken (Optional):",
      "- Add julienned carrots, sliced cabbage, and julienned bell peppers to the pot.",
      "- If using cooked chicken, add it at this stage.",
      "- Sauté the vegetables and chicken for a few minutes until they begin to soften.",

      "4. Season the Soup:",
      "- Sprinkle turmeric powder over the vegetables and chicken.",
      "- Pour in the chicken or vegetable broth and bring the soup to a gentle simmer.",
      "- Add soy sauce and chili sauce or chili paste to the soup.",
      "- Season with salt and pepper to taste. Adjust the seasonings to your preference.",

      "5. Assemble the Thukpa:",
      "- Place a portion of cooked noodles into serving bowls.",
      "- Ladle the hot soup over the noodles, ensuring a good balance of broth and vegetables.",
      "- Garnish with freshly chopped cilantro leaves.",

      "6. Serve and Enjoy:",
      "- Serve the Thukpa hot, with lime wedges on the side.",
      "- Squeeze lime juice into the soup just before eating to add a tangy flavor.",
      "- Thukpa makes for a comforting and hearty meal, perfect for cold days or whenever you crave a delicious bowl of Nepali noodle soup.",
      "Nepali :",
      "थुक्पा (नेपाली चाउचाउ सूप) को लागि सामग्री):",
      "- 150 ग्राम चाउचाउ (अधिमान्य रूपमा अण्डा चाउचाउ वा फ्ल्याट राइस चाउचाउ)",
      "- 1 चम्मच वनस्पति तेल",
      "- १ प्याज, पातलो काटिएको",
      "- 2 लसुन लसुन, केमा",
      "- १ इन्च अदुवा, केसेको",
      "- 1 गाजर, जुलिएन",
      "- १/२ कप बन्दकोबी, पातलो काटिएको",
      "- 1/2 कप बेल मिर्च, जुलिएन",
      "- १/२ कप पकाएको कुखुरा, टुक्रा पारेको (वैकल्पिक, मांसाहारी संस्करणको लागि)",
      "- 4 कप चिकन वा तरकारी शोरबा",
      "- 1 चम्चा सोया सस",
      "- १ चम्चा चिली सस वा चिली पेस्ट (स्वाद अनुसार)",
      "- १/२ चम्चा बेसारको धुलो",
      "- नुन र काली मिर्च स्वाद",
      "- ताजा सिलिन्ट्रो पातहरू, काटिएको, गार्निसिङको लागि",
      "- सेवाको लागि लाइम वेजेज",

      "Thukpa को लागि निर्देशन:",
      "१. चाउचाउ तयार गर्नुहोस्:",
      "- प्याकेज निर्देशन अनुसार चाउचाउहरू पकाउनुहोस् जबसम्म तिनीहरू अल डेन्टे छैनन्।",
      "- पकाएको चाउचाउलाई एकै ठाउँमा टाँस्नबाट जोगाउन चिसो पानीले कुल्ला गर्नुहोस्। छेउमा राख्नुहोस्।",

      "2. साउटे एरोमेटिक्स:",
      "- तरकारीको तेललाई ठूलो भाँडोमा मध्यम तातोमा तताउनुहोस्।",
      "- काटिएको प्याज थप्नुहोस् र पारदर्शी नहोउन्जेल पकाउनुहोस्।",
      "- केमा गरेको लसुन र अदुवामा हाल्नुहोस् र सुगन्धित नभएसम्म करिब एक मिनेटको लागि पकाउनुहोस्।",

      "३. तरकारी र कुखुरा थप्नुहोस् (वैकल्पिक):",
      "- भाँडामा जुलिएन गरिएको गाजर, काटिएको बन्दागोभी, र जुलिएन गरिएको घण्टी मिर्च थप्नुहोस्।",
      "- यदि पकाएको कुखुरा प्रयोग गर्दै हुनुहुन्छ भने, यसलाई यो चरणमा थप्नुहोस्।",
      "- तरकारी र कुखुरा नरम नहोउन्जेल केही मिनेटको लागि पकाउनुहोस्।",

      "4. सूपको सिजन:",
      "- तरकारी र कुखुरामा बेसारको धुलो छर्क्नुहोस्।",
      "- कुखुरा वा तरकारीको ब्रोथमा हाल्नुहोस् र सूपलाई हल्का उमालेर ल्याउनुहोस्।",
      "- सूपमा सोया सस र चिली सस वा चिली पेस्ट थप्नुहोस्।",
      "- स्वाद अनुसार नुन र काली मिर्च संग सिजन। आफ्नो प्राथमिकता अनुसार मसला समायोजन गर्नुहोस्।",

      "5. थुक्पा जम्मा गर्नुहोस्:",
      "- पकाएको चाउचाउको एक भाग सर्भिङ कचौरामा राख्नुहोस्।",
      "- चाउचाउमा तातो सूप लडाउनुहोस्, ब्रोथ र तरकारीको राम्रो सन्तुलन सुनिश्चित गर्नुहोस्।",
      "- भर्खरै काटिएको कोलिन्ट्रो पातहरूले गार्निश गर्नुहोस्।",

      "6. सेवा र आनन्द लिनुहोस्:",
      "- थुक्पालाई छेउमा लाइमको टुक्रा लगाएर तातो सर्भ गर्नुहोस्।",
      "- ट्यान्जी स्वाद थप्नको लागि खाना खानु अघि सूपमा कागतीको रस निचोड्नुहोस्।",
      "- थुक्पाले सान्त्वनादायी र मनमोहक खाना बनाउँदछ, चिसो दिनको लागि उपयुक्त छ वा जब तपाइँ नेपाली चाउचाउ सूपको स्वादिष्ट कचौरा चाहानुहुन्छ।"
    ]
  },
  {
    "title": "Kothe Momo",
    "image": "images/kothemomo.png",
    "description": "Pan fried Momo",
    "steps": [
      "Ingredients for Kothe Momo (Steamed and Pan-Fried Nepali Dumplings):",
      "- 250 grams ground meat (chicken, pork, or beef)",
      "- 1 cup finely chopped cabbage",
      "- 1/2 cup finely chopped onions",
      "- 2 cloves garlic, minced",
      "- 1 teaspoon ginger, minced",
      "- 1 teaspoon soy sauce",
      "- 1 teaspoon sesame oil",
      "- 1/2 teaspoon ground black pepper",
      "- Salt to taste",
      "- Round dumpling wrappers (about 30 wrappers)",
      "- Water for sealing dumplings",
      "- Oil for pan-frying",

      "Instructions for Kothe Momo:",
      "1. Prepare the Filling:",
      "- In a mixing bowl, combine the ground meat, finely chopped cabbage, chopped onions, minced garlic, minced ginger, soy sauce, sesame oil, ground black pepper, and a pinch of salt.",
      "- Mix the ingredients thoroughly until well combined.",

      "2. Assemble the Dumplings:",
      "- Take a dumpling wrapper and place about a teaspoon of the filling in the center.",
      "- Moisten the edges of the wrapper with water using your finger.",
      "- Fold the wrapper in half, creating a half-moon shape, and press the edges to seal the dumpling.",
      "- You can either leave the dumplings as half-moon shapes or pleat and fold the edges to create a decorative look.",

      "3. Steam the Dumplings:",
      "- Place the assembled dumplings in a steamer basket lined with cabbage leaves or parchment paper to prevent sticking.",
      "- Steam the dumplings for about 10-15 minutes or until the dumplings are cooked and the wrappers turn translucent.",

      "4. Pan-Fry the Dumplings:",
      "- Heat a non-stick pan over medium heat and add a small amount of oil to coat the bottom of the pan.",
      "- Place the steamed dumplings in the pan, leaving some space between them. Make sure the flat side of the dumplings is in contact with the pan.",
      "- Cook the dumplings for a few minutes until the bottoms turn golden brown and crispy.",

      "5. Serve and Enjoy:",
      "- Once the dumplings are pan-fried to your desired level of crispiness, remove them from the pan.",
      "- Serve the Kothe Momo hot, with a dipping sauce of your choice, such as tomato chutney or soy dipping sauce.",
      "- Kothe Momo offers a delightful combination of flavors and textures, with a tender steamed filling and a crispy pan-fried bottom. Enjoy these delicious dumplings as a popular Nepali snack or appetizer.",
      "Nepali :",
      "कोठे मोमोका लागि सामग्रीहरू (उफाएको र पान-फ्राईड नेपाली डम्पलिङ):",
      "- 250 ग्राम मासु (कुखुरा, सुँगुर, वा मासु)",
      "- १ कप बारीक काटेको बन्दागोभी",
      "- 1/2 कप बारीक काटिएको प्याज",
      "- 2 लसुन लसुन, केमा",
      "- 1 चम्चा अदुवा, केसेको",
      "- 1 चम्चा सोया सस",
      "- 1 चम्चा तिलको तेल",
      "- १/२ चम्चा कालो मिर्च",
      "- स्वाद अनुसार नुन",
      "- राउन्ड डम्पलिंग र्यापरहरू (लगभग 30 र्यापरहरू)",
      "- डम्प्लिङ सील गर्न को लागी पानी",
      "- प्यान फ्राइङको लागि तेल",

      "कोठे मोमोका लागि निर्देशनहरू:",
      "1. भर्ने तयारी गर्नुहोस्:",
      "- एक मिक्सिङ कचौरा मा, पिसे मासु, मसिनो काटेको बन्दागोभी, कटा प्याज, केमा लसुन, केमा अदुवा, सोया सस, तिलको तेल, पिसे कालो मिर्च, र नुन को एक चुटकी मिलाउनुहोस्।",
      "- सामग्रीहरू राम्ररी नमिल्दासम्म राम्ररी मिलाउनुहोस्।",

      "२. डम्पलिङहरू जम्मा गर्नुहोस्:",
      "- एउटा डम्पलिंग र्यापर लिनुहोस् र बीचमा एक चम्चा भराई राख्नुहोस्।",
      "- आफ्नो औंला प्रयोग गरेर र्यापरको किनाराहरूलाई पानीले ओसिलो पार्नुहोस्।",
      "- र्‍यापरलाई आधामा फोल्ड गर्नुहोस्, आधा-चन्द्र आकार सिर्जना गर्नुहोस्, र डम्पलिङलाई सील गर्न किनारहरू थिच्नुहोस्।",
      "- तपाईं या त पकौडाहरूलाई अर्ध-चन्द्र आकारको रूपमा छोड्न सक्नुहुन्छ वा प्लीट र सजावटी लुक सिर्जना गर्न किनाराहरू तह गर्न सक्नुहुन्छ।",

      "३. डम्पलिङहरू वाफ गर्नुहोस्:",
      "- जम्मा गरिएका पकौलाहरूलाई बन्दाकोबीका पातहरू वा चर्मपत्र कागजले टाँसिएको स्टीमर टोकरीमा राख्नुहोस्।",
      "- डम्प्लिङलाई १०-१५ मिनेटसम्म वा डम्पलिङहरू पकाएर र्‍यापरहरू पारदर्शी नभएसम्म वाफ गर्नुहोस्।",

      "4. प्यान फ्राइ दम्पलिङ:",
      "- नन-स्टिक प्यानलाई मध्यम तातोमा तताउनुहोस् र प्यानको तल कोट गर्न थोरै मात्रामा तेल थप्नुहोस्।",
      "- भापमा पकाएको डम्प्लिङहरू प्यानमा राख्नुहोस्, तिनीहरूको बीचमा केही खाली ठाउँ छोड्नुहोस्। पक्का गर्नुहोस् कि पकौडाको समतल पक्ष प्यानको सम्पर्कमा छ।",
      "- डम्पलिङहरू केही मिनेटको लागि पकाउनुहोस् जबसम्म बटमहरू सुनौलो खैरो र क्रिस्पी नहोउन्जेल।",

      "5. सेवा र आनन्द लिनुहोस्:",
      "- एक पटक डम्पलहरू प्यान-फ्राइएपछि तपाइँको मनपर्ने कुरकुराको स्तरमा, तिनीहरूलाई प्यानबाट हटाउनुहोस्।",
      "- कोठे मोमो तातो सेवा गर्नुहोस्, टमाटरको चटनी वा सोया डिपिङ सस जस्ता तपाईंको मनपर्ने डुब्ने चटनीसँग।",
      "- कोठे मोमोले स्वाद र बनावटको रमाइलो संयोजन प्रदान गर्दछ, एक कोमल स्टीम्ड फिलिंग र क्रिस्पी प्यान-फ्राइड तलको साथ। लोकप्रिय नेपाली खाजा वा एपेटाइजरको रूपमा यी स्वादिष्ट पकौलाहरूको मजा लिनुहोस्।"
    ]
  }
]
