[
  {
    "ftitle": "Yomari",
    "fimage": "images/yomari.png",
    "fdescription": "Sweet Dish Served in YomariPurnima",
    "fsteps": [
      "Ingredients for Yomari (Nepali Dumplings):",
      "- 2 cups rice flour",
      "- 1 cup jaggery (gud), grated",
      "- 1 cup grated coconut",
      "- 1/2 teaspoon cardamom powder",

      "- Water for kneading",
      "- Banana leaves or parchment paper for wrapping",

      "Instructions for Yomari:",
      "1. Prepare Dough:",
      "- In a mixing bowl, add rice flour ",
      "- Gradually add water and knead to form a smooth and pliable dough. Cover and set aside.",

      "2. Make Sweet Filling:",
      "- In a separate bowl, mix grated jaggery, grated coconut, and cardamom powder.",
      "- Cook the mixture in a pan on low heat until the jaggery melts and the mixture comes together. Remove from heat and let it cool.",

      "3. Shape Yomari:",
      "- Take a small portion of the prepared dough and roll it into a ball.",
      "- Flatten the ball into a small disc, keeping the edges slightly thicker than the center.",
      "- Place a spoonful of the sweet filling in the center of the disc.",
      "- Fold the edges of the disc over the filling, creating a semi-circular dumpling. Pinch and twist the edges to seal.",

      "4. Steam Yomari:",
      "- Line a steamer with banana leaves or parchment paper to prevent sticking.",
      "- Arrange the shaped Yomari in the steamer, leaving some space between them.",
      "- Steam the Yomari for about 15-20 minutes until the outer covering turns translucent.",

      "5. Serve and Enjoy:",
      "- Remove the steamed Yomari from the steamer and let them cool slightly.",
      "- Your delicious Yomari is ready to be served as a traditional Nepali sweet delicacy!",

      "Nepali :",
      "योमरी (नेपाली पकौला) को लागि सामग्री):",
      "- २ कप चामलको पीठो",
      "- 1 कप गुड़ (गुड), पिसेको",
      "- 1 कप नरिवल पिसेको",
      "- 1/2 चम्चा अलैंची धुलो",

      "- घुट्ने पानी",
      "- केराको पात वा चर्मपत्र कागज र्‍याप गर्नका लागि",

      "योमारीका लागि निर्देशन:",
      "1. आटा तयार गर्नुहोस्:",
      "- एक मिश्रण कटोरामा, चामलको पीठो मिलाउनुहोस्।",
      "- बिस्तारै पानी थप्नुहोस् र चिल्लो र लचिलो पीठो बनाउनको लागि मुछ्नुहोस्। छोप्नुहोस् र अलग गर्नुहोस्।",

      "2. मीठो भराई बनाउनुहोस्:",
      "- छुट्टै कचौरामा पिसेको गुड़, पिसेको नरिवल र अलैंचीको धुलो मिलाउनुहोस्।",
      "- गुड़ पग्लिएर मिश्रण एकै ठाउँमा नआएसम्म मिश्रणलाई प्यानमा कम तातोमा पकाउनुहोस्। तातोबाट हटाउनुहोस् र चिसो हुन दिनुहोस्।",

      "३. आकार योमरी:",
      "- तयार गरिएको पीठोको सानो भाग लिनुहोस् र यसलाई बलमा घुमाउनुहोस्।",
      "- बललाई सानो डिस्कमा समतल गर्नुहोस्, किनाराहरूलाई केन्द्रभन्दा अलि बाक्लो राखेर।",
      "- डिस्कको बीचमा एक चम्चा मिठाई भर्नुहोस्।",
      "- फिलिंगमा डिस्कको किनाराहरू फोल्ड गर्नुहोस्, अर्ध-वृत्ताकार डम्पलिङ सिर्जना गर्नुहोस्। सिल गर्न किनाराहरूलाई पिन्च गर्नुहोस् र ट्विस्ट गर्नुहोस्।",

      "4. स्टीम योमरी:",
      "- केराको पात वा चर्मपत्र कागजले टाँसिएको रोक्नको लागि स्टीमरलाई लाइन गर्नुहोस्।",
      "- स्टीमरमा आकारको योमरीलाई व्यवस्थित गर्नुहोस्, तिनीहरूको बीचमा केही ठाउँ छोड्नुहोस्।",
      "- योमरीलाई बाहिरी आवरण पारदर्शी नहोउन्जेल लगभग 15-20 मिनेटको लागि बाफ गर्नुहोस्।",

      "5. सेवा र आनन्द लिनुहोस्:",
      "- स्टीमरबाट स्टीमर योमरी हटाउनुहोस् र तिनीहरूलाई अलिकति चिसो हुन दिनुहोस्।",
      "- तपाइँको स्वादिष्ट योमरी नेपाली परम्परागत मिठो परिकारको रूपमा सेवा गर्न तयार छ!"
    ]
  },
  {
    "ftitle": "sel roti ",
    "fimage": "images/selroti.png",
    "fdescription": "Deep Oil Fried Sweet Rice Batter Served in dashian and tihar",
    "fsteps":  [
      "Ingredients for Sel Roti (Nepali Fried Doughnut):",
    "- 2 cups rice flour",
    "- 1/4 cup ghee (clarified butter)",
    "- 1 cup granulated sugar",
    "- Ghee or oil for deep frying",
    "- Water for making the batter",

    "Instructions for Sel Roti:",
    "1. Prepare Batter:",
    "- In a mixing bowl, combine rice flour, granulated sugar, and ghee.",
    "- Mix well to form a smooth batter. The batter should be thick and slightly sticky.",

    "2. Heat Oil:",
    "- Heat ghee or oil in a deep pan over medium heat. The oil should be at a depth of around 2-3 inches.",

    "3. Fry Sel Roti:",
    "- When the oil is hot, wet your hand and take a small portion of the batter.",
    "- Shape the batter into a round doughnut-like disc with a hole in the center.",
    "- Carefully slide the shaped dough into the hot oil. Fry on medium-low heat, turning occasionally, until both sides are golden brown.",

    "4. Drain and Serve:",
    "- Use a slotted spoon to remove the Sel Roti from the oil. Allow excess oil to drain.",
    "- Place the fried Sel Roti on paper towels to remove any remaining oil.",

    "5. Enjoy:",
    "- Sel Roti is ready to be enjoyed as a traditional Nepali snack or breakfast. Serve it with tea or yogurt for a delightful experience.",
    "Nepali :",
    "सेल रोटी (नेपाली फ्राइड डोनट) को लागि सामग्री):",
    "- २ कप चामलको पीठो",
    "- 1/4 कप घिउ (स्पष्ट मक्खन)",
    "- 1 कप दानेदार चिनी",
    "- गहिरो फ्राइको लागि घिउ वा तेल",
    "- ब्याटर बनाउनको लागि पानी",

    "सेल रोटीको लागि निर्देशन:",
    "१. ब्याटर तयार गर्नुहोस्:",
    "- एक मिक्सिङ कचौरा मा, चामलको पीठो, दानेदार चिनी र घ्यू मिलाउनुहोस्।",
    "- एक चिल्लो ब्याटर बनाउन राम्रोसँग मिलाउनुहोस्। ब्याटर बाक्लो र थोरै टाँसिने हुनुपर्छ।",

    "2. तातो तेल:",
    "- गहिरो प्यानमा घिउ वा तेललाई मध्यम तातोमा तताउनुहोस्। तेल लगभग 2-3 इन्चको गहिराइमा हुनुपर्छ।",

    "३. फ्राइ सेल रोटी:",
    "- जब तेल तातो हुन्छ, आफ्नो हात भिजाउनुहोस् र ब्याटरको सानो भाग लिनुहोस्।",
    "- ब्याटरलाई केन्द्रमा प्वाल भएको गोल डोनट जस्तो डिस्कमा आकार दिनुहोस्।",
    "- होसियारीपूर्वक आकारको आटालाई तातो तेलमा स्लाइड गर्नुहोस्। मध्यम-कम तातोमा भुन्नुहोस्, कहिले काँही घुमाउनुहोस्, जबसम्म दुवै पक्ष सुनौलो खैरो हुँदैन।",

    "4. नाली र सेवा:",
    "- तेलबाट सेल रोटी हटाउन स्लटेड चम्चा प्रयोग गर्नुहोस्। अतिरिक्त तेललाई निस्कन दिनुहोस्।",
    "- कुनै पनि बाँकी तेल हटाउन कागजको तौलियामा भुटेको सेल रोटी राख्नुहोस्।",

    "5. आनन्द लिनुहोस्:",
    "- सेल रोटी एक परम्परागत नेपाली खाजा वा नाश्ताको रूपमा रमाइलो गर्न तयार छ। एक रमाइलो अनुभवको लागि यसलाई चिया वा दही संग सेवा गर्नुहोस्।"
  ]
  },
  {
    "ftitle": "Dahi Cheura",
    "fimage": "images/dhaicheura.png",
    "fdescription": "Beaten Rice and Curd Served in Asar 15th ",
    "fsteps": [
      "Ingredients for Dahi Chiura (Nepali Flattened Rice with Yogurt):",
      "- 2 cups chiura (flattened rice/beaten rice)",
      "- 1 cup plain yogurt",
      "- 1/2 cup milk",
      "- 1/2 teaspoon cumin powder",
      "- 1/2 teaspoon roasted ground sesame seeds",
      "- 1/2 teaspoon ground black pepper",
      "- Salt to taste",
      "- Chopped cilantro for garnishing",
      "- Chopped green chilies (optional, for extra spice)",

      "Instructions for Dahi Chiura:",
      "1. Wash and Soak Chiura:",
      "- Rinse the chiura thoroughly in cold water.",
      "- Drain the excess water and let the chiura soak for about 5-10 minutes until it softens.",
      "- Gently fluff the soaked chiura with a fork to separate the grains.",

      "2. Prepare Yogurt Mixture:",
      "- In a bowl, whisk the plain yogurt until smooth.",
      "- Add milk to the yogurt and mix well to achieve a creamy consistency.",

      "3. Combine Yogurt and Chiura:",
      "- Gradually add the soaked and fluffed chiura to the yogurt mixture.",
      "- Mix gently to coat the chiura with the yogurt. You can adjust the amount of yogurt to achieve your preferred level of creaminess.",

      "4. Add Seasonings:",
      "- Sprinkle cumin powder, roasted ground sesame seeds, ground black pepper, and salt over the chiura-yogurt mixture.",
      "- If you like it spicy, add chopped green chilies.",

      "5. Mix and Chill:",
      "- Gently mix all the ingredients together until well combined.",
      "- Cover the bowl and refrigerate for about 30 minutes to allow the flavors to meld and the chiura to absorb the yogurt.",

      "6. Garnish and Serve:",
      "- Before serving, give the Dahi Chiura a good stir.",
      "- Garnish with chopped cilantro on top.",

      "7. Enjoy:",
      "- Your refreshing and tangy Dahi Chiura is ready to be enjoyed as a traditional Nepali snack or light meal!",
      "Nepali :",
      "दही चिउरा (नेपाली चामल र दही) को लागि सामग्री:",
      "- २ कप चिउरा (चपटा चामल/पिटेको चामल)",
      "- 1 कप सादा दही",
      "- 1/2 कप दूध",
      "- 1/2 चम्चा जीरा धुलो",
      "- १/२ चम्चा भुटेको तिल",
      "- १/२ चम्चा कालो मिर्च",
      "- स्वाद अनुसार नुन",
      "- गार्निसिङको लागि काटेको कोथिन",
      "- काटेको हरियो खुर्सानी (वैकल्पिक, अतिरिक्त मसलाको लागि)",

      "दही चिउराको लागि निर्देशन:",
      "१. चिउरा धुनुहोस् र भिजाउनुहोस्:",
      "- चिउरालाई चिसो पानीमा राम्ररी कुल्ला गर्नुहोस्।",
      "- अतिरिक्त पानी निकाल्नुहोस् र चिउरालाई नरम नभएसम्म 5-10 मिनेटको लागि भिजाउनुहोस्।",
      "- भिजेको चिउरालाई काँटाले दाना छुट्याउन बिस्तारै फ्लफ गर्नुहोस्।",

      "2. दही मिश्रण तयार गर्नुहोस्:",
      "- एउटा कचौरामा, सादा दहीलाई चिल्लो नभएसम्म हल्किनुहोस्।",
      "- दहीमा दूध थप्नुहोस् र क्रीमयुक्त स्थिरता प्राप्त गर्न राम्रोसँग मिलाउनुहोस्।",

      "३. दही र चिउरा मिलाउनुहोस्:",
      "- दहीको मिश्रणमा बिस्तारै भिजेको र फ्लफ गरिएको चिउरा थप्नुहोस्।",
      "- दहीसँग चिउरा कोट गर्न बिस्तारै मिलाउनुहोस्। तपाइँ आफ्नो मनपर्ने क्रीमपन स्तर प्राप्त गर्न दहीको मात्रा समायोजन गर्न सक्नुहुन्छ।",

      "4. सिजनहरू थप्नुहोस्:",
      "- चिउरा-दहीको मिश्रणमा जीराको धुलो, भुटेको तिल, पिसेको कालो मिर्च र नुन छर्काउनुहोस्।",
      "- यदि तपाईंलाई मसलादार मनपर्छ भने, काटेको हरियो खुर्सानी थप्नुहोस्।",

      "5. मिक्स र चिल:",
      "- राम्ररी नमिल्दासम्म सबै अवयवहरूलाई बिस्तारै मिलाउनुहोस्।",
      "- कचौरालाई छोप्नुहोस् र स्वादहरू मिल्न र चिउराले दहीलाई अवशोषित गर्न अनुमति दिन लगभग 30 मिनेटको लागि फ्रिजमा राख्नुहोस्।",

      "6. गार्निस र सर्भ:",
      "- सेवा गर्नु अघि, दही चिउरालाई राम्रोसँग हलचल दिनुहोस्।",
      "- माथि कटा सिलिन्ट्रो संग गार्निश।",

      "7. आनन्द लिनुहोस्:",
      "- तपाइँको स्फूर्तिदायी र चिल्लो दही चिउरा परम्परागत नेपाली खाजा वा हल्का खानाको रूपमा रमाइलो गर्न तयार छ!"
    ]
  },
  {
    "ftitle": "Kheer ",
    "fimage": "images/kheer.png",
    "fdescription": "Sweet Rice Cooked in Milk Served in Shrawan 1st",
    "fsteps": [
      "Ingredients for Kheer (Nepali Rice Pudding):",
      "- 1/2 cup rice",
      "- 4 cups milk",
      "- 1/2 cup sugar (adjust to taste)",
      "- 1/4 cup mixed nuts (almonds, cashews, raisins), chopped",
      "- 1/2 teaspoon cardamom powder",
      "- Saffron strands (optional)",
      "- A pinch of nutmeg powder",
      "- Ghee for frying nuts (optional)",

      "Instructions for Kheer:",
      "1. Wash and Soak Rice:",
      "- Wash the rice thoroughly and soak it in water for about 30 minutes.",

      "2. Cook Rice and Milk:",
      "- In a heavy-bottomed pot, bring the milk to a boil.",
      "- Drain the soaked rice and add it to the boiling milk.",
      "- Reduce the heat to low and let the rice cook in the milk, stirring occasionally to prevent sticking.",
      "- Allow the rice to cook until it becomes soft and the milk thickens. This can take about 30-40 minutes.",

      "3. Add Sugar and Nuts:",
      "- Once the rice is cooked and the milk has thickened, add sugar and mix well.",
      "- Add chopped nuts and continue cooking, stirring occasionally, until the kheer reaches the desired consistency.",

      "4. Flavor the Kheer:",
      "- Stir in cardamom powder and saffron strands (if using) for flavor.",
      "- Add a pinch of nutmeg powder for an extra layer of taste.",

      "5. Fry Nuts (Optional):",
      "- In a separate pan, heat a little ghee.",
      "- Add the chopped nuts and raisins and fry until the nuts turn golden and the raisins plump up.",
      "- Remove from heat and drain the excess ghee.",

      "6. Serve and Garnish:",
      "- Once the kheer is ready, turn off the heat.",
      "- If using, add the fried nuts and raisins, reserving some for garnishing.",

      "7. Chill and Serve:",
      "- Let the kheer cool down to room temperature before refrigerating it.",
      "- Serve the chilled kheer in bowls, garnished with the reserved fried nuts and raisins.",

      "8. Enjoy:",
      "- Your creamy and delectable Kheer is ready to be enjoyed as a delightful Nepali dessert!",
      "Nepali :",
      "खिर (नेपाली चामलको खीर) को लागि सामग्री):",
      "- १/२ कप चामल",
      "- ४ कप दूध",
      "- १/२ कप चिनी (स्वाद अनुसार)",
      "- 1/4 कप मिश्रित नट (बदाम, काजू, किशमिश), काटिएको",
      "- 1/2 चम्चा अलैंची धुलो",
      "- केसर स्ट्रेन्ड्स (वैकल्पिक)",
      "- एक चुटकी जायफल पाउडर",
      "- नट फ्राइङका लागि घिउ (ऐच्छिक)",

      "खीरको लागि निर्देशन:",
      "१. चामल धुनुहोस् र भिजाउनुहोस्:",
      "- चामललाई राम्ररी धुनुहोस् र लगभग 30 मिनेटको लागि पानीमा भिजाउनुहोस्।",

      "२. भात र दूध पकाउनुहोस्:",
      "- भारी-तलको भाँडोमा, दूधलाई फोडामा ल्याउनुहोस्।",
      "- भिजेको चामल निकालेर उमालेको दूधमा हाल्नुहोस्।",
      "- तातो कम गर्न कम गर्नुहोस् र चामललाई दूधमा पकाउन दिनुहोस्, टाँसिने रोक्नको लागि कहिले काँही हलचल गर्नुहोस्।",
      "- चामल नरम नभएसम्म र दूध गाढा नभएसम्म पकाउन दिनुहोस्। यसले लगभग 30-40 मिनेट लिन सक्छ।",

      "३. चिनी र नट थप्नुहोस्:",
      "- चामल पाकिसकेपछि र दूध गाढा भएपछि चिनी हालेर राम्ररी मिलाउनुहोस्।",
      "- काटेको नटहरू थप्नुहोस् र पकाउन जारी राख्नुहोस्, कहिलेकाहीं हलचल, जबसम्म खीर इच्छित स्थिरतामा पुग्दैन।",

      "४. खीरको स्वाद:",
      "- स्वादको लागि अलैंची पाउडर र केसरको स्ट्र्यान्डहरू (यदि प्रयोग भएमा) मिलाउनुहोस्।",
      "- स्वादको अतिरिक्त तहको लागि एक चुटकी जायफल पाउडर थप्नुहोस्।",

      "5. फ्राइ नट्स (वैकल्पिक):",
      "- छुट्टै प्यानमा थोरै घिउ तताउनुहोस्।",
      "- काटेको नट र किशमिशहरू थप्नुहोस् र नटहरू सुनौलो नहोउन्जेल र किशमिशहरू मोटो नभएसम्म भुन्नुहोस्।",
      "- तातोबाट हटाउनुहोस् र थप घिउ निकाल्नुहोस्।",

      "6. सर्भ र गार्निस:",
      "- खीर तयार भएपछि तातो बन्द गर्नुहोस्।",
      "- यदि प्रयोग गर्दै हुनुहुन्छ भने, भुटेको नट र किशमिशहरू थप्नुहोस्, केहि गार्निसिङको लागि आरक्षित गर्नुहोस्।",

      "7. चिल एण्ड सर्भ:",
      "- फ्रिजमा राख्नु अघि खीरलाई कोठाको तापक्रममा चिसो हुन दिनुहोस्।",
      "- चिसो खीरलाई कचौरामा सर्भ गर्नुहोस्, आरक्षित फ्राइड नट र किसमिसले सजाउनुहोस्।",

      "8. आनन्द लिनुहोस्:",
      "- तपाइँको क्रीमयुक्त र स्वादिष्ट खीर एक रमाइलो नेपाली मिठाईको रूपमा रमाइलो गर्न तयार छ!"
    ]
  },
  {
    "ftitle": "Khichadi ",
    "fimage": "images/khichadi.png",
    "fdescription": "Black Lentils and rice cooked with Ghee and Spice Served in Maghe Sakranti",
    "fsteps": [
      "Ingredients for Khichadi (Nepali Rice and Black Lentil Dish):",
      "- 1 cup rice",
      "- 1/2 cup split black lentils (black urad dal)",
      "- 4 cups water",
      "- 1 onion, finely chopped",
      "- 2 tomatoes, chopped",
      "- 1 teaspoon ginger-garlic paste",
      "- 1/2 teaspoon turmeric powder",
      "- 1 teaspoon cumin seeds",
      "- 1 teaspoon ghee or oil",
      "- Salt to taste",
      "- Chopped cilantro for garnishing",

      "Instructions for Khichadi:",
      "1. Wash and Soak Rice and Lentils:",
      "- Wash the rice and black lentils together until the water runs clear.",
      "- Soak them in water for about 20-30 minutes, then drain.",

      "2. Sauté Aromatics:",
      "- In a pot, heat ghee or oil over medium heat.",
      "- Add cumin seeds and let them splutter.",
      "- Add chopped onions and sauté until they turn translucent.",
      "- Stir in ginger-garlic paste and sauté until fragrant.",

      "3. Add Tomatoes and Spices:",
      "- Add chopped tomatoes and cook until they soften and turn mushy.",
      "- Mix in turmeric powder and salt. Stir well.",

      "4. Cook Rice and Lentils:",
      "- Add the soaked and drained rice-lentil mixture to the pot.",
      "- Mix well with the tomato-spice mixture.",
      "- Pour in the water and bring to a boil.",
      "- Reduce the heat to low, cover the pot, and let it simmer until the rice and lentils are cooked and tender. Stir occasionally.",

      "5. Adjust Consistency and Seasoning:",
      "- If the khichadi becomes too thick, add a little hot water to achieve your desired consistency.",
      "- Taste and adjust salt as needed.",

      "6. Serve and Garnish:",
      "- Once the rice and lentils are cooked, turn off the heat.",
      "- Garnish with chopped cilantro on top.",

      "7. Enjoy:",
      "- Your warm and hearty Khichadi with black lentils is ready to be served as a comforting Nepali meal!",
      "Nepali :",
      "खिचडी (नेपाली चामल र कालो दालको परिकार) को लागि सामग्री):",
      "- १ कप चामल",
      "- 1/2 कप विभाजित कालो दाल (कालो मास दाल)",
      "- 4 कप पानी",
      "- 1 प्याज, बारीक काटिएको",
      "- २ टमाटर, काटिएको",
      "- १ चम्चा अदुवा-लसुनको पेस्ट",
      "- १/२ चम्चा बेसारको धुलो",
      "- १ चम्चा जीरा",
      "- १ चम्चा घिउ वा तेल",
      "- स्वाद अनुसार नुन",
      "- गार्निसिङको लागि काटेको कोथिन",

      "खिचडीको लागि निर्देशन:",
      "१. चामल र दाल धुनुहोस् र भिजाउनुहोस्:",
      "- पानी सफा नभएसम्म चामल र कालो दाल सँगै धुनुहोस्।",
      "- तिनीहरूलाई लगभग 20-30 मिनेटको लागि पानीमा भिजाउनुहोस्, त्यसपछि निकास गर्नुहोस्।",

      "2. साउटे एरोमेटिक्स:",
      "- भाँडोमा घिउ वा तेल मध्यम तामा तताउनुहोस्।",
      "- जीरा थप्नुहोस् र तिनीहरूलाई टुक्रा दिनुहोस्।",
      "- काटेको प्याज थप्नुहोस् र पारदर्शी नहोउन्जेल पकाउनुहोस्।",
      "- अदुवा-लसुनको पेस्टमा हाल्नुहोस् र सुगन्धित नभएसम्म पकाउनुहोस्।",

      "३. टमाटर र मसला थप्नुहोस्:",
      "- काटेको टमाटरहरू थप्नुहोस् र नरम नहोउन्जेल पकाउनुहोस्।",
      "- बेसारको धुलो र नुन मिलाउनुहोस्। राम्ररी मिलाउनुहोस्।",

      "4. चामल र दाल पकाउनुहोस्:",
      "- भाँडोमा भिजेको र निकास गरिएको चामल-मसूरको मिश्रण थप्नुहोस्।",
      "- टमाटर-मसलाको मिश्रणसँग राम्ररी मिलाउनुहोस्।",
      "- पानीमा हाल्नुहोस् र फोडा ल्याउनुहोस्।",
      "- तातो कम गर्नुहोस्, भाँडो छोप्नुहोस्, र चामल र दाल पकाउन र कोमल नहोउन्जेल यसलाई उमाल्न दिनुहोस्। कहिले काँही हलचल गर्नुहोस्।",

      "5. स्थिरता र मसला समायोजन गर्नुहोस्:",
      "- यदि खिचडी धेरै गाढा भयो भने, आफ्नो मनपर्ने स्थिरता प्राप्त गर्न अलिकति तातो पानी थप्नुहोस्।",
      "- स्वाद र आवश्यकता अनुसार नुन समायोजन।",

      "6. सर्भ र गार्निस:",
      "- चामल र दाल पाकिसकेपछि तातो बन्द गर्नुहोस्।",
      "- माथि कटा सिलिन्ट्रो संग गार्निश।",

      "7. आनन्द लिनुहोस्:",
      "- कालो दालको साथ तपाईंको न्यानो र मनमोहक खिचडी सान्त्वनादायी नेपाली खानाको रूपमा सेवा गर्न तयार छ!"
    ]
  },
  {
    "ftitle": " Phini Roti",
    "fimage": "images/finiroti.png",
    "fdescription": "Deep fried crunchy Flour dough , Served in Tihar",
    "fsteps": [
      "Ingredients for Phini Roti (Nepali Sweet Flatbread):",
      "- 2 cups all-purpose flour (white flour)",
      "- Ghee for painting and frying",
      "- Rice flour and ghee mixture (for painting)",
      "- Chopped nuts (almonds, cashews) for garnishing",
      "- Sugar syrup (Chashni) for dipping (optional)",

      "Instructions for Phini Roti:",
      "1. Prepare Dough and Mixture:",
      "- In a mixing bowl, take all-purpose flour (white flour).",
      "- Add ghee little by little and knead into a smooth, soft dough.",

      "2. Prepare Rice Flour and Ghee Mixture:",
      "- Mix rice flour and ghee in a separate bowl to make a paste-like mixture.",

      "3. Roll and Paint the Dough:",
      "- Take a small portion of the dough and roll it into a ball.",
      "- Flatten the ball slightly and paint one side with the rice flour and ghee mixture.",

      "4. Create Layers and Roll:",
      "- Fold the painted side inwards to create a semi-circle shape.",
      "- Paint the inner side with the mixture again.",
      "- Fold inwards once more to create a triangle shape.",
      "- Paint the inner side with the mixture.",
      "- Fold the triangle from the base upwards, creating a layered stack of dough.",
      "- Roll out the layered stack into a circular roti using a rolling pin.",

      "5. Fry Phini Roti:",
      "- Heat ghee in a flat pan over medium heat.",
      "- Carefully place the rolled roti in the pan and cook until it turns golden and crisp on both sides.",
      "- Press gently with a spatula while frying to ensure even cooking.",

      "6. Garnish and Serve:",
      "- Remove the fried Phini Roti from the pan and let excess ghee drip off.",
      "- Garnish with chopped nuts on top.",

      "7. Enjoy:",
      "- Your delicious Phini Roti is ready to be enjoyed as a sweet Nepali treat!",
      "Nepali :",
      "फिनी रोटी (नेपाली मिठो फ्ल्याटब्रेड) को लागि सामग्री):",
      "- २ कप सबै उद्देश्यको पीठो (मैदा)",
      "- चित्रकारी र फ्राइङको लागि घिउ",
      "- चामलको पिठो र घिउको मिश्रण (पेन्टिङका लागि)",
      "- गार्निसिङको लागि काटेको नट (बदाम, काजू)",
      "- चिनीको सिरप (चाश्नी) डुबाउनको लागि (वैकल्पिक)",

      "फिनी रोटीको लागि निर्देशन:",
      "1. आटा र मिश्रण तयार गर्नुहोस्:",
      "- एक मिक्सिङ कचौरा मा, सबै उद्देश्यको पीठो (सेतो पीठो) लिनुहोस्।",
      "- बिस्तारै घ्यू थप्नुहोस् र चिल्लो, नरम पीठोमा मुछ्नुहोस्।",

      "२. चामलको पिठो र घिउको मिश्रण तयार गर्नुहोस्:",
      "- छुट्टै भाँडोमा चामलको पिठो र घिउ मिसाएर पेस्ट जस्तो मिश्रण बनाउनुहोस्।",

      "३. आटा रोल र पेन्ट गर्नुहोस्:",
      "- आटाको सानो भाग लिनुहोस् र यसलाई बलमा घुमाउनुहोस्।",
      "- बललाई थोरै समतल गर्नुहोस् र चामलको पीठो र घ्यूको मिश्रणले एक तर्फ रंग्नुहोस्।",

      "4. तहहरू र रोल सिर्जना गर्नुहोस्:",
      "- अर्ध-वृत्त आकार सिर्जना गर्न पेन्ट गरिएको छेउ भित्रपट्टि फोल्ड गर्नुहोस्।",
      "- मिश्रणको साथ भित्री भाग फेरि पेन्ट गर्नुहोस्।",
      "- त्रिभुज आकार सिर्जना गर्न फेरि एक पटक भित्रपट्टि फोल्ड गर्नुहोस्।",
      "- मिश्रणको साथ भित्री भाग पेन्ट गर्नुहोस्।",
      "- त्रिभुजलाई आधारबाट माथितिर फोल्ड गर्नुहोस्, पीठोको तहगत स्ट्याक सिर्जना गर्नुहोस्।",
      "- लेयर्ड स्ट्याकलाई रोलिङ पिन प्रयोग गरेर गोलाकार रोटीमा घुमाउनुहोस्।",

      "५. फिनी रोटी फ्राइ:",
      "- मध्यम तातोमा समतल प्यानमा घिउ तताउनुहोस्।",
      "- रोटीलाई सावधानीपूर्वक प्यानमा राख्नुहोस् र यो सुनौलो र कुरकुरा दुवैतिर नहोउन्जेल पकाउनुहोस्।",
      "- पकाउने सुनिश्चित गर्न फ्राइ गर्दा स्प्याटुलाले बिस्तारै थिच्नुहोस्।",

      "6. गार्निस र सर्भ:",
      "- फ्राइड फिनी रोटी प्यानबाट हटाउनुहोस् र थप घिउ छोड्नुहोस्।",
      "- माथि कटा नट संग गार्निश।",

      "7. आनन्द लिनुहोस्:",
      "- तपाइँको स्वादिष्ट फिनी रोटी मिठो नेपाली खानाको रूपमा रमाइलो गर्न तयार छ!"
    ]
  },
  {
    "ftitle": "Thekuwa ",
    "fimage": "images/thekuwa.png",
    "fdescription": "Deep-fried sweet wheat patties,Served in Chhatt",
    "fsteps": [
      "Ingredients for Thekuwa (Nepali Sweet Snack):",
      "- 2 cups all-purpose flour",
      "- 1/2 cup semolina (sooji)",
      "- 1 cup brown sugar (or jaggery), grated",
      "- 1/2 cup ghee, melted",
      "- 1/2 teaspoon cardamom powder",
      "- A pinch of salt",
      "- Chopped nuts (almonds, cashews, raisins) for crunch",
      "- Water for kneading",
      "- Oil for deep frying",

      "Instructions for Thekuwa:",
      "1. Prepare Dough:",
      "- In a mixing bowl, combine all-purpose flour and semolina.",
      "- Add a pinch of salt and melted ghee.",
      "- Mix well to incorporate the ghee into the flour mixture.",

      "2. Add Sweetener and Flavorings:",
      "- Add grated brown sugar (or jaggery) to the mixture.",
      "- Sprinkle cardamom powder for flavor.",

      "3. Knead the Dough:",
      "- Gradually add water and knead the mixture into a firm dough.",
      "- The dough should be pliable but not too soft.",

      "4. Shape Thekuwa:",
      "- Take a small portion of the dough and roll it into a ball.",
      "- Flatten the ball slightly and shape it into a small round or oval disc. Press gently to flatten further.",
      "- Use your fingers to create a decorative pattern on top if desired.",

      "5. Heat Oil and Fry:",
      "- Heat oil in a deep pan over medium heat for deep frying.",
      "- Carefully slide the shaped Thekuwa into the hot oil.",
      "- Fry on medium-low heat until both sides turn golden brown and the Thekuwa is crisp.",

      "6. Drain and Cool:",
      "- Once fried, remove the Thekuwa from the oil and drain excess oil on paper towels.",
      "- Let them cool down to room temperature.",

      "7. Enjoy Chhat Festival Snack:",
      "- Your crispy and sweet Thekuwa is now ready to be enjoyed as a special treat during the Chhat festival!",
      "Nepali :",
      "थेकुवा (नेपाली मिठाई खाजा) को लागि सामग्री):",
      "- २ कप सबै उद्देश्यको पीठो",
      "- 1/2 कप सूजी (सुजी)",
      "- १ कप ब्राउन शुगर (वा गुड़), पिसेको",
      "- 1/2 कप घिउ, पग्लिएको",
      "- 1/2 चम्चा अलैंची धुलो",
      "- एक चुटकी नुन",
      "- क्रन्चको लागि काटेको नट (बदाम, काजू, किसमिस)",
      "- घुट्ने पानी",
      "- गहिरो फ्राइको लागि तेल",

      "थेकुवाका लागि निर्देशन:",
      "1. आटा तयार गर्नुहोस्:",
      "- एक मिक्सिङ कटोरामा, सबै उद्देश्यको पीठो र सूजी मिलाउनुहोस्।",
      "- एक चिम्टी नुन र पग्लिएको घिउ थप्नुहोस्।",
      "- पीठोको मिश्रणमा घ्यू मिसाउन राम्रोसँग मिलाउनुहोस्।",

      "२. मिठास र स्वाद थप्नुहोस्:",
      "- मिश्रणमा ग्रेटेड ब्राउन शुगर (वा गुड़) थप्नुहोस्।",
      "- स्वादको लागि अलैंची पाउडर छर्काउनुहोस्।",

      "३. आटा मुछ्नुहोस्:",
      "- बिस्तारै पानी थप्नुहोस् र मिश्रणलाई बलियो पीठोमा मुछ्नुहोस्।",
      "- आटा लचिलो तर धेरै नरम हुनुपर्छ।",

      "4. आकार थेकुवा:",
      "- आटाको सानो भाग लिनुहोस् र यसलाई बलमा घुमाउनुहोस्।",
      "- बललाई थोरै समतल बनाउनुहोस् र यसलाई सानो गोलो वा अंडाकार डिस्कमा आकार दिनुहोस्। थप सपाट गर्न बिस्तारै थिच्नुहोस्।",
      "- यदि चाहियो भने शीर्षमा सजावटी ढाँचा सिर्जना गर्न आफ्नो औंलाहरू प्रयोग गर्नुहोस्।",

      "५. तेल तताएर फ्राइ:",
      "- गहिरो प्यानमा गहिरो फ्राइ गर्नको लागि मध्यम तापमा तेल तताउनुहोस्।",
      "- तातो तेलमा आकारको थेकुवालाई ध्यानपूर्वक स्लाइड गर्नुहोस्।",
      "- दुवै पक्ष सुनौलो खैरो र थेकुवा कुरकुरा नभएसम्म मध्यम-कम तातोमा फ्राइ गर्नुहोस्।",

      "6. ड्रेन र कूल:",
      "- एक पटक भुटेपछि, तेलबाट थेकुवा हटाउनुहोस् र कागजको तौलियामा थप तेल निकाल्नुहोस्।",
      "- तिनीहरूलाई कोठाको तापक्रममा चिसो हुन दिनुहोस्।",

      "७. छठ पर्वको खाजाको मजा लिनुहोस्:",
      "- तपाईको क्रिस्पी र मीठो थेकुवा अब छठ पर्वको विशेष परिकारको रूपमा रमाइलो गर्न तयार छ!"
    ]
  },
  {
    "ftitle": " Chaku ",
    "fimage": "images/chaku.png",
    "fdescription": "Nepali molasses and ghee candy, Specially Seved in Maghe sakranti",
    "fsteps": [
      "Ingredients for Chaaku (Nepali Sweet Dish):",
      "- 2 cups jaggery (gun), grated",
      "- 1 cup mixed dry fruits (cashews, almonds, walnuts, raisins, etc.), chopped",
      "- 1/2 cup ghee",
      "- A pinch of cardamom powder",
      "- A pinch of nutmeg powder",
      "- A pinch of cinnamon powder",

      "Instructions for Chaaku:",
      "1. Prepare Jaggery (Gun):",
      "- Grate the jaggery to prepare the base for the Chaaku.",

      "2. Heat Ghee:",
      "- In a pan, heat ghee over low heat until it melts.",

      "3. Mix Jaggery and Ghee:",
      "- Gradually add the grated jaggery to the melted ghee.",
      "- Stir well to dissolve the jaggery and combine with the ghee.",

      "4. Add Dry Fruits and Spices:",
      "- Add the chopped mixed dry fruits to the jaggery-ghee mixture.",
      "- Sprinkle a pinch of cardamom powder, nutmeg powder, and cinnamon powder for flavor.",

      "5. Cook and Stir:",
      "- Cook the mixture on low heat, stirring constantly to prevent burning.",
      "- Continue cooking until the mixture thickens and starts to leave the sides of the pan.",

      "6. Shape and Set:",
      "- Remove the mixture from the heat and let it cool slightly.",
      "- While the mixture is still warm, shape it into small balls or flatten it into desired shapes using greased hands or molds.",

      "7. Let Cool and Harden:",
      "- Place the shaped Chaaku on a greased plate or tray to cool down and harden completely.",
      "- You can also place them in the refrigerator for faster setting.",

      "8. Enjoy Nepali Sweet Delight:",
      "- Your delicious and nutty Chaaku is ready to be enjoyed as a traditional Nepali sweet dish, often savored during festivals and special occasions!",
      "Nepali :",
      "चाकु (नेपाली मीठो परिकार) को लागि सामग्री):",
      "- २ कप गुड़ (भेली), पिसेको",
      "- १ कप मिश्रित ड्राई फ्रुट्स (काजु, बदाम, अखरोट, किशमिश, आदि), काटिएको",
      "- 1/2 कप घिउ",
      "एक चिम्टी अलैंचीको धुलो",
      "- एक चुटकी जायफल पाउडर",
      "- एक चुटकी दालचीनी पाउडर",

      "चाकुको लागि निर्देशन:",
      "1. गुड़ (बन्दुक) तयार गर्नुहोस्:",
      "- चाकुको लागि आधार तयार गर्न गुड़ पिसेर।",

      "2. घिउ तातो:",
      "- एउटा प्यानमा, घ्यूलाई कम तातोमा पग्लिएसम्म तताउनुहोस्।",

      "३. गुड़ र घिउ मिलाउनुहोस्:",
      "- पग्लिएको घ्यूमा बिस्तारै पिसेको गुड़ थप्नुहोस्।",
      "- गुड़ पगाल्न र घिउसँग मिलाउनको लागि राम्रोसँग मिलाउनुहोस्।",

      "4. सुख्खा फल र मसला थप्नुहोस्:",
      "- गुड़-घिउको मिश्रणमा काटिएका सुक्खा फलहरू थप्नुहोस्।",
      "- स्वादको लागि अलैंचीको धुलो, जायफलको धुलो र दालचीनी पाउडर छर्काउनुहोस्।",

      "5. पकाउनुहोस् र हलचल:",
      "- मिश्रणलाई कम तातोमा पकाउनुहोस्, जलनबाट जोगाउन लगातार हलचल गर्नुहोस्।",
      "- मिश्रण गाढा नहोउन्जेल र प्यानको छेउ छोड्न सुरु नगरेसम्म पकाउन जारी राख्नुहोस्।",

      "6. आकार र सेट:",
      "- तातोबाट मिश्रण हटाउनुहोस् र यसलाई अलिकति चिसो हुन दिनुहोस्।",
      "- जब मिश्रण अझै न्यानो छ, यसलाई सानो बलहरूमा आकार दिनुहोस् वा ग्रीस गरिएका हातहरू वा मोल्डहरू प्रयोग गरी मनपर्ने आकारहरूमा समतल गर्नुहोस्।",

      "7. चिसो र कडा हुन दिनुहोस्:",
      "- आकारको चाकुलाई ग्रीस गरिएको प्लेट वा ट्रेमा चिसो र पूर्ण रूपमा कडा पार्न राख्नुहोस्।",
      "- तपाईले तिनीहरूलाई छिटो सेटिङको लागि फ्रिजमा पनि राख्न सक्नुहुन्छ।",

      "8. नेपाली मीठो आनन्दको आनन्द लिनुहोस्:",
      "- तपाइँको स्वादिष्ट र नटी चाकु एक परम्परागत नेपाली मिठो परिकारको रूपमा रमाइलो गर्न तयार छ, प्रायः चाडपर्व र विशेष अवसरहरूमा स्वाद लिइन्छ!"
    ]
  }
]
