[
  {
    "stitle": "Rasgulla ",
    "simage": "images/rasgulla.png",
    "sdescription": "Soft cottage cheese balls in sugar syrup",
    "ssteps": [
      "Ingredients for Rasgulla:",
      "- 1 liter full-fat milk",
      "- 1 tablespoon lemon juice or vinegar",
      "- 1 cup sugar",
      "- 4 cups water",
      "- A pinch of cardamom powder",
      "- A few saffron strands (optional)",
      "- Chopped nuts for garnishing (like pistachios or almonds)",

      "Instructions for Rasgulla:",
      "1. Prepare the Chenna (Paneer):",
      "- In a pot, heat the milk until it starts boiling.",
      "- Add lemon juice or vinegar to the boiling milk to curdle it. Stir gently until the milk solids separate from the whey.",
      "- Strain the curdled milk through a muslin cloth or a fine strainer to separate the chenna. Rinse it under cold water to remove any sourness.",

      "2. Make Rasgulla Dough:",
      "- Gather the edges of the muslin cloth with chenna inside and squeeze gently to remove excess water.",
      "- Place the chenna on a plate and knead it with the heel of your hand until it becomes smooth and soft. This should take about 5-7 minutes.",

      "3. Shape the Rasgulla:",
      "- Divide the chenna into small equal portions and roll them between your palms to form smooth balls without cracks.",

      "4. Cook the Rasgulla:",
      "- In a wide pan, mix sugar and water. Bring it to a boil until the sugar completely dissolves.",
      "- Gently slide the chenna balls into the simmering sugar-water mixture.",
      "- Cover the pan and let the rasgullas cook on medium heat for about 15-20 minutes. They will double in size as they cook.",

      "5. Add Flavor and Garnish:",
      "- Add a pinch of cardamom powder and saffron strands to the pan for flavor (if using).",
      "- Turn off the heat and let the rasgullas cool down in the sugar syrup.",

      "6. Serve Rasgulla:",
      "- Once cooled, transfer the rasgullas along with the syrup to a serving bowl.",
      "- Garnish with chopped nuts like pistachios or almonds.",

      "7. Enjoy:",
      "- Serve the sweet and spongy rasgullas as a delightful dessert after a meal or on special occasions.",

      "Nepali:",
      "रसगुल्लाका लागि सामग्री:",
      "- १ लिटर फुल फ्याट दूध",
      "- 1 चम्मच कागतीको रस वा सिरका",
      "- १ कप चिनी",
      "- 4 कप पानी",
      "एक चिम्टी अलैंचीको धुलो",
      "- केहि केसर स्ट्रेन्डहरू (वैकल्पिक)",
      "- गार्निसिङको लागि काटेको नट (जस्तै पिस्ता वा बदाम)",

      "रसगुल्ला को लागि निर्देशन:",
      "१. चेन्ना (पनीर) तयार गर्नुहोस्):",
      "- एउटा भाँडोमा, दूध उम्लिएसम्म तताउनुहोस्।",
      "- उमालेको दूधमा कागतीको रस वा भिनेगर मिसाएर त्यसलाई दही गर्नुहोस्। दुधको घाँटीबाट अलग नहोउन्जेल बिस्तारै हलचल गर्नुहोस्।",
      "- दही भएको दूधलाई मलमलको कपडा वा राम्रो छालेर चेन्ना छुट्याउनुहोस्। कुनै पनि अमिलोपन हटाउन यसलाई चिसो पानीले कुल्ला गर्नुहोस्।",

      "२. रसगुल्लाको आटा बनाउनुहोस्:",
      "- मलमलको कपडाको छेउमा चेन्ना भित्र जम्मा गर्नुहोस् र थप पानी हटाउन बिस्तारै निचोड्नुहोस्।",
      "- चेन्नालाई प्लेटमा राख्नुहोस् र यसलाई आफ्नो हातको एड़ीले मुछ्नुहोस् जबसम्म यो चिल्लो र नरम हुँदैन। यसले लगभग 5-7 मिनेट लिनुपर्दछ।",

      "३. रसगुल्लाको आकार दिनुहोस्:",
      "- चेन्नालाई सानो बराबर भागहरूमा विभाजन गर्नुहोस् र तिनीहरूलाई आफ्नो हत्केलाको बीचमा घुमाउनुहोस् ताकि दरारहरू बिना चिल्लो बलहरू बनाउनुहोस्।",

      "4. रसगुल्ला पकाउनुहोस्:",
      "- फराकिलो प्यानमा, चिनी र पानी मिलाउनुहोस्। चिनी पूर्णतया पग्लिएसम्म यसलाई उमाल्नुहोस्।",
      "- बिस्तारै चिनी-पानीको मिश्रणमा चेन्ना बलहरू स्लाइड गर्नुहोस्।",
      "- प्यान छोप्नुहोस् र रसगुल्लालाई मध्यम तातोमा लगभग 15-20 मिनेट पकाउन दिनुहोस्। तिनीहरूले पकाउँदा तिनीहरूको आकार दोब्बर हुनेछ।",

      "5. स्वाद र गार्निश थप्नुहोस्:",
      "- स्वादको लागि प्यानमा अलैंचीको धुलो र केसरको स्ट्र्यान्डहरू थप्नुहोस् (यदि प्रयोग गर्दै हुनुहुन्छ भने)।",
      "- तातो बन्द गर्नुहोस् र रसगुल्लालाई चिनीको सिरपमा चिसो पार्नुहोस्।",

      "६. रसगुल्ला सर्भ गर्नुहोस्:",
      "- चिसो भएपछि रसगुल्ला र सिरपलाई सर्भिङ बाउलमा सार्नुहोस्।",
      "- पिस्ता वा बदाम जस्ता काटेको नटले गार्निस गर्नुहोस्।",

      "7. आनन्द लिनुहोस्:",
      "- खाना पछि वा विशेष अवसरहरूमा मीठो र स्पन्जी रसगुल्लालाई स्वादिष्ट मिठाईको रूपमा सेवा गर्नुहोस्।"
    ]
  },
  {
    "stitle": "Barfi ",
    "simage": "images/barfi.png",
    "sdescription": "Sweet fudge made by Milk ",
    "ssteps": [
      "Ingredients for Barfi:",
      "- 2 cups milk powder",
      "- 1 cup condensed milk",
      "- 1/4 cup ghee (clarified butter)",
      "- 1/4 teaspoon cardamom powder",
      "- Chopped nuts for garnishing (like almonds or pistachios)",

      "Instructions for Barfi:",
      "1. Prepare the Base:",
      "- In a non-stick pan, heat ghee over low heat.",
      "- Add milk powder and sauté for a few minutes until it turns slightly golden and fragrant.",

      "2. Add Condensed Milk:",
      "- Pour in the condensed milk and mix well with the milk powder.",
      "- Keep stirring continuously to prevent sticking or burning.",

      "3. Cook the Mixture:",
      "- Continue stirring and cooking the mixture over low heat.",
      "- The mixture will start to thicken and come together. It will also leave the sides of the pan.",

      "4. Add Flavor and Shape:",
      "- Sprinkle cardamom powder over the mixture and mix thoroughly.",
      "- Turn off the heat and let the mixture cool slightly.",

      "5. Shape the Barfi:",
      "- Transfer the mixture onto a greased plate or tray.",
      "- Flatten and spread the mixture evenly using a spatula or the back of a spoon.",

      "6. Garnish and Set:",
      "- While the mixture is still warm, sprinkle chopped nuts over the top for garnishing.",
      "- Allow the mixture to cool and set completely, usually for a couple of hours.",

      "7. Cut and Serve Barfi:",
      "- Once the mixture is set and firm, use a knife to cut it into desired shapes like squares or diamonds.",
      "- Gently lift the pieces and serve them on a plate or in a box.",

      "8. Enjoy:",
      "- Enjoy the delicious and melt-in-your-mouth barfi as a sweet treat or gift it to friends and family on special occasions.",
      "Nepali:",
      "बर्फीको लागि सामग्री:",
      "- 2 कप दूध पाउडर",
      "- 1 कप गाढा दूध",
      "- 1/4 कप घिउ (स्पष्ट मक्खन)",
      "- 1/4 चम्चा अलैंची पाउडर",
      "- गार्निसिङको लागि काटेको नट (जस्तै बदाम वा पिस्ता)",

      "बर्फीको लागि निर्देशन:",
      "1. आधार तयार गर्नुहोस्:",
      "- नन-स्टिक प्यानमा, कम तातोमा घिउ तताउनुहोस्।",
      "- मिल्क पाउडर थप्नुहोस् र केहि मिनेटको लागि यो थोरै सुनौलो र सुगन्धित नभएसम्म पकाउनुहोस्।",

      "2. गाढा दूध थप्नुहोस्:",
      "- कन्डेन्स्ड मिल्कमा हाल्नुहोस् र मिल्क पाउडरसँग राम्ररी मिलाउनुहोस्।",
      "- टाँसिने वा जल्नबाट जोगाउन लगातार हलचल गर्नुहोस्।",

      "३. मिश्रण पकाउनुहोस्:",
      "- कम तातोमा मिश्रणलाई हलचल र पकाउन जारी राख्नुहोस्।",
      "- मिश्रण गाढा हुन थाल्छ र एकसाथ आउन थाल्छ। यसले प्यानको छेउमा पनि छोड्छ।",

      "4. स्वाद र आकार थप्नुहोस्:",
      "- मिश्रणमा अलैंचीको धुलो छर्केर राम्ररी मिलाउनुहोस्।",
      "- तातो बन्द गर्नुहोस् र मिश्रणलाई अलिकति चिसो दिनुहोस्।",

      "5. बर्फीलाई आकार दिनुहोस्:",
      "- मिश्रणलाई ग्रीस गरिएको प्लेट वा ट्रेमा स्थानान्तरण गर्नुहोस्।",
      "- स्प्याटुला वा चम्चाको पछाडिको प्रयोग गरी मिश्रणलाई समान रूपमा समतल र फैलाउनुहोस्।",

      "6. गार्निश र सेट:",
      "- मिश्रण अझै तातो हुँदा, गार्निसिङको लागि माथिबाट काटेको नट छर्क्नुहोस्।",
      "- मिश्रणलाई चिसो र पूर्ण रूपमा सेट गर्न अनुमति दिनुहोस्, सामान्यतया केही घण्टाको लागि।",

      "7. बर्फी काटेर सर्भ:",
      "- एक पटक मिश्रण सेट र बलियो भएपछि, चक्कु प्रयोग गर्नुहोस् यसलाई स्क्वायर वा हीरा जस्ता इच्छित आकारहरूमा काट्नुहोस्।",
      "- बिस्तारै टुक्राहरू उठाउनुहोस् र प्लेटमा वा बक्समा सेवा गर्नुहोस्।",

      "8. आनन्द लिनुहोस्:",
      "- मीठो उपचारको रूपमा स्वादिष्ट र पिघलिएको तपाईंको मुख बर्फीको आनन्द लिनुहोस् वा विशेष अवसरहरूमा साथीहरू र परिवारलाई उपहार दिनुहोस्।"
    ]
  },
  {
    "stitle": "Sandesh ",
    "simage": "images/sandesh.png",
    "sdescription": "Milk-based sweet",
    "ssteps": [
      "Ingredients for Sandesh:",
      "- 2 cups paneer (cottage cheese), crumbled",
      "- 1/2 cup powdered sugar (adjust to taste)",
      "- 1/4 teaspoon cardamom powder",
      "- Chopped nuts for garnishing (like pistachios or almonds)",

      "Instructions for Sandesh:",
      "1. Prepare the Paneer:",
      "- If using store-bought paneer, crumble it finely. If making paneer at home, follow the process to make and drain the paneer.",

      "2. Mix the Ingredients:",
      "- In a mixing bowl, combine the crumbled paneer and powdered sugar.",
      "- Mix well until the sugar is fully incorporated into the paneer.",

      "3. Cook the Mixture:",
      "- Transfer the paneer-sugar mixture to a non-stick pan.",
      "- Cook the mixture on low heat, stirring continuously to prevent sticking.",
      "- As the mixture heats up, it will release moisture and start to come together.",

      "4. Add Flavor and Shape:",
      "- Sprinkle cardamom powder into the mixture and continue cooking until it thickens further.",
      "- The mixture should start leaving the sides of the pan.",

      "5. Shape the Sandesh:",
      "- Turn off the heat and let the mixture cool slightly.",
      "- While it's still warm, take small portions and shape them into smooth round balls or flat discs.",

      "6. Garnish and Chill:",
      "- Press a chopped nut (like pistachio or almond) onto each sandesh piece for garnishing.",
      "- Place the sandesh in the refrigerator for at least an hour to set.",

      "7. Serve Sandesh:",
      "- Once set, gently remove the sandesh from the refrigerator.",
      "- Arrange them on a serving plate and offer them as a delightful sweet treat.",

      "8. Enjoy:",
      "- Enjoy the melt-in-your-mouth goodness of sandesh as a dessert or share them with loved ones on special occasions.",
      "Nepali:",
      "सन्देशका लागि सामग्री:",
      "- २ कप पनीर (कुटेज चीज), टुक्रा पारेको",
      "- 1/2 कप धुलो चिनी (स्वाद समायोजन)",
      "- 1/4 चम्चा अलैंची पाउडर",
      "- गार्निसिङको लागि काटेको नट (जस्तै पिस्ता वा बदाम)",

      "संदेश को लागि निर्देशन:",
      "1. पनीर तयार गर्नुहोस्:",
      "- यदि पसलबाट किनेको पनीर प्रयोग गर्दै हुनुहुन्छ भने, यसलाई राम्ररी टुक्रा पार्नुहोस्। यदि घरमा पनीर बनाउँदै हुनुहुन्छ भने, पनीर बनाउन र निकाल्ने प्रक्रियालाई पछ्याउनुहोस्।",

      "2. अवयवहरू मिलाउनुहोस्:",
      "- एक मिक्सिङ कचौरा मा, पनीर र धुलो चिनी मिलाउनुहोस्।",
      "- चिनी पनीरमा पूर्ण रूपमा नमिल्दासम्म राम्ररी मिलाउनुहोस्।",

      "३. मिश्रण पकाउनुहोस्:",
      "- पनीर-चिनी मिश्रणलाई नन-स्टिक प्यानमा स्थानान्तरण गर्नुहोस्।",
      "- मिश्रणलाई कम तातोमा पकाउनुहोस्, टाँस्नबाट जोगाउन लगातार हलचल गर्नुहोस्।",
      "- मिश्रण तातो भएपछि, यसले आर्द्रता छोड्छ र एकसाथ आउन थाल्छ।",

      "4. स्वाद र आकार थप्नुहोस्:",
      "- मिश्रणमा अलैंचीको धुलो छर्क्नुहोस् र यो अझ गाढा नभएसम्म पकाउन जारी राख्नुहोस्।",
      "- मिश्रण प्यानको छेउबाट छोड्न सुरु गर्नुपर्छ।",

      "५. सन्देशलाई आकार दिनुहोस्:",
      "- तातो बन्द गर्नुहोस् र मिश्रणलाई अलिकति चिसो दिनुहोस्।",
      "- यो अझै न्यानो हुँदा, सानो भाग लिनुहोस् र तिनीहरूलाई चिकनी गोल बल वा फ्ल्याट डिस्कहरूमा आकार दिनुहोस्।",

      "6. गार्निस र चिल:",
      "- गार्निसिङको लागि प्रत्येक सन्देसको टुक्रामा काटेको नट (जस्तै पिस्ता वा बदाम) थिच्नुहोस्।",
      "- सन्देसलाई कम्तिमा एक घण्टा सेट हुनको लागि फ्रिजमा राख्नुहोस्।",

      "७. सन्देश सेवा गर्नुहोस्:",
      "- एकपटक सेट भएपछि, फ्रिजबाट सन्देसलाई बिस्तारै हटाउनुहोस्।",
      "- तिनीहरूलाई सेवा गर्ने प्लेटमा व्यवस्थित गर्नुहोस् र तिनीहरूलाई रमाइलो मीठो उपचारको रूपमा प्रस्ताव गर्नुहोस्।",

      "8. आनन्द लिनुहोस्:",
      "- मिठाईको रूपमा सन्देशको पिघलिएको तपाईंको मुखको भलाइको आनन्द लिनुहोस् वा विशेष अवसरहरूमा प्रियजनहरूसँग साझा गर्नुहोस्।"
    ]
  },
  {
    "stitle": "Malpua ",
    "simage": "images/malpuwa.png",
    "sdescription": "Fried sweet pancake",
    "ssteps": [
      "Ingredients for Malpuwa:",
      "- 1 cup all-purpose flour",
      "- 1/2 cup rice flour",
      "- 1/2 cup semolina (sooji)",
      "- 1/2 cup mashed ripe banana",
      "- 1/2 cup sugar (adjust to taste)",
      "- 1/2 teaspoon cardamom powder",
      "- A pinch of salt",
      "- Water (as needed)",
      "- Oil for deep frying",
      "- Chopped nuts (like almonds or cashews) for garnishing",

      "Instructions for Malpuwa:",
      "1. Prepare the Batter:",
      "- In a mixing bowl, combine all-purpose flour, rice flour, semolina, and a pinch of salt.",
      "- Add mashed banana and sugar to the dry ingredients.",
      "- Gradually add water and mix to form a thick batter. The consistency should be similar to that of pancake batter.",
      "- Stir in cardamom powder for flavor.",

      "2. Heat Oil for Frying:",
      "- Heat oil in a deep pan or pot for deep frying. The oil should be medium-hot, not smoking.",

      "3. Fry the Malpuwa:",
      "- Once the oil is heated, reduce the heat to medium-low.",
      "- Take a ladleful of the prepared batter and pour it into the hot oil, gently spreading it to form a small round pancake.",
      "- Fry the malpuwa until it turns golden brown on both sides, flipping as needed.",
      "- Use a slotted spoon to remove the fried malpuwa from the oil and drain excess oil.",

      "4. Garnish and Serve:",
      "- While the malpuwa is still warm, sprinkle chopped nuts over the top for garnishing.",
      "- Repeat the frying process with the remaining batter.",

      "5. Enjoy:",
      "- Serve the delicious malpuwa as a sweet snack or dessert, perfect for celebrations or special occasions.",
      "Nepali:",
      "मालपुवाका लागि सामग्री:",
      "- 1 कप सबै उद्देश्यको पीठो",
      "- १/२ कप चामलको पीठो",
      "- 1/2 कप सूजी (सुजी)",
      "- १/२ कप पाकेको केरा",
      "- १/२ कप चिनी (स्वाद अनुसार)",
      "- 1/2 चम्चा अलैंची धुलो",
      "- एक चुटकी नुन",
      "- पानी (आवश्यकता अनुसार)",
      "- गहिरो फ्राइको लागि तेल",
      "- गार्निसिङको लागि काटेको नट (जस्तै बदाम वा काजू)",

      "माल्पुवाका लागि निर्देशन:",
      "१. ब्याटर तयार गर्नुहोस्:",
      "- एक मिक्सिङ कटोरामा, सबै उद्देश्यको पीठो, चामलको पीठो, सूजी र एक चिम्टी नुन मिलाउनुहोस्।",
      "- सुक्खा सामग्रीहरूमा मसला केरा र चिनी थप्नुहोस्।",
      "- बिस्तारै पानी थप्नुहोस् र बाक्लो ब्याटर बनाउन मिलाउनुहोस्। स्थिरता प्यानकेक ब्याटर जस्तै हुनुपर्छ।",
      "- स्वादको लागि अलैंची पाउडरमा हाल्नुहोस्।",

      "2. फ्राइको लागि तेल तताउनुहोस्:",
      "- गहिरो फ्राइङको लागि गहिरो प्यान वा भाँडोमा तेल तताउनुहोस्। तेल मध्यम तातो हुनुपर्छ, धुम्रपान होइन।",

      "३. मालपुवा फ्राइ:",
      "- एक पटक तेल तताएपछि, तातोलाई मध्यम-लोमा घटाउनुहोस्।",
      "- तयार गरिएको ब्याटरको एक थोपा लिनुहोस् र यसलाई तातो तेलमा हाल्नुहोस्, बिस्तारै यसलाई सानो गोलो प्यानकेक बनाउनुहोस्।",
      "- मालपुवालाई दुबै तर्फ सुनौलो खैरो नहोउन्जेल, आवश्यकता अनुसार पल्टाउनुहोस्।",
      "- तेलबाट भुटेको मालपुवा हटाउन र थप तेल निकाल्नको लागि स्लटेड चम्चा प्रयोग गर्नुहोस्।",

      "4. गार्निस र सर्भ:",
      "- मालपुवा अझै न्यानो हुँदा, गार्निसिङको लागि माथिबाट काटेको बदाम छर्क्नुहोस्।",
      "- बाँकी ब्याटरसँग फ्राइङ प्रक्रिया दोहोर्याउनुहोस्।",

      "5. आनन्द लिनुहोस्:",
      "- स्वादिष्ट मालपुवालाई मिठो खाजा वा मिठाईको रूपमा सेवा गर्नुहोस्, उत्सव वा विशेष अवसरहरूको लागि उपयुक्त।"
    ]
  },
  {
    "stitle": "Chhurpi ",
    "simage": "images/chuppri.png",
    "sdescription": "Hardened yak cheese, sometimes sweetened",
    "ssteps": [
      "Ingredients for Chhurpi:",
      "- 2 cups milk (cow's or yak's milk is traditionally used)",
      "- 1/4 teaspoon salt",
      "- A pinch of turmeric powder (optional)",
      "- Water (for boiling)",
      "- Cotton cloth or muslin cloth for straining",

      "Instructions for Chhurpi:",
      "1. Prepare the Milk:",
      "- In a pot, bring the milk to a boil over medium heat.",
      "- Add a pinch of salt to the boiling milk. You can also add a pinch of turmeric powder for color (optional).",

      "2. Curdle the Milk:",
      "- Once the milk comes to a boil, turn off the heat.",
      "- Gradually add water to the milk, stirring gently, until the milk curdles and the whey separates from the curdled milk solids.",

      "3. Strain the Curdled Milk:",
      "- Line a strainer or colander with a cotton cloth or muslin cloth.",
      "- Carefully pour the curdled milk into the cloth-lined strainer, allowing the whey to drain away.",
      "- Gather the cloth and gently squeeze to remove excess whey from the curdled milk solids (chhurpi).",

      "4. Hang and Dry the Chhurpi:",
      "- Tie the cloth with the curdled milk solids, and hang it in a cool, dry place to drain further and dry. This process can take a couple of days.",

      "5. Set and Harden the Chhurpi:",
      "- Once the curdled milk solids have drained and dried completely, they will harden to form chhurpi.",
      "- You can store the chhurpi as is or further sun-dry it to make it even harder and more shelf-stable.",

      "6. Enjoy Chhurpi:",
      "- Chhurpi can be enjoyed as a chewy and flavorful snack, either on its own or by grating it over dishes for added taste.",
      "- It's a popular traditional snack, especially in the mountainous regions of Nepal.",
      "Nepali:",
      "छुरपीका लागि सामग्री:",
      "- २ कप दूध (गाई वा याकको दूध परम्परागत रूपमा प्रयोग गरिन्छ)",
      "- 1/4 चम्मच नुन",
      "- एक चुटकी बेसारको धुलो (वैकल्पिक)",
      "- पानी (उमालेको लागि)",
      "- सुती कपडा वा मलमलको कपडा छिनाउनको लागि",

      "छुर्पीको लागि निर्देशन:",
      "1. दूध तयार गर्नुहोस्:",
      "- एउटा भाँडोमा, दूधलाई मध्यम तातोमा उमालेर ल्याउनुहोस्।",
      "- उमालेको दूधमा एक चुटकी नुन थप्नुहोस्। रङको लागि एक चुटकी बेसारको धुलो पनि थप्न सक्नुहुन्छ (वैकल्पिक)।",

      "2. दुधलाई कर्ल्ड गर्नुहोस्:",
      "- दुध उम्लिएपछि तातो बन्द गर्नुहोस्।",
      "- बिस्तारै दूधमा पानी थप्नुहोस्, बिस्तारै हलचल, जबसम्म दूधको दही र माटो दही भएको दूधको ठोसबाट अलग हुँदैन।",

      "३. दही दुधलाई तान्नुहोस्:",
      "- सुती कपडा वा मलमलको कपडाले स्ट्रेनर वा कोलान्डर लाइन गर्नुहोस्।",
      "- दहीको दूध सावधानीपूर्वक कपडा-लाइन भएको स्ट्रेनरमा खन्याउनुहोस्, मट्ठा निस्कन अनुमति दिनुहोस्।",
      "- कपडा जम्मा गर्नुहोस् र दही भएको दूध ठोस (छुरपी) बाट अतिरिक्त मट्ठा हटाउन बिस्तारै निचोड्नुहोस्।",

      "4. छुर्पी झुण्डाएर सुकाउनुहोस्:",
      "- दही भएको दुधको ठोस पदार्थले कपडा बाँध्नुहोस्, र यसलाई चिसो, सुक्खा ठाउँमा झुण्ड्याउनुहोस् र थप निकास गर्न र सुकाउनुहोस्। यो प्रक्रियाले केही दिन लिन सक्छ।",

      "5. छुर्पी सेट र कडा गर्नुहोस्:",
      "- एक पटक दही गरिएको दूधको ठोस निकास र पूर्ण रूपमा सुकेपछि, तिनीहरू चुर्पी बनाउन कडा हुनेछन्।",
      "- तपाईले छुरपीलाई जस्तै भण्डारण गर्न सक्नुहुन्छ वा यसलाई अझ कडा र अधिक सेल्फ-स्थिर बनाउन यसलाई घाममा सुकाउन सक्नुहुन्छ।",

      "6. छुर्पीको मजा लिनुहोस्:",
      "- छुर्पीलाई चपाउने र स्वादिलो खाजाको रूपमा रमाइलो गर्न सकिन्छ, या त आफैंले वा थप स्वादको लागि यसलाई भाँडामा पिसेर।",
      "- यो एक लोकप्रिय परम्परागत खाजा हो, विशेष गरी नेपालको पहाडी क्षेत्रहरूमा।"
    ]
  },
  {
    "stitle": "Pustakari ",
    "simage": "images/pustakari.png",
    "sdescription": "Sweetened and Hard rice flour snack",
    "ssteps": [
      "Ingredients for Pustakari:",
      "- 1 cup roasted black soybeans (bhatmas)",
      "- 1/2 cup roasted green peas",
      "- 1/4 cup roasted chickpeas (chana)",
      "- 1/4 cup roasted peanuts",
      "- 1/2 cup molasses (gud) or jaggery, grated",
      "- 1/4 teaspoon cardamom powder",
      "- 1/4 teaspoon nutmeg powder (optional)",
      "- A pinch of salt",

      "Instructions for Pustakari:",
      "1. Roast the Ingredients:",
      "- In a dry pan, roast black soybeans, green peas, chickpeas, and peanuts until they are crispy and slightly browned.",
      "- Allow the roasted ingredients to cool down completely.",

      "2. Prepare the Sweet Syrup:",
      "- In a separate pan, heat molasses (gud) or jaggery over low heat until it melts and becomes a syrup.",
      "- Add a pinch of salt, cardamom powder, and nutmeg powder (if using). Mix well.",

      "3. Mix the Ingredients:",
      "- In a mixing bowl, combine the roasted black soybeans, green peas, chickpeas, and peanuts.",
      "- Pour the prepared sweet syrup over the roasted ingredients.",
      "- Mix well to coat the roasted ingredients with the sweet syrup.",

      "4. Shape and Cool:",
      "- While the mixture is still warm, shape it into small clusters or lumps using your hands.",
      "- Let the pustakari clusters cool down and set.",

      "5. Serve Pustakari:",
      "- Once the pustakari is completely cooled and set, transfer it to a serving plate or airtight container.",
      "- Enjoy the delicious and energy-packed pustakari as a traditional Nepali sweet snack.",

      "Nepali:",
      "पुस्तकरीका लागि सामग्री:",
      "- १ कप भुटेको कालो भटमास (भटमास)",
      "- १/२ कप भुटेको हरियो मटर",
      "- 1/4 कप भुटेको चना (चना)",
      "- 1/4 कप भुटेको मूंगफली",
      "- 1/2 कप गुड़ (गुड) वा गुड़, पिसेको",
      "- 1/4 चम्चा अलैंची पाउडर",
      "- 1/4 चम्मच जायफल पाउडर (वैकल्पिक)",
      "- एक चुटकी नुन",

      "पुस्तकरीका लागि निर्देशन:",
      "१. सामाग्री रोस्ट गर्नुहोस्:",
      "- सुक्खा प्यानमा, कालो भटमास, हरियो मटर, चना र बदामलाई क्रिस्पी र थोरै खैरो नभएसम्म भुन्नुहोस्।",
      "- भुटेको सामग्रीलाई पूर्ण रूपमा चिसो हुन दिनुहोस्।",

      "2. मीठो सिरप तयार गर्नुहोस्:",
      "- छुट्टै प्यानमा गुड़ (गुड) वा गुड़लाई कम तातोमा पग्लेर सिरप नबन्दासम्म तताउनुहोस्।",
      "- एक चुटकी नुन, अलैंचीको धुलो र जायफलको धूलो (यदि प्रयोग गरिरहनु भएको छ भने) हाल्नुहोस्। राम्ररी मिलाउनुहोस्।",

      "३. अवयवहरू मिलाउनुहोस्:",
      "- एक मिक्सिङ कटोरामा, भुटेको कालो भटमास, हरियो मटर, चना र बदाम मिलाउनुहोस्।",
      "- भुटेको सामग्रीहरूमा तयार गरिएको मीठो सिरप खन्याउनुहोस्।",
      "- भुटेको सामग्रीलाई मीठो सिरपमा कोट गर्न राम्रोसँग मिलाउनुहोस्।",

      "4. आकार र कूल:",
      "- मिश्रण अझै न्यानो हुँदा, यसलाई आफ्नो हात प्रयोग गरेर साना गुच्छा वा गाँठहरूमा आकार दिनुहोस्।",
      "-पुस्तकारी क्लस्टरहरू चिसो र सेट गर्नुहोस्।",

      "5. पुस्तकारी सेवा गर्नुहोस्:",
      "- पुस्तकारी पूरै चिसो भइसकेपछि यसलाई सर्भिङ प्लेट वा एयरटाइट कन्टेनरमा सार्नुहोस्।",
      "- परम्परागत नेपाली मीठो खाजाको रूपमा स्वादिष्ट र ऊर्जाले भरिएको पुस्ताकरीको मजा लिनुहोस्।"
    ]
  },
  {
    "stitle": " Anarsa ",
    "simage": "images/anrasa.png",
    "sdescription": "Deep-fried sweet rice flour cakes",
    "ssteps": [
      "Ingredients for Anarasa:",
      "- 1 cup rice flour",
      "- 1/2 cup powdered jaggery or brown sugar",
      "- 1/4 cup milk",
      "- A pinch of cardamom powder",
      "- Ghee (clarified butter) or oil for frying",
      "- Sesame seeds for garnishing",
      "- Water (as needed)",

      "Instructions for Anarasa:",
      "1. Prepare the Rice Flour:",
      "- In a bowl, take rice flour and sift it to remove any lumps. Set it aside.",

      "2. Make Jaggery Syrup:",
      "- In a saucepan, heat powdered jaggery or brown sugar with milk over low heat.",
      "- Stir until the jaggery completely dissolves and forms a syrup. Turn off the heat.",
      "- Allow the syrup to cool down slightly before using.",

      "3. Mix the Ingredients:",
      "- Gradually add the jaggery syrup to the sifted rice flour.",
      "- Mix well to form a crumbly mixture. Add water, little by little, to make a soft dough. The dough should be pliable and not too sticky.",

      "4. Shape Anarasa:",
      "- Take a small portion of the dough and roll it into a smooth ball.",
      "- Flatten the ball slightly and press sesame seeds onto one side of the dough. Press gently to adhere the seeds.",

      "5. Deep Fry Anarasa:",
      "- Heat ghee or oil in a deep frying pan over medium heat.",
      "- Carefully slide the prepared anarasa into the hot oil and deep fry until it turns golden brown and crispy on both sides.",
      "- Use a slotted spoon to remove the fried anarasa from the oil and drain excess oil.",

      "6. Drain and Cool:",
      "- Place the fried anarasa on paper towels to absorb excess oil.",
      "- Let the anarasa cool down and become crisp.",

      "7. Enjoy Anarasa:",
      "- Once cooled, your anarasa is ready to be enjoyed as a delicious and sweet treat, perfect for festive occasions and celebrations.",
      "Nepali:",
      "अनारसाका लागि सामग्री:",
      "- १ कप चामलको पीठो",
      "- 1/2 कप पाउडर गरिएको गुड़ वा ब्राउन शुगर",
      "- 1/4 कप दूध",
      "एक चिम्टी अलैंचीको धुलो",
      "- घिउ (स्पष्ट मक्खन) वा फ्राइको लागि तेल",
      "- सजाउनको लागि तिलको दाना",
      "- पानी (आवश्यकता अनुसार)",

      "अनारसाका लागि निर्देशन:",
      "१. चामलको पिठो तयार गर्नुहोस्:",
      "- एउटा कचौरामा चामलको पीठो लिनुहोस् र कुनै पनि गाँठो हटाउनको लागि यसलाई छान्नुहोस्। यसलाई अलग गर्नुहोस्।",

      "2. गुड़को सिरप बनाउनुहोस्:",
      "- सस प्यानमा, कम तातोमा दूधमा धुलो गुड़ वा ब्राउन सुगर तताउनुहोस्।",
      "- गुड़ पूरै पग्लिएर सिरप नबनोस्सम्म हलचल गर्नुहोस्। तातो बन्द गर्नुहोस्।",
      "- प्रयोग गर्नु अघि सिरपलाई थोरै चिसो हुन दिनुहोस्।",

      "३. अवयवहरू मिलाउनुहोस्:",
      "- बिस्तारै चामलको पीठोमा गुड़को सिरप थप्नुहोस्।",
      "- कुकुरको मिश्रण बनाउन राम्ररी मिलाउनुहोस्। नरम आटा बनाउनको लागि अलि-अलि पानी थप्नुहोस्। पीठो लचिलो हुनुपर्छ र धेरै टाँसिने छैन।",

      "4. अनारसा आकार:",
      "- आटाको सानो भाग लिनुहोस् र यसलाई चिल्लो बलमा घुमाउनुहोस्।",
      "- बललाई थोरै समतल पार्नुहोस् र आटाको एक छेउमा तिल थिच्नुहोस्। बीउहरू टाँस्न बिस्तारै थिच्नुहोस्।",

      "५. डीप फ्राई अनारसा:",
      "- गहिरो फ्राइङ प्यानमा घिउ वा तेल मध्यम तातोमा तताउनुहोस्।",
      "- तयार अनारसालाई ध्यानपूर्वक तातो तेलमा फ्याँक्नुहोस् र दुबै तर्फ सुनौलो खैरो र क्रिस्पी नभएसम्म गहिरो फ्राइ गर्नुहोस्।",
      "- तेलबाट भुटेको अनारसा हटाउन र थप तेल निकाल्नको लागि स्लटेड चम्चा प्रयोग गर्नुहोस्।",

      "6. ड्रेन र कूल:",
      "- अतिरिक्त तेल अवशोषित गर्न कागजको तौलियामा भुटेको अनारसा राख्नुहोस्।",
      "- अनारसालाई चिसो पार्नुहोस् र कुरकुरा बनाउनुहोस्।",

      "7. अनारसाको आनन्द लिनुहोस्:",
      "- एक पटक चिसो भएपछि, तपाईंको अनारसा स्वादिष्ट र मीठो उपचारको रूपमा रमाइलो गर्न तयार छ, उत्सव अवसरहरू र उत्सवहरूको लागि उपयुक्त।"
    ]
  },
  {
    "stitle": "Sikarni ",
    "simage": "images/sikarni.png",
    "sdescription": "Sweet yogurt dessert",
    "ssteps": [
      "Ingredients for Sikarni:",
      "- 2 cups plain yogurt",
      "- 1/2 cup powdered sugar (adjust to taste)",
      "- 1/4 cup chopped dried fruits (raisins, apricots, dates, etc.)",
      "- 1/4 cup chopped nuts (almonds, cashews, pistachios, etc.)",
      "- 1/2 teaspoon cardamom powder",
      "- A pinch of saffron strands (optional)",
      "- A pinch of nutmeg powder (optional)",
      "- Fresh fruits (bananas, oranges, etc.) for garnishing",
      "- Honey or maple syrup (optional)",

      "Instructions for Sikarni:",
      "1. Whisk Yogurt and Sugar:",
      "- Take plain yogurt in a mixing bowl and whisk until smooth.",
      "- Add powdered sugar to the yogurt and mix well until sugar dissolves.",

      "2. Add Flavors and Ingredients:",
      "- Sprinkle cardamom powder and nutmeg powder (if using) into the yogurt.",
      "- Toss in chopped dried fruits and nuts.",
      "- If using saffron strands, soak them in a little warm milk and then add for color and aroma.",

      "3. Mix and Chill:",
      "- Gently mix everything to distribute flavors evenly.",
      "- Cover the bowl and refrigerate for a few hours to allow flavors to meld.",

      "4. Serve Sikarni:",
      "- Give the sikarni a quick stir before serving.",
      "- Divide it into serving bowls.",

      "5. Garnish and Enjoy:",
      "- Garnish with slices of fresh fruits like bananas or oranges.",
      "- Drizzle honey or maple syrup on top for extra sweetness if desired.",

      "6. Enjoy Sikarni:",
      "- Savor the delicious and creamy sikarni as a traditional sweet yogurt dessert, often enjoyed during festivals and special occasions.",
      "Nepali:",
      "सिकर्नीको लागि सामग्री:",
      "- २ कप सादा दही",
      "- 1/2 कप धुलो चिनी (स्वाद समायोजन)",
      "- १/४ कप काटेको सुकेको फल (किसमिस, खुबानी, खजूर, आदि)",
      "- 1/4 कप काटेको नट (बदाम, काजू, पिस्ता, आदि)",
      "- 1/2 चम्चा अलैंची धुलो",
      "- एक चुटकी केसर स्ट्र्यान्ड (वैकल्पिक)",
      "- एक चुटकी जायफल पाउडर (वैकल्पिक)",
      "- गार्निसिङका लागि ताजा फलहरू (केरा, सुन्तला, आदि)",
      "- मह वा मेपल सिरप (वैकल्पिक)",

      "सिकर्नीको लागि निर्देशन:",
      "1. दही र चिनी फेर्ने:",
      "- एक मिक्सिङ कचौरामा सादा दही लिनुहोस् र चिल्लो नभएसम्म हल्किनुहोस्।",
      "- दहीमा धुलो चिनी हाल्नुहोस् र चिनी पग्लिएसम्म राम्ररी मिलाउनुहोस्।",

      "२. स्वाद र सामग्री थप्नुहोस्:",
      "- दहीमा अलैंचीको धुलो र जायफलको धूलो (यदि प्रयोग गर्ने हो भने) छर्काउनुहोस्।",
      "- काटिएको सुकेको फल र नट मा टास।",
      "- यदि केसरको स्ट्र्यान्ड प्रयोग गर्दै हुनुहुन्छ भने, तिनीहरूलाई थोरै तातो दूधमा भिजाउनुहोस् र रङ र सुगन्धको लागि थप्नुहोस्।",

      "३. मिक्स एण्ड चिल:",
      "- स्वादहरू समान रूपमा वितरण गर्न बिस्तारै सबै कुरा मिलाउनुहोस्।",
      "- कचौरा छोप्नुहोस् र स्वादहरू मिलाउन केही घण्टाको लागि फ्रिज गर्नुहोस्।",

      "4. सिकरनीको सेवा गर्नुहोस्:",
      "- सेवा गर्नु अघि सिकरनीलाई छिटो हलचल दिनुहोस्।",
      "- यसलाई सेवा गर्ने कचौराहरूमा विभाजन गर्नुहोस्।",

      "5. गार्निश र आनन्द लिनुहोस्:",
      "- केरा वा सुन्तला जस्ता ताजा फलफूलका टुक्राहरूसँग गार्निस गर्नुहोस्।",
      "- यदि चाहियो भने थप मिठासको लागि मह वा म्यापल सिरप माथि छोप्नुहोस्।",

      "६. सिक्रनीको मजा लिनुहोस्:",
      "- स्वादिष्ट र क्रीमयुक्त सिकरनीलाई परम्परागत मीठो दही मिठाईको रूपमा स्वाद लिनुहोस्, प्रायः चाडपर्व र विशेष अवसरहरूमा रमाइलो हुन्छ।"
    ]
  },
  {
    "stitle": "Juju Dhau",
    "simage": "images/jujudhau.png",
    "sdescription": "Nepali 'King Curd",
    "ssteps": [
      "Ingredients for Juju Dhau:",
      "- 1 liter whole milk",
      "- 1/2 cup condensed milk (optional, for extra richness)",
      "- 1/4 cup sugar (adjust to taste)",
      "- A pinch of cardamom powder",
      "- A pinch of saffron strands (optional)",
      "- 1 teaspoon cornstarch (optional, for thicker consistency)",
      "- A few drops of lemon juice (for curdling)",

      "Instructions for Juju Dhau:",
      "1. Heat Milk:",
      "- In a heavy-bottomed pot, heat the whole milk over medium heat.",
      "- Stir occasionally to prevent the milk from sticking to the bottom.",

      "2. Add Condensed Milk and Sugar (if using):",
      "- If using condensed milk for added richness, you can add it to the heating milk.",
      "- Stir in sugar to sweeten the yogurt. Adjust the amount according to your taste preference.",

      "3. Infuse Flavors:",
      "- Add a pinch of cardamom powder and saffron strands (if using) to the milk.",
      "- Allow the milk to simmer gently, infusing the flavors.",

      "4. Curdle the Milk:",
      "- When the milk is heated but not boiling, add a few drops of lemon juice.",
      "- Stir gently until the milk starts to curdle and the whey separates from the curdled milk solids.",

      "5. Strain and Set Curd:",
      "- Line a strainer or colander with a muslin cloth.",
      "- Carefully pour the curdled milk into the cloth-lined strainer to separate the whey from the curds.",
      "- Allow the curds to drain for a while, but don't let them become too dry.",

      "6. Thicken the Yogurt (optional):",
      "- For a thicker consistency, you can mix cornstarch with a little milk to form a smooth paste.",
      "- Add this paste to the curds and gently mix.",

      "7. Fill Containers:",
      "- Transfer the curds to earthenware or any food-safe containers for setting.",
      "- Cover the containers with a clean cloth to prevent dust and let the yogurt set.",

      "8. Set Yogurt:",
      "- Place the containers in a warm and undisturbed place to allow the yogurt to set.",
      "- Depending on the temperature, it may take 6-8 hours or longer for the yogurt to set completely.",

      "9. Refrigerate and Serve:",
      "- Once set, refrigerate the Juju Dhau to chill.",
      "- Serve the creamy and indulgent Juju Dhau as a delightful Nepali yogurt dessert, often enjoyed during festivals and special occasions.",
      "Nepali:",
      "जुजु धाउको लागि सामग्री:",
      "- 1 लिटर सम्पूर्ण दूध",
      "- १/२ कप कन्डेन्स्ड मिल्क (वैकल्पिक, अतिरिक्त समृद्धिका लागि)",
      "- १/४ कप चिनी (स्वाद अनुसार)",
      "एक चिम्टी अलैंचीको धुलो",
      "- एक चुटकी केसर स्ट्र्यान्ड (वैकल्पिक)",
      "- १ चम्चा मकैको स्टार्च (वैकल्पिक, बाक्लो स्थिरताको लागि)",
      "- कागतीको रसका केही थोपा (दहीको लागि)",

      "जुजु धौ को लागि निर्देशन:",
      "1. दूध तातो:",
      "- भारी तल्लो भाँडामा, सम्पूर्ण दूधलाई मध्यम तातोमा तताउनुहोस्।",
      "- दूधलाई तल्लो भागमा टाँसिनबाट जोगाउन कहिलेकाहीं हलचल गर्नुहोस्।",

      "२. कन्डेन्स्ड दूध र चिनी थप्नुहोस् (यदि प्रयोग गर्दै हुनुहुन्छ):",
      "- यदि थप समृद्धिको लागि कन्डेन्स्ड दूध प्रयोग गर्दै हुनुहुन्छ भने, तपाइँ यसलाई तताउने दूधमा थप्न सक्नुहुन्छ।",
      "- दहीलाई मीठो बनाउन चिनी हाल्नुहोस्। आफ्नो स्वाद प्राथमिकता अनुसार मात्रा मिलाउनुहोस्।",

      "३. स्वादहरू इन्फ्यूज गर्नुहोस्:",
      "- दूधमा एक चुटकी अलैंचीको धूलो र केसरको टुक्रा (यदि प्रयोग गर्ने हो भने) थप्नुहोस्।",
      "- दूधलाई बिस्तारै उमाल्न दिनुहोस्, स्वादहरू भर्नुहोस्।",

      "4. दुधलाई कर्ल्ड गर्नुहोस्:",
      "- जब दूध तताए पनि उमाल्दैन, केही थोपा कागतीको रस हाल्नुहोस्।",
      "- दूध दही हुन थालेसम्म र दही दूधको ठोस पदार्थबाट मट्ठा अलग नभएसम्म बिस्तारै हलचल गर्नुहोस्।",

      "५. तनाउ र सेट दही:",
      "- मलमलको कपडाले स्ट्रेनर वा कोलान्डर लाइन गर्नुहोस्।",
      "- दहीबाट मठ्ठा छुट्याउन कपडाको स्ट्रेनरमा दही भएको दूध सावधानीपूर्वक खन्याउनुहोस्।",
      "- दहीलाई केही समयको लागि निस्कन दिनुहोस्, तर तिनीहरूलाई धेरै सुक्न नदिनुहोस्।",

      "6. दही गाढा बनाउनुहोस् (वैकल्पिक):",
      "- बाक्लो स्थिरताको लागि, तपाइँ एक चिल्लो पेस्ट बनाउन को लागी अलिकति दूध संग मकैको स्टार्च मिलाउन सक्नुहुन्छ।",
      "- यो पेस्ट दहीमा हाल्नुहोस् र बिस्तारै मिलाउनुहोस्।",

      "7. कन्टेनरहरू भर्नुहोस्:",
      "- दहीलाई माटोको भाँडो वा कुनै पनि खाना सुरक्षित कन्टेनरमा सेटिङको लागि स्थानान्तरण गर्नुहोस्।",
      "- धुलोबाट बच्न कन्टेनरहरूलाई सफा कपडाले छोप्नुहोस् र दही सेट हुन दिनुहोस्।",

      "8. दही सेट गर्नुहोस्:",
      "- दही सेट हुन अनुमति दिन कन्टेनरहरूलाई न्यानो र अबाधित ठाउँमा राख्नुहोस्।",
      "- तापक्रममा निर्भर गर्दै, दही पूर्ण रूपमा सेट हुन 6-8 घण्टा वा बढी लाग्न सक्छ।",

      "9. फ्रिज गर्नुहोस् र सेवा गर्नुहोस्:",
      "- सेट भएपछि, जुजु धौलाई चिसो गर्न फ्रिज गर्नुहोस्।",
      "- मलाईदार र रमाईलो जुजु धाउलाई रमाइलो नेपाली दही मिठाईको रूपमा सेवा गर्नुहोस्, प्रायः चाडपर्व र विशेष अवसरहरूमा रमाइलो गरिन्छ।"
    ]
  },
  {
    "stitle": "Jeri Puri",
    "simage": "images/jeriswari.png",
    "sdescription": "Deep Fried Soaked in syrup Flourbatter Served with Puri ",
    "ssteps": [
      "Ingredients for Jeri:",
      "- 1 cup all-purpose flour",
      "- 1/4 cup yogurt",
      "- A pinch of baking powder",
      "- A pinch of cardamom powder",
      "- Ghee or oil for deep frying",

      "Ingredients for Sugar Syrup (Chashni):",
      "- 1 cup sugar",
      "- 1/2 cup water",
      "- A pinch of cardamom powder",
      "- Saffron strands (optional)",

      "Ingredients for Puri Roti:",
      "- 1 cup whole wheat flour",
      "- Water for kneading",
      "- Ghee or oil for cooking",

      "Instructions for Jeri:",
      "1. Prepare Dough:",
      "- In a bowl, mix all-purpose flour, baking powder, and cardamom powder.",
      "- Add yogurt and knead into a soft dough. Let it rest for 15-20 minutes.",

      "2. Fry Jeri:",
      "- Heat ghee or oil in a deep pan over medium heat.",
      "- Hold the dough high and drizzle thin streams into the hot oil to form a mesh-like pattern.",
      "- Fry until the jeri turns golden and crispy. Remove and drain excess oil.",

      "3. Prepare Sugar Syrup:",
      "- In a separate pot, combine sugar and water for the syrup.",
      "- Add cardamom powder and saffron strands if desired.",
      "- Cook until the syrup forms a one-string consistency. Remove from heat.",

      "4. Soak in Syrup:",
      "- Dip the fried jeri into the hot sugar syrup for a few minutes.",
      "- Ensure they are well-coated with the syrup. Remove and set aside.",

      "Instructions for Puri Roti:",
      "1. Make Dough:",
      "- In a bowl, mix whole wheat flour with water to make a firm dough.",
      "- Divide the dough into small portions and roll them into balls.",

      "2. Roll and Cook Puri Roti:",
      "- Roll each dough ball into a thin, circular roti using a rolling pin.",
      "- Heat a tawa or flat pan and cook the roti with a little ghee or oil until both sides are golden.",

      "Instructions for Serving Jeri with Puri Roti:",
      "- Arrange the soaked jeri on a plate.",
      "- Serve the jeri alongside the puri roti.",
      "- To enjoy, tear a piece of puri roti and dip it into the sweet and crunchy jeri for a delightful combination of flavors and textures.",

      "Enjoy your Jeri with Puri Roti!",

      "Nepali:",
      "जेरीका लागि सामग्री:",
      "- 1 कप सबै उद्देश्यको पीठो",
      "- 1/4 कप दही",
      "- एक चिम्टी बेकिंग पाउडर",
      "एक चिम्टी अलैंचीको धुलो",
      "- गहिरो फ्राइको लागि घिउ वा तेल",

      "चिनी सिरप (चाश्नी) को लागि सामग्री):",
      "- १ कप चिनी",
      "- 1/2 कप पानी",
      "एक चिम्टी अलैंचीको धुलो",
      "- केसर स्ट्रेन्ड्स (वैकल्पिक)",

      "पुरी रोटीका लागि सामग्री:",
      "- 1 कप पुरा गहुँको पीठो",
      "- घुट्ने पानी",
      "- पकाउनको लागि घिउ वा तेल",

      "Jeri को लागि निर्देशन:",
      "1. आटा तयार गर्नुहोस्:",
      "- एउटा कचौरामा, सबै उद्देश्यको पीठो, बेकिंग पाउडर र अलैंची पाउडर मिलाउनुहोस्।",
      "- दही थप्नुहोस् र नरम पीठोमा मुछ्नुहोस्। यसलाई 15-20 मिनेटको लागि आराम दिनुहोस्।",

      "२. फ्राइ जेरी:",
      "- गहिरो प्यानमा घिउ वा तेल मध्यम तामा तताउनुहोस्।",
      "- आटालाई अग्लो होल्ड गर्नुहोस् र तातो तेलमा पातलो धाराहरू जाल जस्तै बनाउनुहोस्।",
      "- जेरी सुनौलो र क्रिस्पी नहोउन्जेल फ्राइ गर्नुहोस्। अतिरिक्त तेल हटाउनुहोस् र निकाल्नुहोस्।",

      "3. चिनी सिरप तयार गर्नुहोस्:",
      "- छुट्टै भाँडोमा, सिरपको लागि चिनी र पानी मिलाउनुहोस्।",
      "- यदि चाहानुहुन्छ भने अलैंची पाउडर र केसर स्ट्र्यान्ड थप्नुहोस्।",
      "- सिरपले एक-स्ट्रिङ स्थिरता नभएसम्म पकाउनुहोस्। तातोबाट हटाउनुहोस्।",

      "4. सिरपमा भिजाउनुहोस्:",
      "- भुटेको जेरीलाई तातो चिनीको सिरपमा केही मिनेट डुबाउनुहोस्।",
      "- तिनीहरू सिरपसँग राम्ररी लेपित छन् भनेर सुनिश्चित गर्नुहोस्। हटाउनुहोस् र अलग गर्नुहोस्।",

      "पुरी रोटीको लागि निर्देशन:",
      "१. आटा बनाउनुहोस्:",
      "- एउटा कचौरामा, गहुँको पिठोलाई पानीमा मिसाएर बलियो आटा बनाउनुहोस्।",
      "- आटालाई सानो भागमा विभाजन गर्नुहोस् र तिनीहरूलाई बलहरूमा घुमाउनुहोस्।",

      "२. रोल एण्ड कुक पुरी रोटी:",
      "- प्रत्येक पिठोको बललाई रोलिङ पिन प्रयोग गरी पातलो, गोलाकार रोटीमा घुमाउनुहोस्।",
      "- तवा वा समतल प्यान तताउनुहोस् र रोटीलाई अलिकति घिउ वा तेलले दुवै पक्ष सुनौलो नभएसम्म पकाउनुहोस्।",

      "पुरी रोटी संग जेरी सेवा गर्न निर्देशन:",
      "- भिजेको जेरी प्लेटमा मिलाउनुहोस्।",
      "- पुरी रोटीसँगै जेरीलाई सेवा गर्नुहोस्।",
      "- रमाइलो गर्न, पुरी रोटीको टुक्रा च्यात्नुहोस् र स्वाद र बनावटको रमाइलो संयोजनको लागि मीठो र कुरकुरा जेरीमा डुबाउनुहोस्।",

      "पुरी रोटीसँग जेरीको मजा लिनुहोस्!"
    ]
  },
  {
    "stitle": "Gudpak",
    "simage": "images/gudpak.png",
    "sdescription": "Milk and jaggery dessert ",
    "ssteps": [
      "Ingredients for Gudpak:",
      "- 2 cups grated jaggery (gud)",
      "- 1 cup gram flour (besan)",
      "- 1/2 cup ghee",
      "- 1/2 cup chopped nuts (almonds, cashews, pistachios)",
      "- 1/2 teaspoon cardamom powder",
      "- A pinch of nutmeg powder (optional)",

      "Instructions for Gudpak:",
      "1. Roast Gram Flour:",
      "- Heat a non-stick pan on low heat.",
      "- Add gram flour and dry roast, stirring continuously, until it turns fragrant and changes color slightly. Be careful not to burn it. Remove from heat and set aside.",

      "2. Prepare Jaggery Syrup:",
      "- In a separate pot, melt the grated jaggery with a little water.",
      "- Cook on medium heat until the jaggery completely dissolves and forms a syrup.",
      "- Test the syrup's consistency by dropping a small amount in cold water. It should form a soft ball when rolled between your fingers.",

      "3. Combine Gram Flour and Jaggery:",
      "- Add the roasted gram flour to the jaggery syrup while stirring continuously to prevent lumps.",
      "- Cook the mixture on low heat, stirring constantly, until it thickens and leaves the sides of the pan.",

      "4. Add Nuts and Flavorings:",
      "- Stir in ghee, chopped nuts, cardamom powder, and nutmeg powder (if using). Mix well.",

      "5. Set and Serve:",
      "- Transfer the mixture to a greased plate or tray.",
      "- Flatten and smoothen the top using a spatula.",
      "- Allow it to cool and set for a while.",
      "- Once it's firm, cut into desired shapes or squares.",

      "6. Enjoy:",
      "- Your Gudpak is ready to be enjoyed as a traditional Nepali sweet treat!",

      "Nepali:",
      "गुडपाकका लागि सामग्री:",
      "- २ कप पिसेको गुड़",
      "- 1 कप चना (बेसन)",
      "- 1/2 कप घिउ",
      "- १/२ कप काटेको नट (बदाम, काजू, पिस्ता)",
      "- 1/2 चम्चा अलैंची धुलो",
      "- एक चुटकी जायफल पाउडर (वैकल्पिक)",

      "गुडपाकका लागि निर्देशन:",
      "१. रोस्ट बेसन:",
      "- कम तातोमा नन-स्टिक प्यान तताउनुहोस्।",
      "- चना र सुख्खा रोस्ट थप्नुहोस्, लगातार हलचल, जबसम्म यो सुगन्धित हुँदैन र रंग अलिकति परिवर्तन हुँदैन। सावधान रहनुहोस् कि यसलाई जलाउन नदिनुहोस्। तातोबाट हटाउनुहोस् र अलग गर्नुहोस्।",

      "2. गुड़को सिरप तयार गर्नुहोस्:",
      "- छुट्टै भाँडोमा पिसेको गुड़लाई थोरै पानीमा पगाल्नुहोस्।",
      "- गुड़ पूरै पग्लिएर सिरप नबनोस्सम्म मध्यम तातोमा पकाउनुहोस्।",
      "- चिसो पानीमा थोरै मात्रामा खसालेर सिरपको स्थिरता परीक्षण गर्नुहोस्। तपाईंको औंलाहरू बीच घुमाउँदा यसले नरम बल बनाउँछ।",

      "३. चना र गुड़ मिलाउनुहोस्:",
      "- गुड़को सिरपमा भुटेको चना मिसाएर गाँठो हुनबाट जोगाउन लगातार हलचल गर्नुहोस्।",
      "- मिश्रणलाई कम तातोमा पकाउनुहोस्, लगातार हल्लाउँदै, जबसम्म यो गाढा हुँदैन र प्यानको छेउबाट बाहिर जान्छ।",

      "4. नट र स्वाद थप्नुहोस्:",
      "- घ्यू, काटेको बदाम, अलैंचीको धुलो र जायफलको धूलो (यदि प्रयोग गर्ने हो भने) मिलाउनुहोस्। राम्रोसँग मिलाउनुहोस्।",

      "5. सेट र सर्भ:",
      "- मिश्रणलाई ग्रीस गरिएको प्लेट वा ट्रेमा स्थानान्तरण गर्नुहोस्।",
      "- स्प्याटुला प्रयोग गरेर माथिल्लो भागलाई समतल र चिल्लो बनाउनुहोस्।",
      "- यसलाई चिसो हुन दिनुहोस् र केहि समयको लागि सेट गर्नुहोस्।",
      "- यो दृढ भएपछि, इच्छित आकार वा वर्गहरूमा काट्नुहोस्।",

      "6. आनन्द लिनुहोस्:",
      "- तपाईंको गुडपाक एक परम्परागत नेपाली मिठाईको रूपमा रमाइलो गर्न तयार छ!"
    ]
  },
  {
    "stitle": "Sarbat",
    "simage": "images/sarbat.png",
    "sdescription": "Nepali Sweet Yogurt Drink",
    "ssteps": [
      "Ingredients for Sarbat (Nepali Sweet Yogurt Drink):",
      "- 2 cups plain yogurt",
      "- 1/2 cup sugar (adjust to taste)",
      "- 1/2 cup chilled milk",
      "- 1/2 teaspoon cardamom powder",
      "- A pinch of saffron strands (optional)",
      "- Crushed ice for serving",
      "- Chopped nuts (almonds, pistachios) for garnishing",

      "Instructions for Sarbat:",
      "1. Blend Yogurt and Sugar:",
      "- In a blender, add plain yogurt and sugar.",
      "- Blend until the sugar is fully dissolved and the mixture is smooth.",

      "2. Add Milk and Flavorings:",
      "- Pour in chilled milk and continue blending until well combined.",
      "- Add cardamom powder and saffron strands (if using) for flavor.",

      "3. Chill and Serve:",
      "- Place the prepared Sarbat in the refrigerator to chill for at least 1 hour.",
      "- Before serving, give the Sarbat a good stir.",

      "4. Serve with Ice and Nuts:",
      "- To serve, add a handful of crushed ice to glasses.",
      "- Pour the chilled Sarbat over the ice.",
      "- Garnish with chopped nuts on top.",

      "5. Enjoy:",
      "- Your refreshing Nepali Sarbat is ready to be enjoyed as a sweet and cooling drink!",

      "Nepali:",
      "सरबतका लागि सामग्री (नेपाली मीठो दही पेय):",
      "- २ कप सादा दही",
      "- १/२ कप चिनी (स्वाद अनुसार)",
      "- १/२ कप चिसो दूध",
      "- 1/2 चम्चा अलैंची धुलो",
      "- एक चुटकी केसर स्ट्र्यान्ड (वैकल्पिक)",
      "- सेवाको लागि कुचिएको बरफ",
      "- गार्निसिङको लागि काटेको नट (बदाम, पिस्ता)",

      "सरबतको लागि निर्देशन:",
      "1. दही र चिनी मिलाउनुहोस्:",
      "- ब्लेंडरमा सादा दही र चिनी हाल्नुहोस्।",
      "- चिनी पूर्णतया भंग नभएसम्म र मिश्रण चिकनी नभएसम्म मिश्रण गर्नुहोस्।",

      "2. दूध र स्वाद थप्नुहोस्:",
      "- चिसो दूधमा हाल्नुहोस् र राम्ररी नमिल्दा सम्म मिश्रण जारी राख्नुहोस्।",
      "- स्वादको लागि अलैंची पाउडर र केसर स्ट्र्यान्डहरू (यदि प्रयोग गरिएमा) थप्नुहोस्।",

      "३. चिल एण्ड सर्भ:",
      "- तयार सरबतलाई फ्रिजमा कम्तिमा १ घन्टा चिसो पार्न राख्नुहोस्।",
      "- सेवा गर्नु अघि, सरबत राम्रोसँग हलचल दिनुहोस्।",

      "4. बरफ र नट संग सेवा गर्नुहोस्:",
      "- सेवा गर्न, गिलासमा कुचिएको बरफको मुट्ठी थप्नुहोस्।",
      "- चिसो सरबत बरफमा खन्याउ।",
      "- माथि कटा नट संग गार्निश।",

      "5. आनन्द लिनुहोस्:",
      "- तपाइँको स्फूर्तिदायी नेपाली सरबत मिठो र चिसो पेयको रूपमा रमाइलो गर्न तयार छ!"
    ]
  }
]
